{"title":"[XXXPawn] Jenny Gets Her Ass Pounded At The Pawn Shop (08.29.201","uid":10932050,"size":508335537,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:024e53dca22f22b4adfc60fab5ff999a6035ba67&amp;dn=%5BXXXPawn%5D+Jenny+Gets+Her+Ass+Pounded+At+The+Pawn+Shop+%2808.29.201&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1409411161,"description":"[XXXPawn] Jenny Gets Her Ass Pounded At The Pawn Shop (08.29.2014)\n\nCheck the skills y'all. I got more game than a toy store. This time I scored a tiny college girl named... Jenny? I'm not too sure about that detail, but I did observe that her ex boyfriend had cheated on her, and she would probably be down for a revenge fuck, or at least a strange dick. It didn't take too much flirting to win her cute ass over. I mean, I was laying it on awfully thick. She told me she had only had sex with one man in her short life, and I told her we'd have to change that quick, and we did. She had great natural tits that I'd consider big for such a petite little lady. Ya know, the kind that bounce and sway. I started off by finger blasting her little pussy, and boy was that cute thing tight. When she finally got her small hands on my dick she said it was the biggest she had ever seen. I wasn't surprised. She must have felt like she went from little league to the majors. My cock barely fit in her mouth, but she still gave a great blow job for a girl with such low mileage. Fucking her was incredible. I'm surprised no one heard us in the shop. I had her butt screaming and moaning loud as hell. And guess what, I got to christen her. That's right, her first facial compliments of Sean 'Strange Dick' Lawless. I sent her on her way in true xxxpawn style. I had to. I could tell this one would be clingier that a sock from the dryer. Besides, nothing in a pawn shop should be permanent. Enjoy.\n\nScreens:\n\n\n &lt;a href=&quot;\nhttp://imgfun.biz/img-5401cc2bf0300.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgfun.biz/img-5401cc2bf0300.html&lt;/a&gt;","torrent":{"xt":"urn:btih:024e53dca22f22b4adfc60fab5ff999a6035ba67","amp;dn":"%5BXXXPawn%5D+Jenny+Gets+Her+Ass+Pounded+At+The+Pawn+Shop+%2808.29.201","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"024e53dca22f22b4adfc60fab5ff999a6035ba67","infoHashBuffer":{"type":"Buffer","data":[2,78,83,220,162,47,34,180,173,252,96,250,181,255,153,154,96,53,186,103]},"announce":[],"urlList":[]}}