{"title":"Graham Greene-A Burnt-Out Case","uid":11783777,"size":156390364,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:028ea56f88b7759a0c3430063c8e9115e9c21c30&amp;dn=Graham+Greene-A+Burnt-Out+Case&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":6,"uploader":null,"files":7,"time":1427682603,"description":"Querry is a very famous architect who at some point in his life feels a depressive boredom about love and his profession. he feels he has never been able to really love a woman, although money and fame have brought many of them to his bed, and he feels a total disdain for religion. So, feeling a terrible void in his life, and being sick of all those people adulating him and writing things that come only from their imaginations, he decides to run away from it all.\nChoosing a destination by chance, he finds himself in a leprosary deep into &quot;the heart of darkness&quot;, in Congo. There, he feels relieved of people's false and volatile attention, and dedicates his energies to help out the priests, building a new hospital for them. He feels coming back to life again, doing something useful for people with a terrible, but now curable, disease. He finds the good company of Dr. Colin (my type of hero) and some of the priests. &quot;Far from the madding crowd&quot;, he starts rebuilding his connections to humankind, out of totally unselfish motivations.\nAnd then... the stupid fools appear on stage. There are three of them: Rycker, a most unlikable man who has a very young and unhappy wife, the kind of fool who professes to love humankind but is unable to love the specific humans around him. Rycker spreads the word about Querry's identity and spreads also ridiculous stories about his supposed sainthood.\nFather Thomas, a nervous wreck of a man who also insists on Querry's sainthood. And finally, a despicable reporter, Parkinson, who starts publishing yellow and distorted articles about Querry. in the end, all this accumulates in the wrong way.\nFull of deep but unpretentious reflections on the said subjects, this is a truly a novel of ideas and of hard dilemmas","torrent":{"xt":"urn:btih:028ea56f88b7759a0c3430063c8e9115e9c21c30","amp;dn":"Graham+Greene-A+Burnt-Out+Case","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"028ea56f88b7759a0c3430063c8e9115e9c21c30","infoHashBuffer":{"type":"Buffer","data":[2,142,165,111,136,183,117,154,12,52,48,6,60,142,145,21,233,194,28,48]},"announce":[],"urlList":[]}}