{"title":"Veiled Desires: Intimate Portrayals of Nuns in Postwar Anglo-Ame","uid":11044139,"size":2493309,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0a572c692af3479fa0ad1e8b3df3937e8fc99bab&amp;dn=Veiled+Desires%3A+Intimate+Portrayals+of+Nuns+in+Postwar+Anglo-Ame&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Sunghabib","files":-1,"time":1410923855,"description":"Book Description:\n\nA provocative, interdisciplinary study of nuns on the big screen, from The Bells of St. Mary's (1945) to Doubt (2008), that shines fresh light on the cinematic nun as a woman and a religious in the twentieth century.\n\nIngrid Bergman's engaging screen performance as Sister Mary Benedict in The Bells of St. Mary's made the film nun a star and her character a shining standard of comparison. She represented the religious life as the happy and rewarding choice of a modern woman who had a &quot;complete understanding&quot; of both erotic and spiritual desire. How did this vibrant and mature nun figure come to be viewed as girlish and naive? Why have she and her cinematic sisters in postwar popular film so often been stereotyped or selectively analyzed, so seldom been seen as women and religious?\n\nIn Veiled Desires--a unique full-length, in-depth study of nuns in film--Maureen Sabine explores these questions in a groundbreaking interdisciplinary study covering more than sixty years of cinema. She looks at an impressive breadth of films in which the nun features as an ardent lead character, including The Bells of St. Mary's (1945), Black Narcissus (1947), Heaven Knows, Mr. Allison (1957), Sea Wife (1957), The Nun's Story (1959), The Sound of Music (1965), Change of Habit (1969), In This House of Brede (1975), Agnes of God (1985), Dead Man Walking (1995), and Doubt (2008).\n\nVeiled Desires considers how the beautiful and charismatic stars who play chaste nuns, from Ingrid Bergman and Audrey Hepburn to Susan Sarandon and Meryl Streep, call attention to desires that the veil concealed and the habit was thought to stifle. In a theologically and psychoanalytically informed argument, Sabine responds to the critics who have pigeonholed the film nun as the obedient daughter and religious handmaiden of a patriarchal church, and the respectful audience who revered her as an icon of spiritual perfection. She provides a framework for a more complex and holistic picture of nuns on screen by showing how the films dramatize these women's Christian call to serve, sacrifice, and dedicate themselves to God, and their erotic desire for intimacy, agency, achievement, and fulfillment.\n\nProduct Details:\n\nPDF: 351 pages\nPublisher: Fordham University Press (August 1, 2013)\nLanguage: English\nISBN-10: 0823251659\nISBN-13: 978-0823251650\nAmazon Link:\n\n------------------------------------------------\nSeed - Share - Enjoy - Give me Thumbs Up\n------------------------------------------------","torrent":{"xt":"urn:btih:0a572c692af3479fa0ad1e8b3df3937e8fc99bab","amp;dn":"Veiled+Desires%3A+Intimate+Portrayals+of+Nuns+in+Postwar+Anglo-Ame","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a572c692af3479fa0ad1e8b3df3937e8fc99bab","infoHashBuffer":{"type":"Buffer","data":[10,87,44,105,42,243,71,159,160,173,30,139,61,243,147,126,143,201,155,171]},"announce":[],"urlList":[]}}