{"title":"The Anthony Cumia Show 2015-02-26 MP4 MP3 combo","uid":11726204,"size":350053691,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:17310018a2eed7c15518cda3703fedb87f3190e2&amp;dn=The+Anthony+Cumia+Show+2015-02-26+MP4+MP3+combo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mothergoose58","files":2,"time":1425063518,"description":"----NOTE: RAT SCREWED UP - NO AUDIO UNTIL 2:24!----\n\n\n*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nGuest(s): The Amish Outlaws, Gavin McInnes\n\nEpisode 118: Ya may want to fast forward to 2:24 - no audio till then! Sorry. -Rat After a some slight technical difficulties, TACS begins with a song from The Amish Outlaws, we learn that net neutrality was voted on and passed, Ant puts on his tinfoil hat to vent his ill feelings about it, and a caller attempts to explain the pros that net neutrality will bring. We take it back to The Amish Outlaws for a couple more songs, find out where they'll be performing next, and get the backstory on how the band formed. After a few more calls filled with thoughts on net neutrality, Gavin McInnes comes in studio and admits he's now scared of black women and gays, the guys talk about the culture of riffing, discomfort in the workplace due to what people find offensive, career killers, cancer loving Keith Olbermann, and Twitters &quot;social justice warriors&quot;. Ant talks about H1Z1 (he might be obsessed), they discuss money grubbing Al Sharpton and his mob tactics, Gavin shows us a video of a PPA Rally, they talk grass roots campaigns, the NRA, predicted gun versus automobile death stats, people's fascination with communism, and today's youth being complete pussies. Ant and Gavin shit on Rat's virginity, they chat about sexual positions, fucking old broads, Fox News developing a new weekend show for Greg Gutfeld, male guilt, agenda driven programming, religion and people's varying ideology, and Gavin praises TACS for its creativity and content.\n\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\n\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:17310018a2eed7c15518cda3703fedb87f3190e2","amp;dn":"The+Anthony+Cumia+Show+2015-02-26+MP4+MP3+combo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17310018a2eed7c15518cda3703fedb87f3190e2","infoHashBuffer":{"type":"Buffer","data":[23,49,0,24,162,238,215,193,85,24,205,163,112,63,237,184,127,49,144,226]},"announce":[],"urlList":[]}}