{"title":"The Anthony Cumia Show 2015-02-24 MP4 MP3 combo","uid":11721724,"size":270397180,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:1c47198ac7be323c28b06bb8bb2376afcd6ca0b2&amp;dn=The+Anthony+Cumia+Show+2015-02-24+MP4+MP3+combo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mothergoose58","files":2,"time":1424874479,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nGuest: Terry Schappert\n\nEpisode 116: Today we hear about Ant's trip to the city for the premiere of Colin Quinn's &quot;Cop Show&quot;, he talks about his Twitter convo from last night regarding net neutrality, debates the topic a bit, the callers and staff join in on the discussion, and we find out what Jesse Ventura thinks about it as well. Terry Schappert Skypes in to TACS to talk about his show &quot;Dude, You're Screwed&quot; on Discovery TV, primal instincts, Anthony tells us about an adventure he had hiking, and they chat about small victories feeling huge when you're out of your element. We see the new glorious mail that was sent in, get a weather report, take a look at Ant's old poker chips, talk about the possibility of an international TACS broadcast, and hear from an international caller as well as one that sparks a conversation about kids before marriage. Another caller tells us about a mystery tunnel found in Toronto, we hear a news report about a UFO crash in Canada, a caller brings up Opie and once again Anthony explains his thoughts on the situation, and he then talks about internet criticism and how exhausting it becomes to wax on the same on-line topics. Ant also tells us about his Q and A on Huffington Post, talks about that shitbag Rev Al having his MSNBC show switched to weekends only, brings up Al's long history of pointless lawsuits, and reminds everyone to hurry and send in their entries for the &quot;Most Offensive Song&quot; contest.\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\n\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:1c47198ac7be323c28b06bb8bb2376afcd6ca0b2","amp;dn":"The+Anthony+Cumia+Show+2015-02-24+MP4+MP3+combo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c47198ac7be323c28b06bb8bb2376afcd6ca0b2","infoHashBuffer":{"type":"Buffer","data":[28,71,25,138,199,190,50,60,40,176,107,184,187,35,118,175,205,108,160,178]},"announce":[],"urlList":[]}}