{"title":"Hidden and Dangerous + Fight for Freedom (Expansion Pack)","uid":10743344,"size":1229181746,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1d0f8c827b62f55b5fab337afdc0b7a907efd6bb&amp;dn=Hidden+and+Dangerous+%2B+Fight+for+Freedom+%28Expansion+Pack%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sacolt","files":-1,"time":1407786130,"description":"Hidden &amp; Dangerous is a WWII 1999 computer and video game developed by Illusion Softworks and published by Take-Two Interactive and TalonSoft for Windows, the Dreamcast, and the PlayStation. The PlayStation port of the game was developed by Tarantula Studios. It is regarded as one of the pioneering tactical first/third person shooters.\n\nGameplay\n\nThe player controls an eight-man British Special Air Service (SAS) team executing a number of important missions during World War II. The game features soldier selection prior to each mission. A comprehensive load-out sequence is also available where players have access to a variety of weapons and equipment. Mission briefings outline objectives, intelligence on enemy strengths and recommended plans of advance. During missions, players can command directly by toggling through the soldiers in their squad, voice commands or a tactical map which allows for real time control or planned manoeuvres once the map is exited. Missions include, sabotage, search and destroy, POW rescue and resistance aid. Hidden and Dangerous features missions in Italy, Yugoslavia, Germany, Norway, the North Sea and Czechoslovakia. Despite certain historical liberties taken with actual SAS missions and time-lines, the game retains a degree of historical accuracy and intense atmosphere, including realistic wounding as squad members can be heavily wounded or killed by even brief enemy contact.\n\nExpansion\n\nAn expansion was released in 2000, titled Hidden &amp; Dangerous: Devil's Bridge in the US and Hidden &amp; Dangerous: Fight for Freedom in the UK. This added new soldiers, weapons and missions in new locations including Poland, the Ardennes and postwar Greece.\nA fully updated version of the game, Hidden &amp; Dangerous Deluxe, was released for free as a commercial promotion for the sequel Hidden &amp; Dangerous 2.[2] It is still available as freeware.","torrent":{"xt":"urn:btih:1d0f8c827b62f55b5fab337afdc0b7a907efd6bb","amp;dn":"Hidden+and+Dangerous+%2B+Fight+for+Freedom+%28Expansion+Pack%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d0f8c827b62f55b5fab337afdc0b7a907efd6bb","infoHashBuffer":{"type":"Buffer","data":[29,15,140,130,123,98,245,91,95,171,51,122,253,192,183,169,7,239,214,187]},"announce":[],"urlList":[]}}