{"title":"Saints Row Gat Out of Hell Portable","uid":11672901,"size":3174970133,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1e1d1f990f74e222a1cd5e64403a20b218005477&amp;dn=Saints+Row+Gat+Out+of+Hell+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"globeplus","files":3,"time":1422738371,"description":"Hi nice PC games fans and play the new Saints Row game ...\n\n\nPORTABLE - PLAY ANYWHERE , complete and easily updated\n\nGameplay\n\nThe player controls Johnny Gat or Kinzie Kensington in the open-world sandbox. Gat out of Hell shares many gameplay aspects with the previous installments, being primarily played as a third-person shooter in an open world city scattered with quests, secondary objectives, and various collectibles. Superhuman abilities return from Saints Row IV. Gat out of Hell introduces &quot;angelic flight&quot;, giving wings to the player.[4] Unlike past Saints Row games, players cannot customize the playable characters; however, by importing a Saints Row IV save, players can import their custom Boss character to replace the default Boss.\n\nUnlike game progression in previous titles, players advance through the story by completing activities to fill a &quot;Satan's Wrath&quot; meter, which unlocks cutscenes and further story elements.[5] Gat out of Hell takes place in an open-world new to the series, New Hades, made up of five islands: Shantytown, Barrens, Downtown, Forge, and the Den, all surrounding a central tower on a middle island.\n\nPlot\n\nThe plot revolves around the leader of the Saints being captured by Satan, intending for them to marry his daughter, Jezebel. Following them into Hell, Johnny Gat and Kinzie Kensington must reunite with deceased enemies from their past as well as former Saints in order to stop Satan and rescue the Boss.\n\n\n\n* enjoy","torrent":{"xt":"urn:btih:1e1d1f990f74e222a1cd5e64403a20b218005477","amp;dn":"Saints+Row+Gat+Out+of+Hell+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e1d1f990f74e222a1cd5e64403a20b218005477","infoHashBuffer":{"type":"Buffer","data":[30,29,31,153,15,116,226,34,161,205,94,100,64,58,32,178,24,0,84,119]},"announce":[],"urlList":[]}}