{"title":"Larry Jon Wilson - Larry Jon Wilson [2008][EAC/FLAC]","uid":11706619,"size":193435617,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1e465c88ea1e6ee165ba190ad4c443be61e352de&amp;dn=Larry+Jon+Wilson+-+Larry+Jon+Wilson+%5B2008%5D%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dickspic","files":15,"time":1424156906,"description":"FLAC / Lossless / Log (100%) / Cue\nLabel/Cat#: CORTEX #424\nCountry: USA\nYear: June 30, 2008\nGenre: americana\nFormat: CD\n\n01. Shoulders 3:17\n02. Losers Trilogy 7:01\n03. Heartland 4:15\n04. long about now 2:37\n05. Me with no you 2:27\n06. Feel alright again 2:33\n07. I am no dancer 2:21\n08. Goodbye Eyes 3:50\n09. Rocking with you 3:47\n10. Throw my hands up 2:33\n11. Whore trilogy 10:48\n12. Where from 4:06\n\nLarry Jon Wilson was a late bloomer. Born in Georgia in 1940, he didn't learn to play guitar until he was 30, and he didn't go into music full-time until he was 34. He signed with Monument (Roy Orbison's former label) and released four well-praised albums in the late 1970s. During that time, he developed a reputation in Nashville as a songwriter's songwriter, with a robust voice and lyrics detailing his Southern upbringing. But his musical talent fueled a stubborn business-- or anti-business-- sensibility, and in 1980, he excused himself from the music industry, playing scattered shows and appearing on a few country comps over the next few decades.\nTo call Wilson's new self-titled album on Drag City a comeback seems misleading: He had no hit albums and little notoriety beyond a small circle of admirers, and it's likely this record will yield no hits nor expand his popularity beyond a new generation of admirers. Besides, his time in the industry constitutes such a slight portion of his life that Larry Jon Wilson sounds less like a years-in-the-making follow-up than a culmination of the solo live shows he's been playing since before you were born.\nCo-producers Jerry DeCicca of the Black Swans and Jeb Loy Nichols recorded the album in Florida over the course of a week, essentially capturing Wilson in the rough: Working in a makeshift studio at a beachfront condo, he ran through a number of his own and others' songs, offering impromptu performances and creating on-the-spot medleys. It's just Wilson and his guitar, although Black Swan Noel Sayre overdubbed soft, subtle violin flourishes afterwards. Sadly, Larry Jon Wilson was Sayre's final recording before his death in 2008, and while he never showboats or even solos, his sensitivity to Wilson's performances on &quot;Me With No You&quot; and &quot;Rocking With You&quot; showcases a restrained and intuitive talent.\nThe obvious comparisons here are to Johnny Cash's American Recordings and Neil Diamond's 12 Songs; Larry Jon Wilson shares an austerity and gravity with those albums, as if to suggest that, once a singer reaches a certain age, all he needs is a guitar and vox to put a song across. Where Rick Rubin infused Cash and Diamond's songs with a kind of performative formality, Wilson sounds much more casual here: This setting isn't a production decision, but his songs' natural state. Wilson's gravely voice and delicate fretwork lend opener &quot;Shoulders&quot; and &quot;Long About Now&quot; their stark intimacy, while his cover of Bob Dylan and Willie Nelson's &quot;Heartland&quot; evokes a quiet, even wistful outrage in its farmland lament.\nPart of the enjoyment of this album comes from hearing how Wilson's mind works-- not only how he resettles tunes into this setting, but more interestingly how he catches snippets of songs and sutures them into a medley. The 10-minute &quot;Whore Trilogy&quot; weaves together story-songs about hard-luck prostitutes and mistresses, each commenting on the others so that Wilson's tender empathy undercuts the harshness of the world he's evoking. But it's &quot;Losers Trilogy&quot; that stands out here, blending compositions by Stuart Wright and Mickey Newbury (best known for &quot;Just Dropped In [To See What Condition My Condition Was In]&quot;) with one of Wilson's own. It's a long trek across hard land, culminating in a truly bleak finale: &quot;Things ain't what they used to be,&quot; he sings wearily, &quot;and probably never was.&quot; Larry Jon Wilson carries the weight of experience, but this haunted album is no nostalgia trip, if only because Wilson knows nostalgia will get you absolutely nowhere","torrent":{"xt":"urn:btih:1e465c88ea1e6ee165ba190ad4c443be61e352de","amp;dn":"Larry+Jon+Wilson+-+Larry+Jon+Wilson+%5B2008%5D%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e465c88ea1e6ee165ba190ad4c443be61e352de","infoHashBuffer":{"type":"Buffer","data":[30,70,92,136,234,30,110,225,101,186,25,10,212,196,67,190,97,227,82,222]},"announce":[],"urlList":[]}}