{"title":"Ananias Fellowship Edition v1.55","uid":11732667,"size":35601837,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:21949a1b4c7bff96637d23232b9d29fe54b6ea9b&amp;dn=Ananias+Fellowship+Edition+v1.55&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Androider","files":1,"time":1425443010,"description":"This is the Fellowship Edition for Ananias Roguelike, where you can share your adventures with your friends and support the further development of the game. Check out the absolutely complete functional free version and then get this one if you like it :)\n\nDescend 25 levels into the dungeon to find the ring of Ananias!\n\nA dungeon exploration experience based on traditional roguelikes, but with a modern user interface designed upfront for mobile devices.\n\n* Challenge your friends to who can dive faster and survive the dungeon!\n* Compete with your friends and for the global ranking\n* See when your friends are playing and how they are doing\n\nAnanias is designed from the ground up with the idea of a straightforward user experience for a touch screen device; interactions are optimized so you don't have to waste time with cumbersome movement, while still allowing you to explore the dungeon and fight the dwellers of the dungeon.\n\nA simple gameplay is also a strong design focus; the game is designed for you to be able to do quick playthroughs, trying to delve deeper into the dungeon every time.\n\nThere are 41 enemy types, each with an unique feature that makes him stand apart from the rest. We are favoring uniqueness versus quantity in the monster design.\n\nAt the beginning of the game you can pick a monster pet to join you in your adventure, each one of them has different abilities and can evolve into powerful creatures using magic spells found into the dungeon.\n\nThere are 4 classes, each one with its own strengths and weaknesses:\n\nAlchemist\n* Shoots liquid at enemies (Acid, Liquid Fire, and other potions)\n* Can mix reagents into potions without danger of explosion.\n* Starts with powerful potions (Flame Potion for example which deals a lot of fire damage when thrown)\n\nArcane\n* Can cast the most powerful spells without danger of backfiring\n* Extends power of magic wands\n* Starts with powerful spells (like Charm Monster which makes any creature become your ally)\n\nPaladin\n* Can use all weapons and armor\n* Blocks attacks using his shield\n* Extends lifetime of weapons\n\nHunter\n* Never misses a shot with a bow\n* Performs critical damage with bows\n* Prevents arrows from breaking\n\nThe levels in the dungeon are randomly generated every time you play, so you have to explore the level gathering useful equipment and looking the stairs to the next level, while avoiding death and managing your limited resources.\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.slashwareint.ananias&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.slashwareint.ananias&lt;/a&gt;","torrent":{"xt":"urn:btih:21949a1b4c7bff96637d23232b9d29fe54b6ea9b","amp;dn":"Ananias+Fellowship+Edition+v1.55","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21949a1b4c7bff96637d23232b9d29fe54b6ea9b","infoHashBuffer":{"type":"Buffer","data":[33,148,154,27,76,123,255,150,99,125,35,35,43,157,41,254,84,182,234,155]},"announce":[],"urlList":[]}}