{"title":"Ancient Rites - Laguz (2015)ak","uid":11720067,"size":111085634,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:22425cb73f2a256aecd29ac97646ea3646b8bd55&amp;dn=Ancient+Rites+-+Laguz+%282015%29ak&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"analogkid6103","files":11,"time":1424736322,"description":"\nINFO:\n\nThough its founding members had been active in the local scene since the early '80s, the band known as Ancient Rites was only officially formed in 1989 by Gunther Theys (bass/vocals), Philip and Johan (guitars), and Stefan (drums).\nOne of Belgium's only black metal groups of note (requisite corpse paint and all), they were star-crossed from the start, with both Philip (killed in a car accident) and Stefan (suicide) meeting premature deaths shortly after recording their &quot;Dark Ritual&quot; demo. Choosing to carry on in their honor, Theys kept Ancient Rites alive with the help of guitarist Bart Vandereycken and drummer Walter van Cortenberg, but it wasn't until 1994 (following countless low-key split releases) that they finally recorded a debut album entitled The Diabolic Serenades. By then, black metal had risen to prominence (and infamy) by highly questionable means, via the criminal acts perpetrated by members of its Norwegian contingent, and Ancient Rites reluctantly rode the surge of interest as well.\n\n1996's Blasfemia Eternal should have signaled a time of greater stability for the band, but brought further challenges instead when Vandereycken abruptly left the group, requiring the use of several volunteer guitarists on the European tour set to start only ten days later. The fact that they somehow pulled it off is a testament to the tight-knit friendships within the scene. Touring commitments fulfilled against all odds, Theys and van Cortenberg set about righting the Ancient Rites ship with a trans-European lineup, drafting guitarists Jan &quot;Ã–rkki&quot; Yrlund (from Finland) and Erik Sprooten (a Dutchman) for the sessions to their third LP, 1998's Fatherland. German keyboard player Oliver Phillips was also added to provide a more complex, orchestral dimension to the band's vicious black metal, which, by then, had become accomplished and distinctive enough to draw the attention of conservative religious groups and misunderstanding authorities (sweet fame, indeed) -- a severe injustice given Ancient Rites' generally literate socio-political lyrics. Though still firmly rooted (and trapped) in the metal underground, high-profile festival appearances coincided with the retrospective The First Decade: 1989-1999 collection, after which Ancient Rites released their fourth semi-concept album, 2001's Dim Carcosa. ~ Eduardo Rivadavia\n\nBANDMEMBERS:\n\n* Gunther Theys - Vocals\n* Erik Sprooten - Guitars\n* Walter Van Cortenberg - Drums\n* Domingo Smets - Guitars\n\nTRACKLIST:\n\n01. Golden Path To Samarkand\n02. Carthago Legenda Est\n03. Under The Sign Of Laguz\n04. Von Gott Entfernt\n05. Apostata\n06. Legio V Alandae\n07. Mind Unconquered\n08. Ombra Sumus\n09. Frankenland\n10. Saturn\n\n\nGenre: Black\nSubgenre: Symphonic Folk / Viking Black\nBitrate: 320 k\nSize: 105.94 MB\nShow/Hide Files:\n11 files","torrent":{"xt":"urn:btih:22425cb73f2a256aecd29ac97646ea3646b8bd55","amp;dn":"Ancient+Rites+-+Laguz+%282015%29ak","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22425cb73f2a256aecd29ac97646ea3646b8bd55","infoHashBuffer":{"type":"Buffer","data":[34,66,92,183,63,42,37,106,236,210,154,201,118,70,234,54,70,184,189,85]},"announce":[],"urlList":[]}}