{"title":"Antiques.Roadshow.S37E17.Belton.House.1.mp4","uid":11799092,"size":657706505,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2325d00294da69ce477409f11d037d78a64a925e&amp;dn=Antiques.Roadshow.S37E17.Belton.House.1.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":6,"uploader":"xela_5","files":1,"time":1428305131,"description":"Antiques Roadshow UK - S37E17 - Broadcast Sunday 5 April.\n\nI created the file using &quot;get i-player&quot; so it is bigger than normal and I have no idea how to edit or make it smaller!\n\n\nThe Antiques Roadshow visits Belton House in Lincolnshire, where surprising finds include a collection of Chairman Mao memorabilia from China, a funeral standard believed to have been snatched from Oliver Cromwell's coffin and a purse that hides a secret weapon.\n\nFiona Bruce welcomes visitors to Belton House and casts an admiring glance at the family silver before the specialists start spotting treasures, including a powerful bronze sculpture of Joan of Arc and an original jewellery design by Carl Faberge.\n\nA collection of Chairman Mao memorabilia amassed by an English teacher during a stay in China dazzles specialist Clive Stewart-Lockhart, and a Chinese visitor to the Roadshow lends a hand with some timely translation.\n\nOther finds include a tiny pistol concealed in a purse, a collection of ceramic drug jars passed down through a family who boast three hundred years in the medical profession, and an illustrated page of British wildflowers that might just be a genuine work by renowned botanist William Keble Martin.\n\nThis episode also features one of the Roadshow's most important historical finds of recent years, a piece of cloth bearing the standard of Oliver Cromwell, reportedly snatched from his funeral cortege in 1658.\n\nIn Antiques Roadshow Uncovered, glass specialist Andy McConnell reveals what happened next to a beautifully decorated vase by Jules Barbe, a French craftsman who brought his sumptuous skills to Stourbridge in the late 19th century","torrent":{"xt":"urn:btih:2325d00294da69ce477409f11d037d78a64a925e","amp;dn":"Antiques.Roadshow.S37E17.Belton.House.1.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2325d00294da69ce477409f11d037d78a64a925e","infoHashBuffer":{"type":"Buffer","data":[35,37,208,2,148,218,105,206,71,116,9,241,29,3,125,120,166,74,146,94]},"announce":[],"urlList":[]}}