{"title":"Badfinger - Say No More [1981][2000][320 KBPS][RMSTD]","uid":11722680,"size":101432454,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:28983b73cc98beab9e73041c697dc4f1d725ff3b&amp;dn=Badfinger+-+Say+No+More+%5B1981%5D%5B2000%5D%5B320+KBPS%5D%5BRMSTD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"LameDuck69","files":16,"time":1424921342,"description":"Badfinger - Say No More [1981][2000][RMSTD]\n\n\n\n01. I Got You\n02. Come On\n03. Hold On\n04. Because I Love You\n05. Rock 'N' Roll Contract\n06. Passin' Time\n07. Three Time Loser\n08. Too Hung Up On You\n09. Crocadillo\n10. No More\n-----------------------------------\n**320 KBPS CBR\n**Cover Art\n------------------------------------------------------\n Badfinger were a British rock band that originally consisted of Pete Ham, Mike Gibbins, Tom Evans and Ron Griffiths. The band evolved from an earlier group called The Iveys that was formed in 1961 by Ham, Ron Griffiths and David &quot;Dai&quot; Jenkins in Swansea, Wales. They were signed by the Beatles' Apple label in 1968 as The Iveys. In 1969, Griffiths left and was replaced by Joey Molland, and the band renamed itself Badfinger. In 1970, the band engaged American businessman Stan Polley to manage their commercial affairs. Over the next five years the band recorded several albums for Apple and toured extensively, before they became embroiled in the chaos of Apple Records' dissolution.\n\nBadfinger had four consecutive worldwide hits from 1970 to 1972: &quot;Come and Get It&quot; (written and produced by Paul McCartney), &quot;No Matter What&quot;, &quot;Day After Day&quot; (produced by George Harrison) and &quot;Baby Blue&quot;. In 2013, &quot;Baby Blue&quot; made a resurgence onto the &quot;Hot Rock Songs&quot; Billboard 100 chart at number 14, due to its featuring at the end of the series finale of the hit TV show Breaking Bad. Their song &quot;Without You&quot; has been covered many times, including a Billboard number one hit for Harry Nilsson.\n\nThey signed to Warner Bros., but Polley's financial machinations resulted in a lawsuit by Warner over missing escrow account money. Warner's consequent withdrawal from market of the 1974 album, Wish You Were Here (seven weeks after its release), cut off the band's income. Three days before his 28th birthday, on 24 April 1975, Ham committed suicide by hanging himself, leaving a note that included damning comments about Polley.\n\nOver the next three years, surviving members struggled to rebuild their personal and professional lives against a backdrop of lawsuits. The albums Airwaves (1978) and Say No More (1981) floundered, as Molland and Evans see-sawed between co-operation and struggle in attempts to revive and capitalise on the Badfinger legacy. Having seen Ham's body after Ham's wife had called him, Evans reportedly never got over his friend's suicide, and was quoted as saying in darker moments, &quot;I wanna be where he is.&quot; On 19 November 1983, Evans also took his own life by hanging.\n--------------------------------------------------------------------------------\nSay No More is the last studio album recorded by British rock band Badfinger that contained new material. Issued in January 1981 on Radio Records, the LP was the second and last attempt by Tom Evans and Joey Molland to recapture Badfinger's earlier market success, which was lost after the death of band founder Pete Ham in 1975. The album was recorded in Miami, FL by Evans, Molland, keyboardist Tony Kaye (formerly of Yes), guitarist Glen Sherba and drummer Richard Bryans and was co-produced by Jack Richardson.\n\nRockier than its predecessor Airwaves, this final outing by Badfinger produced one semi-successful single with the song &quot;Hold On&quot;, which reached #56 on the US Billboard charts in 1981. The album peaked at only #155 in the US Billboard Album chart.\n\nEvans' song &quot;Rock 'N' Roll Contract&quot; had originally been recorded for the band for the Head First album, but that album was still unreleased at the time of Say No More.\n--------------------------------------------------------------------------------\n\nPersonnel:\n\n\nTom Evans: bass, guitar, vocals\nJoey Molland: guitar, piano, vocals\nTony Kaye: keyboards\nGlenn Sherba: guitar\nRichard Bryans: drums","torrent":{"xt":"urn:btih:28983b73cc98beab9e73041c697dc4f1d725ff3b","amp;dn":"Badfinger+-+Say+No+More+%5B1981%5D%5B2000%5D%5B320+KBPS%5D%5BRMSTD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28983b73cc98beab9e73041c697dc4f1d725ff3b","infoHashBuffer":{"type":"Buffer","data":[40,152,59,115,204,152,190,171,158,115,4,28,105,125,196,241,215,37,255,59]},"announce":[],"urlList":[]}}