{"title":"The Lost Patrol (1934) DVD5-Subs-Eng-Fr-Sp [DDR]","uid":11675684,"size":3176030208,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:294f59035212d34ce468b8eff376b1f1dfa47b54&amp;dn=The+Lost+Patrol+%281934%29+DVD5-Subs-Eng-Fr-Sp+%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SaM","files":11,"time":1422856101,"description":"The Lost Patrol (1934) DVD5 Untouched - Subs-Eng-Fr-Sp - Boris Karloff, Victor McLaglen [DDR]\n\nThe Lost Patrol is a 1934 war film made by RKO. It was directed and produced by John Ford, with Merian C. Cooper as executive producer and Cliff Reid as associate producer. The screenplay was by Dudley Nichols, adapted by Garrett Fort from the novel Patrol by Philip MacDonald. The music score was by Max Steiner and the cinematography by Harold Wenstrom. The film is a remake of a 1929 British silent film, also named The Lost Patrol. The earlier film was directed and written by Walter Summers and is based on the same novel. The Lost Patrol starred Victor McLaglen, Boris Karloff, Wallace Ford, Reginald Denny, J.M. Kerrigan and Alan Hale. \n\nThe Lost Patrol was reprised in a number of films, the script was the basis for the 1936 Soviet film The Thirteen, set by director Mikhail Romm in the Central Asia desert during the Basmachi rebellion. This Soviet film was then adapted in Sahara, featuring Humphrey Bogart. Last of the Comanches is a Western remake from 1953.\n\n    CAST:-\n    Victor McLaglen as The Sergeant\n    Boris Karloff as Sanders\n    Wallace Ford as Morelli\n    Reginald Denny as George Brown\n    J. M. Kerrigan as Quincannon\n    Billy Bevan as Herbert Hale\n    Alan Hale as Matlow Cook\n    Brandon Hurst as Corporal Bell\n    Douglas Walton as Pearson\n    Sammy Stein as Abelson\n    Howard Wilson as Aviator\n    Paul Hanson as Jock MacKay\n    Neville Clark (uncredited) as Lieutenant Hawkins\n    Abdullah Abbas (uncredited) as Arab\n    Francis Ford (uncredited) as Arab\n\nDirected by John Ford\nProduced by Merian C. Cooper, Cliff Reid, John Ford\nMusic by Max Steiner\nRunning time 73 minutes\n\nMOVIE PLOT:- The Lost Patrol (1934)\nDuring World War I, the commanding officer of a small British patrol in the Mesopotamian desert is shot and killed by an unseen Arab sniper, leaving the Sergeant (Victor McLaglen) at a loss, since he had not been told what their mission is. He decides to try to rejoin the brigade, though he does not know where they are or where he is.\n\nEventually, the 11 men in his unit reach an oasis. During the night, one of the sentries is killed, the other seriously wounded, and all their horses are stolen, leaving them stranded. One by one, the remaining men are picked off by the unseen enemy. In desperation, the Sergeant sends two men chosen by lot on foot for help, but they are caught and tortured to death, before their bodies are sent back. The pilot of a British biplane spots the survivors, but nonchalantly lands nearby and is killed before he can be warned. The men take the machine gun from the aircraft and set it on fire in a desperate bid to signal British troops. Sanders (Boris Karloff), a religious fanatic, goes mad.\n\nIn the end, only the Sergeant is left. When the Arabs finally show themselves, he manages to kill them all with the machine gun. Moments later, another British patrol arrives, attracted by the smoke from the burning aircraft.\n\nPRODUCTION NOTES:- \nRichard Dix was toouted to play the lead role in The Lost Patrol but he went into another film instead and Victor McLaglen replaced him.\nThe Lost Patrol was filmed in the Algodones Dunes of California, where temperatures soared and one of the film's producers wound up in the hospital with sunstroke.\n\nFilm historian Alun Evans in Brassey's Guide to War Films, considered the production, &quot;... something of a classic, if only for the number of copy-cat pictures it spawned.&quot; The film made a profit of $84,000. Film reviewer Paul Tatara claims, &quot;Critics have alternately hailed The Lost Patrol as a flawed masterpiece and a failed experiment. In reality, it's probably a little bit of both.&quot; In a contemporary review, Mourdant Hall of The New York Times, noted: &quot;In &quot;The Lost Patrol,&quot; a picture now sojourning at the Rialto, women are conspicuous by their absence. It is an audible adaptation of Philip MacDonald's novel &quot;Patrol,&quot; which was exhibited here in silent film form several years ago. The present production is highly effective from a photographic standpoint, but the incidents are often strained.&quot;\n\nAmong the awards for The Lost Patrol, it was listed as one of the &quot;10 Best Films - 1934&quot; by The New York Times and received nominations for Best Picture in the 1934 National Board of Review and for Max Steiner for the 1934 Academy of Motion Picture Arts and Sciences Academy Award for Original Music Score. \n\nThe Lost Patrol (1929) coincidentally starred Victor McLaglen's younger brother Cyril McLaglen in the lead role.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 5029 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 29.970\nAudio Codec:  AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  1\nAudio Languages: English\nRunTime 73 mins\nSubtitles: English, Francais, Espanol\nRipped by: Trinidad [DDR]","torrent":{"xt":"urn:btih:294f59035212d34ce468b8eff376b1f1dfa47b54","amp;dn":"The+Lost+Patrol+%281934%29+DVD5-Subs-Eng-Fr-Sp+%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"294f59035212d34ce468b8eff376b1f1dfa47b54","infoHashBuffer":{"type":"Buffer","data":[41,79,89,3,82,18,211,76,228,104,184,239,243,118,177,241,223,164,123,84]},"announce":[],"urlList":[]}}