{"title":"Dangerous Crossing (1953) DVDRip XviD 1CD MSubs -  [DDR]","uid":11675385,"size":963902440,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2f09097f917c4bda782ff2ca72e0980a469871c6&amp;dn=Dangerous+Crossing+%281953%29+DVDRip+XviD+1CD+MSubs+-++%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"SaM","files":9,"time":1422834043,"description":"Dangerous Crossing (1953) Xvid 1cd - Subs-Eng-Fr-Sp - Jeanne Craine, Michael Rennie [DDR]\n\nDangerous Crossing is a 1953 black-and-white film noir mystery film, directed by Joseph M. Newman and starring Jeanne Crain and Michael Rennie, based on the 1943 play Cabin B-13 by John Dickson Carr.\n\n    CAST:-\n    Jeanne Crain as Ruth Stanton Bowman\n    Michael Rennie as Dr. Paul Manning\n    Max Showalter as Jim Logan (as Casey Adams)\n    Carl Betz as John Bowman\n    Mary Anderson as Anna Quinn\n    Marjorie Hoshelle as Kay Prentiss\n    Willis Bouchey as Capt. Peters\n    Yvonne Peattie as Miss Bridges\n\nDirected by Joseph M. Newman\nProduced by Robert Bassler\nScreenplay by Leo Townsend\nMusic by Lionel Newman\nRunning time 75 minutes\n\nMOVIE PLOT:- Dangerous Crossing (1953)\nAttractive newlywed Ruth (Stanton) Bowman (Jeanne Crain) joyously starts a honeymoon cruise to Europe with her husband John (Carl Betz), only to have him go missing shortly after they check into their room on board. Compounding her confusion, Ruth finds that she is registered solo under her maiden name in a different cabin and that none of the crew members who could have seen her husband on the ship remember him. These include the ship's purser, (Gayne Whitman), stewardess Anna Quinn (Mary Anderson), and second officer Jim Logan (Max Showalter). When she talks to the captain (Willis Bouchey), he notices that Ruth isn't even wearing a wedding ring, and the crew begins to suggest that she is mentally unbalanced.\n\nThat night, John calls Ruth with a cryptic warning not to trust anyone. A divorcee traveling solo (Marjorie Hoshelle) and the stewardess take an interest in Ruth. And Dr. Manning (Michael Rennie) spends time with her, assuming a clinical demeanor and getting her to open up about the recent death of her father, a wealthy steel executive.\n\nRuth decides to put on an act and agree that she's been foolish, but mysterious things continue to happen. Ruth and Dr. Manning get closer, and a man who walks with a cane seems to stalk her.\n\nThen the stewardess is revealed as conspiring with someone (by phone) to make Ruth seem unstable. Dr. Manning confronts Ruth over the fact that her marriage was either secret or non-existent. She explains that John wanted it to be quick and quiet and talks about an uncle who might scheme to get her inheritance.\n\nJohn calls again and asks to meet Ruth on deck but runs into the fog when he hears others approach. When Ruth makes a scene after dinner, the captain demands that she be locked in her cabin.\n\nThen John is revealed to be Barlowe, the third mate, under Dr. Manning's care all along for a claimed illness. When he learns Ruth has been locked in, he asks the stewardess to enable her escape. When they meet again, John attempts to throw Ruth overboard (mentioning money as a motive) but is stopped by Dr. Manning, who has followed her. It is John who goes overboard in the fight.\n\nLater, Dr. Manning comforts Ruth, and the captain apologizes and explains that the stewardess confessed.\n\nThe film critic for The New York Times gave a lukewarm review, writing, &quot;Although it maintains an eerie quality and suspense through the first half of its footage, Dangerous Crossing, which arrived at the Globe yesterday, is only a mildly engrossing adventure ... While sound effects, background music and shipboard sets lend a peculiar fascination to the melodrama, the acting of the cast adds little tautness to the proceedings. As the beleaguered heiress Jeanne Crain is beautiful but not entirely convincing in the role ... Dangerous Crossing, in effect, is intriguing only part of the way. Thereafter, it is a commonplace trip.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 708 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.212:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: English\nRunTime 75 mins\nSubtitles: English, Espanol, Francais\nRipped by: Trinidad [DDR]","torrent":{"xt":"urn:btih:2f09097f917c4bda782ff2ca72e0980a469871c6","amp;dn":"Dangerous+Crossing+%281953%29+DVDRip+XviD+1CD+MSubs+-++%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f09097f917c4bda782ff2ca72e0980a469871c6","infoHashBuffer":{"type":"Buffer","data":[47,9,9,127,145,124,75,218,120,47,242,202,114,224,152,10,70,152,113,198]},"announce":[],"urlList":[]}}