{"title":"The Anthony Cumia Show 2015-02-05 MP4 MP3 combo","uid":11684120,"size":285457994,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:31ee6438664970544450fbb6ad20e83e45ad5b9c&amp;dn=The+Anthony+Cumia+Show+2015-02-05+MP4+MP3+combo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mothergoose58","files":2,"time":1423242747,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nEpisode 106: Today Bobo, Stalker Patti, and Frank showed up unannounced reminding Ant of the movie &quot;The King of Comedy&quot;, we watch a clip of the flick, Ant questions the gang as to why they are there and after finding out the ridiculous reasons, he attempts to explain that it should never happen again. After this &quot;saga&quot; is somewhat handled, callers give their opinion on the situation, we find out that Frank has two dead ex-wives, and Patti tells us how her job is going. Finally off of those shenanigans, we read a news story about a man who cut off his junk, talk about Brian Williams being a big ol' liar, find out that Jordan's King Abdullah is a mother fucking bad ass, and discuss how ISIS is even pissing off some Muslims. Ant talks about a speech Obama gave that included the asinine comment that &quot;Christians did bad things in the name of Christ&quot;, questions why Obama refuses to acknowledge that ISIS are straight up terrorists, and conveys that we need a leader to win a war. We learn that a douche bag dude is falling for a Nigeria scam, see this douche bag on Dr. Phil, find out that people who use emoji's have more sex, and talk about the reboot of Poltergeist. Ant randomly receives a fuckload of one dollar bill stacks but is unsure why, he brings up a 9-year-old girl who was shot while selling Girl Scout cookies, and then we wrap up this extremely odd show talking about what a bad judge of character Fred (from Brooklyn) is and by looking at Melissa King pics and hearing that she told Ant he should fly her out.\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\n\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:31ee6438664970544450fbb6ad20e83e45ad5b9c","amp;dn":"The+Anthony+Cumia+Show+2015-02-05+MP4+MP3+combo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31ee6438664970544450fbb6ad20e83e45ad5b9c","infoHashBuffer":{"type":"Buffer","data":[49,238,100,56,102,73,112,84,68,80,251,182,173,32,232,62,69,173,91,156]},"announce":[],"urlList":[]}}