{"title":"Nawal El Saadawi - Two Women in One (Req) Epub","uid":11738928,"size":626466,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:32ef3dac549b6ce134e31878456d2110a11886d1&amp;dn=Nawal+El+Saadawi+-+Two+Women+in+One+%28Req%29+Epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"karaokeking123","files":2,"time":1425674024,"description":"Nawal El Saadawi - Two Women in One (Req) Epub\n\n\nProduct details\nPaperback: 128 pages\nPublisher: Saqi Books (May 1985)\nLanguage: English\nISBN-10: 0863560261\nISBN-13: 978-0863560262\n\n\nTwo women in one is a story of a 18s years old medical student Bahiah shaheen, which she finds the male students in her class rough. As the writer considers that it wasn't only the story of Bahiah shaheen it was the story of countless women in third world war as their hopes and ambition disappears.\n\nThe story was written straight forward and there were not much techniques for the reader to engage in reading but still fair in some cases. The author presents his story in fantastic mood; however, this will be helpful for the reader to understand the writer points of view, and what he wants to make it stable for the audience. In addition the author uses name of a girl which is more persuasive then name of an object.\n\nIn the book &quot; two women in one&quot; the story reason why i like it because it has some amazing phrases which would make the reader amuse for the character and sometimes shocked for the character in role. Also the writer was precise about his own points of view which what he try to say as he present his story in a dramatic action which would be helpful for the reader to understand, what the writer wants to say.\n\nOver all the book of &quot;two women in one&quot; could really be beneficial for particular audience such as people how are keen reading this type of books, for expanding their knowledge like &quot;Bahiah shaheen&quot; who is the character in the story","torrent":{"xt":"urn:btih:32ef3dac549b6ce134e31878456d2110a11886d1","amp;dn":"Nawal+El+Saadawi+-+Two+Women+in+One+%28Req%29+Epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32ef3dac549b6ce134e31878456d2110a11886d1","infoHashBuffer":{"type":"Buffer","data":[50,239,61,172,84,155,108,225,52,227,24,120,69,109,33,16,161,24,134,209]},"announce":[],"urlList":[]}}