{"title":"World War II German Police Units","uid":11687239,"size":34432820,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:388645eb59e812c63c7b716a4bf752861322f536&amp;dn=World+War+II+German+Police+Units&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"HowdyDooDoo","files":1,"time":1423367718,"description":"The wartime Police were headed by Himmler as chief of the SS; and throughout the occupied nations the regional SS commanders were specifically termed 'Higher SS and Police Leaders'. Hitler's police was not a single service, but a vast machinery which included many special categories ranging from conventional criminal detectives, and municipal and rural police to combat battalions sent to Russia, and from border and customs police to special railway and waterway departments, fire brigades and emergency engineer squads, and even a colonial service for North Africa. The author explains the origins, the complex organization and the particular duties of the many different police branches that formed such a critical part of the Nazi apparatus and ensured that control was maintained inside Hitler's Fortress Europe. His painstaking research has unearthed fascinating new information about the German police services and their many different uniforms and insignia, which are recreated in the meticulously detailed color artwork","torrent":{"xt":"urn:btih:388645eb59e812c63c7b716a4bf752861322f536","amp;dn":"World+War+II+German+Police+Units","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"388645eb59e812c63c7b716a4bf752861322f536","infoHashBuffer":{"type":"Buffer","data":[56,134,69,235,89,232,18,198,60,123,113,106,75,247,82,134,19,34,245,54]},"announce":[],"urlList":[]}}