{"title":"Badfinger/Magic Christian Music[1970,91][2014][320KBPS][JPN]","uid":11704483,"size":128797250,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3b5cc9dffcef88de2a79791efb0adeaa56019ce0&amp;dn=Badfinger%2FMagic+Christian+Music%5B1970%2C91%5D%5B2014%5D%5B320KBPS%5D%5BJPN%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"LameDuck69","files":21,"time":1424059628,"description":"Badfinger - Magic Christian Music [1970][1991][2014][Japan Mini LP SHM-CD]\n\n\n\n01. Come And Get It  \n02. Crimson Ship   \n03. Dear Angie   \n04. Fisherman    \n05. Midnight Sun   \n06. Beautiful And Blue   \n07. Rock Of All Ages   \n08. Carry On Till Tomorrow   \n09. I'm In Love   \n10. Walk Out In The Rain   \n11. Angelique  \n12. Knocking Down Our Home   \n13. Give It A Try \n14. Maybe Tomorrow   \n15. Storm In A Teacup\n16. Arthur\n-----------------------------------\n**320 KBPS CBR\n**Cover Art\n-------------------------------------------------\nBadfinger were a British rock band that originally consisted of Pete Ham, Mike Gibbins, Tom Evans and Ron Griffiths. The band evolved from an earlier group called The Iveys that was formed in 1961 by Ham, Ron Griffiths and David &quot;Dai&quot; Jenkins in Swansea, Wales. They were signed by the Beatles' Apple label in 1968 as The Iveys. In 1969, Griffiths left and was replaced by Joey Molland, and the band renamed itself Badfinger. In 1970, the band engaged American businessman Stan Polley to manage their commercial affairs. Over the next five years the band recorded several albums for Apple and toured extensively, before they became embroiled in the chaos of Apple Records' dissolution.\n\nBadfinger had four consecutive worldwide hits from 1970 to 1972: &quot;Come and Get It&quot; (written and produced by Paul McCartney), &quot;No Matter What&quot;, &quot;Day After Day&quot; (produced by George Harrison) and &quot;Baby Blue&quot;. In 2013, &quot;Baby Blue&quot; made a resurgence onto the &quot;Hot Rock Songs&quot; Billboard 100 chart at number 14, due to its featuring at the end of the series finale of the hit TV show Breaking Bad. Their song &quot;Without You&quot; has been covered many times, including a Billboard number one hit for Harry Nilsson.\n\nThey signed to Warner Bros., but Polley's financial machinations resulted in a lawsuit by Warner over missing escrow account money. Warner's consequent withdrawal from market of the 1974 album, Wish You Were Here (seven weeks after its release), cut off the band's income. Three days before his 28th birthday, on 24 April 1975, Ham committed suicide by hanging himself, leaving a note that included damning comments about Polley.\n\nOver the next three years, surviving members struggled to rebuild their personal and professional lives against a backdrop of lawsuits. The albums Airwaves (1978) and Say No More (1981) floundered, as Molland and Evans see-sawed between co-operation and struggle in attempts to revive and capitalise on the Badfinger legacy. Having seen Ham's body after Ham's wife had called him, Evans reportedly never got over his friend's suicide, and was quoted as saying in darker moments, &quot;I wanna be where he is.&quot; On 19 November 1983, Evans also took his own life by hanging.\n--------------------------------------------------------------------------------\nMagic Christian Music is an album by the British rock band Badfinger, released in early 1970 on Apple Records. Three tracks from the LP are featured in the film The Magic Christian, which also gives the album its title. However, Magic Christian Music is not an official soundtrack album for the film.\n\nThe film soundtrack for The Magic Christian featured three new songs by Badfinger that had been commissioned for the film, including their US/UK top-10 hit &quot;Come and Get It&quot;', which opened the film, and &quot;Carry on Till Tomorrow&quot;, the title theme. The soundtrack album, which also included incidental music by Ken Thorne, had originally been scheduled for release on Apple Records, but the addition of the Thunderclap Newman song &quot;Something in the Air&quot; to the movie prevented that. Instead, the soundtrack album was released on the little-known label Commonwealth United Records label in the US and on Pye in the UK. As a result, it received little promotion in the US and remained mostly unknown to American record buyers.\n\nTo capitalize on this gap, Apple Records released its own &quot;pseudo-soundtrack&quot;. Apple combined the film's three Badfinger songs with four unreleased songs and seven older tracks released by the group when they were still known as the Iveys on the album Maybe Tomorrow, which had been quickly pulled off the market in 1969. The previously released Iveys songs were specially re-mixed for this album, significantly improving their sound quality in the process. One of them, &quot;Fisherman&quot;, was also edited for this release.\n\nThe three tracks used in the film, &quot;Come and Get It&quot;, &quot;Rock of All Ages&quot; and &quot;Carry on Till Tomorrow&quot;, bear the strongest &quot;Beatle connection&quot;. They were produced by Paul McCartney (the first was also composed by McCartney), and the strings on &quot;Carry on Till Tomorrow&quot; were arranged and conducted by Beatles producer George Martin. The other tracks on the album were produced by Tony Visconti (six songs, including both Iveys singles and the last recording made, &quot;Crimson Ship&quot;) and Mal Evans (five songs).\n\nBadfinger's line-up on these tracks includes bassist/vocalist Ron Griffiths. Griffiths departed The Iveys shortly after the McCartney sessions in late 1969, prior to the name change from The Iveys to Badfinger, which led to his exclusion from the credits and pictures on the album (although Griffiths does appear on the picture sleeve for &quot;Come and Get It&quot;). Guitarist Joey Molland was eventually added as Griffiths' replacement, causing Tom Evans to move from guitar to bass, but Molland's addition came after the album art had been prepared, so only Pete Ham, Tom Evans and Mike Gibbins are pictured on the cover.\n\nThe album peaked at number 55 on the US charts.\n--------------------------------------------------------------------------------\n\nPersonnel:\n\n\nPete Ham: guitar, keyboards, vocals\nTom Evans: guitar, vocals, bass on &quot;Rock of All Ages&quot;, &quot;Crimson Ship&quot; and &quot;Midnight Sun&quot;\nRon Griffiths: bass (except as noted), vocals\nMike Gibbins: drums, vocals\n\n\nAdditional contributors:\n\nPaul McCartney: piano on &quot;Rock of All Ages&quot;, percussion on &quot;Come and Get It&quot;\nNicky Hopkins: piano on &quot;See-Saw Granpa&quot;\nBill Collins: piano on &quot;Knocking Down Our Home&quot;","torrent":{"xt":"urn:btih:3b5cc9dffcef88de2a79791efb0adeaa56019ce0","amp;dn":"Badfinger%2FMagic+Christian+Music%5B1970%2C91%5D%5B2014%5D%5B320KBPS%5D%5BJPN%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b5cc9dffcef88de2a79791efb0adeaa56019ce0","infoHashBuffer":{"type":"Buffer","data":[59,92,201,223,252,239,136,222,42,121,121,30,251,10,222,170,86,1,156,224]},"announce":[],"urlList":[]}}