{"title":"jesus of nazareth extended edition (fan edit)","uid":11005031,"size":2656824326,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3d5c324d3341b52b20e4b74f439588693cca38c5&amp;dn=jesus+of+nazareth+extended+edition+%28fan+edit%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cfbooh","files":1,"time":1410211160,"description":"(for entertainment purpose only. I do not own the rights to the film and this is only a fan project to use during bible studies.i own the original dvd bluray of Jesus of Nazareth and so must you to download this fan project thank you)\n\nJesus of Nazareth directed by Franco Zeffirelli extended using original scenes and various clips from others sources seemingly incorporated into the film. Scenes include the temptations in the dessert, calming of the storm,expelling the demon Legion, walking on water, a small montage of Jesus teaching and healing various people, the Transfiguration, hillside view shot of Gethsemane, Peter cutting the servents ear, Christ healing his ear, and Jesus being dragged towards the Sanherdin by the guards. Original scenes extended are a new scene showing Jesus walking through crowds to get to Simon the Pharisee's house and a long walk to visit Mary his mother,the agony in Gethsemane, Peter's denial,the flogging at the pillar,way of the cross and a resurrection appearance to the women at the tomb. Also added the 2 scenes cut from most versions which is the scene where Zerah persuades Judas to bring Jesus to the Sanhedrin and the opening section of the Last Supper sequence where Jesus tells Judas to perform his betrayal as well as predicting Peter's denial. 4 dvds 420 minutes. (Revised in 2014 with extra scenes and clearer sound) fixed color hue and brightness problem in the German Bluray version.","torrent":{"xt":"urn:btih:3d5c324d3341b52b20e4b74f439588693cca38c5","amp;dn":"jesus+of+nazareth+extended+edition+%28fan+edit%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d5c324d3341b52b20e4b74f439588693cca38c5","infoHashBuffer":{"type":"Buffer","data":[61,92,50,77,51,65,181,43,32,228,183,79,67,149,136,105,60,202,56,197]},"announce":[],"urlList":[]}}