{"title":"[BangBros] Jodi Taylor Pack x7 Clips -=EXCLUSiVE=-","uid":11789205,"size":2541722074,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:3e6ced567e7180d15f7d9ac886d3570f9c2f1d24&amp;dn=%5BBangBros%5D+Jodi+Taylor+Pack+x7+Clips+-%3DEXCLUSiVE%3D-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"H4ckuos","files":7,"time":1427866349,"description":"[BangBros] Jodi Taylor Pack x7 Clips -=EXCLUSiVE=-\n\nViewers beware. This weeks party of three is outrageous. We brought in Diamond Kitty and Jodie Taylor for a three way lesbian sandwich with Mercedes Lynn. Mercedes goes team ramrod on these two with a big ol' strap on. This is a great update don't miss out!\n\nToday we have Jodi Taylor and she has a big ol butt!. It's plump, it's creamy white and it jiggles so perfectly that it's hard to look away when she's doing her thing. Let me tell you that she also knows that she has a perfect white ass and she loves the attention. We brought her a monster cock because we like her so much and she was very appreciative. We couldn't wait to see her juicy white ass get pummeled! This time we're going straight anal and you're not gona want to miss this one. Damn! That pussy looks delicious from every angle possible. Her ass looks good from every angle and add her sex skills and we're looking at a great shoot with a sexy white chick blessed with one of the best asses this side of the Mississippi!! In the end you'll be thinking &quot;I need a PAWG in my life.&quot;\n\nMonsters of cock! We are slinging big black dick like it's nobody's business! Today Jodi Taylor steps up to the plate. She has got the prettiest smile and a perfect ass to go with it, and she is ready to be subjected to a brutal big black cock pummeling! Oh Hell yeah! Watch her guzzle on rock hard black meat and get drilled hard and raw. Oh damn, she gonna GET IT!!!\n\nToday we have a PrettyAssWhiteGirl and her name is Jodie Taylor. Let me tell you also she knows that she has a perfect white ass and she loves the attention. Chris Strokes couldn't wait to get his big dick in her fat pussy. Damn! That pussy looks delicious from every angle possible. I need one on my life. A PAWG!\n\nToday on Mr. Anal, we have the beautiful and talented Jodi Taylor. She has a whole new look and she is talking now that she really loves anal more than anything in life. So you can only imagine how this update will be especailly with my boy Strokes coming threw, its should be awesome!\n\nHope you all like some nice perky tits and huge asses because today's Assparade we have both. We brought in Jodie Taylor for a late fuck fest and I gotta tell you this girls meant business today. I'm talkin hardcore cock sucking and pussy pounding for your entertainment with her sexy ass. This babe is fucking stunning hot and put on in awesome show for you guys. Enjoy ass lovers!\n &lt;a href=&quot;\nhttp://xxxhost.info/img-551b674b4caf7.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.info/img-551b674b4caf7.html&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.info/img-551b6752412aa.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.info/img-551b6752412aa.html&lt;/a&gt;","torrent":{"xt":"urn:btih:3e6ced567e7180d15f7d9ac886d3570f9c2f1d24","amp;dn":"%5BBangBros%5D+Jodi+Taylor+Pack+x7+Clips+-%3DEXCLUSiVE%3D-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e6ced567e7180d15f7d9ac886d3570f9c2f1d24","infoHashBuffer":{"type":"Buffer","data":[62,108,237,86,126,113,128,209,95,125,154,200,134,211,87,15,156,47,29,36]},"announce":[],"urlList":[]}}