{"title":"UHVATI GRINGA - Doctore","uid":11698946,"size":4688306176,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:3efaf5d72c68ac5e0d1b70aaaafb15f98e81c51e&amp;dn=UHVATI+GRINGA+-+Doctore&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":82,"time":1423843959,"description":"The film opens with a getaway driver (Mel Gibson) and a wounded accomplice dressed as clowns fleeing from American police toward the Mexican border. The driver crashes through the border fence, whereupon he is arrested by corrupt Mexican police officers Vasquez (Mario Zaragoza) and Romero (Gerardo Teracena). When they find over $2 million in the car, they incarcerate him in El Pueblito prison under false charges, keep the cash for themselves, and cremate the accomplice, who by then has died. As one of the only Americans incarcerated there, the driver becomes known as &quot;the Gringo&quot;. El Pueblito proves surprising, operating more like a small ghetto than a prison. The Gringo quickly manages to work out the prison's criminal hierarchy and engages in petty thefts and robberies from some of the prison's less reputable businesses. One of these thefts is witnessed by an unnamed kid (Kevin Hernandez) who is living with his incarcerated mother (Dolores Heredia) and is protected by the prison's criminals. Curious, the Gringo presses him to explain why the criminals protect him, but the Kid refuses","torrent":{"xt":"urn:btih:3efaf5d72c68ac5e0d1b70aaaafb15f98e81c51e","amp;dn":"UHVATI+GRINGA+-+Doctore","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3efaf5d72c68ac5e0d1b70aaaafb15f98e81c51e","infoHashBuffer":{"type":"Buffer","data":[62,250,245,215,44,104,172,94,13,27,112,170,170,251,21,249,142,129,197,30]},"announce":[],"urlList":[]}}