{"title":"[NubileFilms] Samantha Rone (Taking It All / 05.12.2014)","uid":11659855,"size":219975724,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:3f7bc8e8f6bffe24ae1a6c4b47c72bc3246ddaa7&amp;dn=%5BNubileFilms%5D+Samantha+Rone+%28Taking+It+All+%2F+05.12.2014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2.No.2","files":1,"time":1417982767,"description":"[NubileFilms] Samantha Rone (Taking It All / 05.12.2014)\n\nA warm bath is just the thing for beautiful blonde Samantha Rone. She slips out of her dress and her sheer panties and then slides into the tub so that she can enjoy the touch of the hot water and her slick fingers against her skin.\nShe is enjoying her relaxing soak when she is joined by Bruce Venture, who is already rock hard and ready for his woman. Samantha can't wait to wrap her eager lips around his long member, sucking and stroking Bruce's cock while Bruce leans forward to caress and slap her round rump.\nWhen Samantha rises to her feet, Bruce kisses his way down her body and then turns her around so that he can slide himself deep into her welcoming wet pussy. He starts out with a few gentle strokes and then sets a breakneck pace as Samantha's moans grow louder and more insistent.\nOnce the blonde has enjoyed her first trembling climax of the day, Bruce lays her down on the side of the bath tub and dives in to her creamy landing strip pussy for a few moments before pushing his big dick deep inside once again. While working Samantha's juicy fuck hole he lifts her up in his arms, cradling her as he pumps her up and down on his cock, and then arranges her so that her hips are turned to the side for even deeper penetration.\nA second blowjob gives Samantha time to enjoy the humming of her body as it briefly calms down from her multiples, but soon Bruce can't wait to be inside his woman once again. They relocate to a chair so that Samantha can sit his Bruce's lap and bounce away on his fuck stick facing both forwards and then away until her small tits shake with the force of her movements.\nAs their hot and horny fuck session finally winds down, Samantha takes one more doggy style pussy pounding to give her juicy snatch the final huge orgasm that it craves. Her throbbing pussy walls are enough to milk Bruce's climax until he gluts her with his cum and then feeds her a few succulent drops from his probing fingertip.\n\nHardcore, Teen\n\nScreens:\n &lt;a href=&quot;\nhttp://www.244pix.com/viewer.php?file=1gcyua380c63.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.244pix.com/viewer.php?file=1gcyua380c63.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.244pix.com/viewer.php?file=fi5yurhpwlj2.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.244pix.com/viewer.php?file=fi5yurhpwlj2.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:3f7bc8e8f6bffe24ae1a6c4b47c72bc3246ddaa7","amp;dn":"%5BNubileFilms%5D+Samantha+Rone+%28Taking+It+All+%2F+05.12.2014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f7bc8e8f6bffe24ae1a6c4b47c72bc3246ddaa7","infoHashBuffer":{"type":"Buffer","data":[63,123,200,232,246,191,254,36,174,26,108,75,71,199,43,195,36,109,218,167]},"announce":[],"urlList":[]}}