{"title":"Gerald Kein - Advanced Ultra-Height","uid":11807686,"size":1209073648,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:41100adeadd3676bcbb69e758fd238aa4abb6acb&amp;dn=Gerald+Kein+-+Advanced+Ultra-Height&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":10,"uploader":"acer47x","files":3,"time":1428657461,"description":"DL400 Advanced Metaphysical And Ultra-HeightÂ® Hypnosis Program \n\nWith Award Winning Instructor, \nGerald F. Kein\n\nTake advantage of this opportunity to own this advanced training on two very specialized hypnotism subjects! Over 11 Hours in length!\n\nDuring the Metaphysical Hypnosis segment, you will have the opportunity to learn how to:\n\n&gt;Help metaphysical clients reach their specific, unique goals.\n&gt;Instruct clients to move into areas of higher self utilizing hypnosis.\n&gt;Teach clients to master out of body travel.\n&gt;Communicate with spirit guides.\n&gt;Instruct clients on channeling while they are in the hypnotic state.\n&gt;Help clients use their power of metaphysical healing.\n&gt;Aid clients in developing natural clairvoyant abilities. \n&gt;Control abreactions.\n&gt;Use protective techniques for yourself and your clients.\n \nThe objective of this training is to give specialized training to the hypnotist for dealing with metaphysical clients requesting certain goals unique to that client's belief system. It is not necessary to share the client's belief in order accommodate the client in achieving his/her goals. This is an advanced and updated training of the original offering in 1993, DL300. You won't want to miss this opportunity to benefit you and your clients!\n\nUltra-HeightÂ® Hypnosis offers the following benefits as well as updated innovations of this amazing transformational approach:\n\n&gt;Learn how to help clients become aware of their self-healing abilities.\n&gt;Aid clients in communication between sub-conscious and super-conscious minds.\n&gt;Discover how to have the two minds reason with one another in resolving conflicts.\n&gt;Learn how to have the two minds analyze suggestions.\n&gt;Learn how to achieve communication with thoughts generated externally.\n&gt;Enhance the client's natural healing abilities. \n&gt;Learn step-by-step procedures for attaining Ultra-HeightÂ® Hypnosis.\n&gt;Learn techniques of utilizing self-hypnosis to achieve Ultra-HeightÂ®.\n&gt;See how it all comes together with many\n  demonstrations.\n\nIn the Ultra-HeightÂ® segment, Jerry presents his own unique techniques for establishing communication between the sub-conscious and the super-conscious minds. You will discover how to induce clients to the somnambulistic or hypnotic coma state physically, while taking the mind to an Ultra-HeightÂ® of awareness.\n\nIn this state, the client is able to discover not only what caused his particular issue, but also, exactly what is necessary for the hypnotist to completely eliminate it. This may become one of the most profound rapid transformational interventions available to the professional hypnotist. It is presented in a clinical step-by-step approach with demonstrations and scripts included","torrent":{"xt":"urn:btih:41100adeadd3676bcbb69e758fd238aa4abb6acb","amp;dn":"Gerald+Kein+-+Advanced+Ultra-Height","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41100adeadd3676bcbb69e758fd238aa4abb6acb","infoHashBuffer":{"type":"Buffer","data":[65,16,10,222,173,211,103,107,203,182,158,117,143,210,56,170,74,187,106,203]},"announce":[],"urlList":[]}}