{"title":"Steve Pieczenik Talks - Dr. Steve Pieczenik","uid":11710329,"size":2340776,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4573d0c023a4ee55c417e4b6c04924ac2ad5892c&amp;dn=Steve+Pieczenik+Talks+-+Dr.+Steve+Pieczenik&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"starxteel","files":2,"time":1424309878,"description":"\n&quot;I compiled all my blogs into one book for a simple reason. I wanted to make certain in the years to come that if the internet was blocked, heavily censored or restricted, there was a complete record of that time before such drastic censorship. The fair question to ask is: do I believe that such a time of serious restriction of the internet will come? The answer is simply yes!&quot;\n      -Dr. Steve R. Pieczenik\n\nAbout the author:\nDr. Steve Pieczenik is a critically acclaimed author of psycho-political thrillers and the co-creator of the New York Times best-selling &quot;Tom Clancy's Op-Center&quot; and &quot;Tom Clancy's Net Force&quot; book series. He is also one of the world's most experienced international crisis managers and hostage negotiators. His novels are based on his twenty years experience in resolving international crises for five U.S. administrations.\n\nDr. Pieczenik received his B.A. from Cornell University,trained in Psychiatry at Harvard and has both an M.D. from Cornell University Medical College and a Ph.D. in International Relations from M.I.T. \n\nDr. Pieczenik is an expert in psychological warfare, political psychology, regime change, intelligence, counterintelligence and covert operations. During his career as a senior State Department official, Dr. Pieczenik utilized his unique abilities and expertise to develop strategies and tactics that were instrumental in resolving major conflicts in Asia, the Middle East, Latin America, Europe and the United States","torrent":{"xt":"urn:btih:4573d0c023a4ee55c417e4b6c04924ac2ad5892c","amp;dn":"Steve+Pieczenik+Talks+-+Dr.+Steve+Pieczenik","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4573d0c023a4ee55c417e4b6c04924ac2ad5892c","infoHashBuffer":{"type":"Buffer","data":[69,115,208,192,35,164,238,85,196,23,228,182,192,73,36,172,42,213,137,44]},"announce":[],"urlList":[]}}