{"title":"TSPussyhunters--TPH-36182 Venus Lux and Syren de Mer Med HD","uid":11020754,"size":2214964179,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:46e067ae2a42b2bb5507bdc1c6325fcbd3c6b36b&amp;dn=TSPussyhunters--TPH-36182+Venus+Lux+and+Syren+de+Mer+Med+HD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1410562050,"description":"\nVenus Lux Takes Uses Her Cock to Solve Fight with Her MILF Neighbour\n\nSep 12, 2014 - Performers: Venus Lux  and  Syren de Mer \n\n\nMed and HD MP4 + Pics.\n\n\nWe may have to rename Venus as the Ts MILF specialist because we can't get enough of watching her take down and shag hot mamas! \n\nWe're lucky today to have mega babe, Syren De Mer and Venus play out a little neighbourly quarrel that ends in a kiss and swap my cum. \n\nVenus knows Syren's frustration with her punky ways and loud music is only skin so when Syren storms into her apartment shouting &quot;that her bad behaviour and slutty ways are only going to get Venus pregnant&quot;, well, that just proves that the lonely MILF has been paying a little too close attention to Venus (every part except the whole pregnancy thing!). \n\nVenus decides that &quot;insult&quot; is a good segway into grabbing Syren's hair, shoving her on the bed, handcuffing her to the post and spreading her pussy lips with her tongue. \n\nThat's when things get really good and Syren confesses to fantasizing about Venus while she masturbates every single night. Well, Venus has a cure for the vibrator and she shows Syren her nice, hard fuck-ready cock. The night gets tense and you can almost see Syren's holes pre-orgasm twitch and soak, just at the thought of feeling Venus' hard dick inside her long deprived pussy and ass. Venus goes back and forth from Syren holes, making her ass gape and fucks her in all kinds of pussy exposing positions. Finally the cum load down Syren's throat and all over her face is so damn sexy, Venus gets down and does a little post pop kissing. \n\nScreens &lt;a href=&quot;\nhttp://www.tspussyhunters.com/site/shoot.jsp?shootId=36182&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tspussyhunters.com/site/shoot.jsp?shootId=36182&lt;/a&gt;\n\n15 000 Femdom/BDSM/Fetish torrentuploads in the box, no reason to stop now is there ? :)\n\nJust keep on leaving us the nice comments below and we are happy :)\n\n\nAny Questions ?? Read our FAQ!!\n   &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)\n\n\n","torrent":{"xt":"urn:btih:46e067ae2a42b2bb5507bdc1c6325fcbd3c6b36b","amp;dn":"TSPussyhunters--TPH-36182+Venus+Lux+and+Syren+de+Mer+Med+HD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46e067ae2a42b2bb5507bdc1c6325fcbd3c6b36b","infoHashBuffer":{"type":"Buffer","data":[70,224,103,174,42,66,178,187,85,7,189,193,198,50,95,203,211,198,179,107]},"announce":[],"urlList":[]}}