{"title":"Amateur.Introductions.19.XXX.DVDRip.x264-XCiTE","uid":11770246,"size":1557016621,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:4715e2d115b0c86a0970da84cbda9b5bf7966bab&amp;dn=Amateur.Introductions.19.XXX.DVDRip.x264-XCiTE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"xxxlavalxxx","files":6,"time":1427041575,"description":"Category\tAmateur, Oral, P.O.V. - Point of View, Swallowing, Cumshots, Amateur Allure's Amateur Introductions Series\n\nStarring\tSamantha Hayes, Jade Jantzen, Denise, Sasha Summers, Kasey Warner, Melissa Matthews\n\nAdorable Denise is only 20 years old, 5'1' and one of the cutest girls ever. In this fun fantasy video, she shows me around my potential new apartment. Denise seals the deal like every real estate agent should - with a hot suck, fuck, and swallow session!\nKasey Warner is 18 years young and from Maryland. Today is a very special day for Kasey -- It is literally her 19th birthday! So for her final act of 18 years, she decides to shoot her very first adult video. Kasey gets so turned on sucking Ray's cock that he slides off her shorts and gives her a good hard pounding before loading her teen mouth with a thick load of cum! Happy birthday Kasey!\nStunning 21 year old Sasha Summers is from Tennessee and extremely horny. She has gorgeous natural 34C boobs and an insatiable thirst for semen. Sasha is here to suck her very first cock on camera. First Ray fucks her pretty mouth, then he bends her over and nails her hard from behind. Finally Sasha opens wide for the prize -- a hot, sticky river of cum down her throat!\nJade Jantzen, a gorgeous, exotic 5'3 21-year-old beauty, comes to us from Dallas, Texas. Jade loves sex and is here to give head and swallow for the first time on camera. She meets with Ray for an audition and blows his mind, taking his cock deep into her tight wet pussy. Ray gives this petite brunette babe a good hard fuck then pulls out and feeds Jade a nice thick load of cum! She swallows it down with a smile. What a doll!\nMelissa Matthews is a 20 year old beauty with a gorgeous ass! This little 5'2 inch babe is quite the cock sucker and she gives Ray a full service blow job. Ray then slams her tight little pink &amp; completely shaven pussy before he dumps a huge load of jizz down her throat!\nBeautiful Samantha Hayes is from Alaska and freshly 19 years of age. This sexy blue-eyed brunette is here to suck, fuck and swallow a big load of cum. Samantha absolutely devours Ray's cock before he gives her a good hard fucking and loads her up with sperm! What a hottie!\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=66397354667952788871.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=66397354667952788871.jpg&lt;/a&gt;\n    \t &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=12536260385174216145.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=12536260385174216145.jpg&lt;/a&gt;\n    \t &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=68334763074212257188.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=68334763074212257188.jpeg&lt;/a&gt;","torrent":{"xt":"urn:btih:4715e2d115b0c86a0970da84cbda9b5bf7966bab","amp;dn":"Amateur.Introductions.19.XXX.DVDRip.x264-XCiTE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4715e2d115b0c86a0970da84cbda9b5bf7966bab","infoHashBuffer":{"type":"Buffer","data":[71,21,226,209,21,176,200,106,9,112,218,132,203,218,155,91,247,150,107,171]},"announce":[],"urlList":[]}}