{"title":"[MomsTeachSex] Danica Dillon, Sammie Daniels, Tysen Rich (On A M","uid":11774230,"size":413073881,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:49f53b00393ed00b33f6d6b263ae9ea3a0f79224&amp;dn=%5BMomsTeachSex%5D+Danica+Dillon%2C+Sammie+Daniels%2C+Tysen+Rich+%28On+A+M&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Upl0ad3rR","files":1,"time":1427205386,"description":"---:More From My Torrent's Here:---   &lt;a href=&quot;\nhttps://thepiratebay.se/user/Upl0ad3rR&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/user/Upl0ad3rR&lt;/a&gt;\n\n---:ScreeNshotS:---  &lt;a href=&quot;\nhttp://image-tpb.com/img-55115f197e4ab.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image-tpb.com/img-55115f197e4ab.html&lt;/a&gt; \n &lt;a href=&quot;\nhttp://image-tpb.com/img-55115f1ac3045.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image-tpb.com/img-55115f1ac3045.html&lt;/a&gt; \n &lt;a href=&quot;\nhttp://image-tpb.com/img-55115f1c0175b.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image-tpb.com/img-55115f1c0175b.html&lt;/a&gt; \n\nDanica Dillon is enjoying some gardening when she is approached by Cody Steele, who is on a mission to talk religion. Danica invites him inside to use the restroom and lets him know that she'll get Tysen Rich and Sammie Daniels from the back yard. Little does Danica know that Danica is sunbathing nude while Tysen rubs lotion into the blonde's back!\n\nTysen quickly talks Cody into helping her out before he flees to the bathroom. Danica, Sammie, and Tysen agree to share him and then use his tie to guide him to the couch to take care of Cody's problem!\n\nThe girls take their time pulling out Cody's cock, and within just a few seconds Danica brings him to a quick climax all over his belly. Danica orders Cody to go sit on the other side of the room and watch so that the girls can give him a show to go with his climax. Warming up, they exchange kisses and work on getting naked together.\n\nTysen is the first to find herself in the middle of the attention with Danica's fingers pressed deep into her tight little pussy and Sammie's magic tongue working her slit. When the trio changes places, Danica finds herself on her back with Sammie's fingers pushed deep while Tysen rides her stepmom's face.\n\nNext it's Sammie's turn to enjoy some sensual fun. Danica is all over eating out the blonde's juicy snatch while Tysen uses her warm soft tongue on her girlfriend's tits until her nipples are rock hard. Sammie helps to rearrange Tysen and Danica into a chain of pussy fingering with her fingers buried in Tysen's twat while Tysen gives Danica the same treatment.\n\nFinally Sammie gets her share of the attention when Danica sits on her face for a pussy licking while she and Tysen work Sammie's sweet snatch. Sammie can't hold back her orgasmic moans, making it clear that she loves everything she's feeling!\n\nNow that all of the girls have had a bit of satisfaction, they can really get creative. Their next position is a love triangle so that each of them can pleasure one another's fuck holes. Then Sammie and Tysen finish their sexy afternoon by working together to pleasure Danica's landing strip twat until Tysen's stepmom gasps her orgasmic bliss and completes Cody's peep show.\n\nFormat                         : MPEG-4\nFormat profile                 : Base Media\nCodec ID                       : isom\nFile size                      : 394 MiB\nDuration                       : 27mn 43s\nOverall bit rate mode          : Variable\nOverall bit rate               : 1 986 Kbps","torrent":{"xt":"urn:btih:49f53b00393ed00b33f6d6b263ae9ea3a0f79224","amp;dn":"%5BMomsTeachSex%5D+Danica+Dillon%2C+Sammie+Daniels%2C+Tysen+Rich+%28On+A+M","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49f53b00393ed00b33f6d6b263ae9ea3a0f79224","infoHashBuffer":{"type":"Buffer","data":[73,245,59,0,57,62,208,11,51,246,214,178,99,174,158,163,160,247,146,36]},"announce":[],"urlList":[]}}