{"title":"Healing Through Forgiveness, Why Forgive , ebook English","uid":11810449,"size":1212345,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4a40e17668dc3fa94ffa5fcdcee048c5af942315&amp;dn=Healing+Through+Forgiveness%2C+Why+Forgive+%2C+ebook+English&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kloekieboe","files":1,"time":1428758176,"description":"Feeling bitter interferes with the body's hormonal and immune systems, according to Carsten Wrosch, an associate professor of psychology at Concordia University in Montreal and an author of a chapter in the new book. Studies have shown that bitter, angry people have higher blood pressure and heart rate and are more likely to die of heart disease and other illnesses.\nThe data that negative mental states cause heart problems is just stupendous. The data is just as established as smoking, and the size of the effect is the same.&quot; \n--Dr. Charles Raison\n\n\nPhysiologically, when we feel negatively towards someone, our bodies instinctively prepare to fight that person, which leads to changes such as an increase in blood pressure. &quot;We run hot as our inflammatory system responds to dangers and threats,&quot; says Raison, clinical director of the Mind-Body Program at Emory.\nFeeling this way in the short term might not be dangerous -- it might even be helpful to fight off an enemy -- but the problem with bitterness is that it goes on and on. When our bodies are constantly primed to fight someone, the increase in blood pressure and in chemicals such as C-reactive protein eventually take a toll on the heart and other parts of the body","torrent":{"xt":"urn:btih:4a40e17668dc3fa94ffa5fcdcee048c5af942315","amp;dn":"Healing+Through+Forgiveness%2C+Why+Forgive+%2C+ebook+English","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a40e17668dc3fa94ffa5fcdcee048c5af942315","infoHashBuffer":{"type":"Buffer","data":[74,64,225,118,104,220,63,169,79,250,95,205,206,224,72,197,175,148,35,21]},"announce":[],"urlList":[]}}