{"title":"Voidcraeft - Negation Made Flesh  mp3  VBR  2014","uid":11060732,"size":76016394,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4aba99259a1dc65e2f3143fed66bb8aef12d011a&amp;dn=Voidcraeft+-+Negation+Made+Flesh++mp3++VBR++2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"analogkid6103","files":6,"time":1411168711,"description":"  \t\t\nDescription\nBitrate VBR\nArtist: Voidcraeft\nRelease: Negation Made Flesh\nYear: 2014\nCountry: Germany\nVoidcraeft is my latest one-man musical endeavour.\nInstrumentally speaking, it is somewhat atypical black metal with an emphasis on dissonance.\nThe lyrical themes deal with emptiness, pessimism, renunciation, suffering and the human condition in general.\n\nIn my early days I was primarily influenced by raw black metal like Darkthrone (primarily Under a Funeral Moon and perhaps Transilvanian Hunger, they haven't made anything resembling black metal in close to a decade now, though) and Katharsis (of Norma Evangelium Diaboli fame).\nIn the past ten years the two artists I consumed the most and returned to over and over again are avant-garde black metal legends Deathspell Omega and Australian experimental (blackened) death metal pioneers Portal.\nOther bands worth mentioning are Nightbringer, Black Witchery, Diocletian and Antediluvian.\n\nIt has been three months since the last release and there have been a lot of changes since then.\nDefinitely for the better.\nFirst, I stopped using a drum machine and hired a proper drummer for this release.\nSo, many thanks to Chris Balch (Nostril Caverns) from Canada for putting up with my long, erratic songs.\nThe subject of drum machine use had been very painful for me for years and I felt like this change finally enabled me to make somewhat &quot;authentic&quot; music.\nThis is also why I was able to make a full-length album instead of the usual 20 minute releases.\n\nSince I was very pleased with his work I originally intended to keep him around for future releases.\nHowever, I was unexpectedly given access to a rehearsal room with a decent drum kit and a proper microphone setup for recordings.\nI started frantically practising the drums for 1-3 hours every single day and have not stopped doing so since then.\nNow, Chris has been playing the drums for a long time and it will likely take me at least 5 years of regular practice to get close to his level but I decided to play the drums myself on future Voidcraeft releases.\nI just have a strong desire to make everything myself and since Chris plays the guitar, too, I am sure he can relate.\n\nTrack listing:\n1. The False Image of Life (7:34)\n2. Emissary of the Void (9:00)\n3. A Flash of the Absolute (7:18)\n4. In the Bliss of Stagnation (8:29)\n5. Flight from Men (7:59)\n\n","torrent":{"xt":"urn:btih:4aba99259a1dc65e2f3143fed66bb8aef12d011a","amp;dn":"Voidcraeft+-+Negation+Made+Flesh++mp3++VBR++2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4aba99259a1dc65e2f3143fed66bb8aef12d011a","infoHashBuffer":{"type":"Buffer","data":[74,186,153,37,154,29,198,94,47,49,67,254,214,107,184,174,241,45,1,26]},"announce":[],"urlList":[]}}