{"title":"Israel Nash Gripka - New York Town [2009] [EAC/FLAC]","uid":11699270,"size":311210377,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4ad74349fb786a07efba96030347c5fc105529d1&amp;dn=Israel+Nash+Gripka+-+New+York+Town+%5B2009%5D+%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dickspic","files":16,"time":1423848961,"description":"01 - Evening\n02 - Pray For Rain\n03 - Let It Go\n04 - Bricks\n05 - You Were Right\n06 - Confess\n07 - Either Way\n08 - Let Me Down\n09 - Concrete\n10 - Don't Run\n11 - Pink Long-Stem Rose\n12 - Beautiful\n\nThe cover is a murky picture that shows a messy haired young man with a guitar sitting in front of a river and with NYC in the background with a threatening sky overhead. Assuming it is on the Jersey side of the river that would be the George Washington Bridge, however it isn't quite clear. (See Editor's Note below.) Much about this disc isn't quite clear except the music and the songs themselves. They take one back to early very Bruce Springsteen in their sound and delivery; the Springsteen of Greetings From Asbury Park, N.J. This is a singer songwriter who came out of the Midwest playing in a band who moved to NYC to expand a solo career. There isn't much background on either the man or his music (and for that matter even the photos don't show him with any clarity so you could pick him out of a crowd). The you place the disc in the changer and you give a listen to a voice that knows what it wants to do, and does it. Just listen to the words of one of the twelve songs he wrote that comprise this disc, and you know this is someone you want to hear more from.\n\nThe voice has rough edges on it that give it some force and pushes the meaning forward. The backing band is well schooled with letting the singer present his message and plays with a force that accentuates the meaning and drives it home without obscuring it at all. There is a close to the earth sentiment that runs through the disc and it is presented in a way someone raised in a city wouldn't; concern for rain and seeing it as a healing force and not an inconvenience, and looking at concrete as an obstruction to the earth and growth. The music is folk gone electric to enhance meanings and give it the power it needs to reach a broader population. This is a disc that serves as a harbinger of more good music to follow and this is someone to definitely keep an eye on","torrent":{"xt":"urn:btih:4ad74349fb786a07efba96030347c5fc105529d1","amp;dn":"Israel+Nash+Gripka+-+New+York+Town+%5B2009%5D+%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ad74349fb786a07efba96030347c5fc105529d1","infoHashBuffer":{"type":"Buffer","data":[74,215,67,73,251,120,106,7,239,186,150,3,3,71,197,252,16,85,41,209]},"announce":[],"urlList":[]}}