{"title":"Richard Swinburne - Mind, Brain, and Free Will","uid":10913198,"size":1154379,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4b2a2a9a0cd1c4e002ba65c8e24d009870f22bd6&amp;dn=Richard+Swinburne+-+Mind%2C+Brain%2C+and+Free+Will&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"philosophi","files":-1,"time":1409281392,"description":"Richard Swinburne - Mind, Brain, and Free Will\n\nMind, Brain, and Free Will presents a powerful new case for substance dualism (the idea that humans consist of two parts--body and soul) and for libertarian free will (that humans have some freedom to choose between alternatives, independently of the causes which influence them). Richard Swinburne argues that answers to questions about mind, body, and free will depend crucially on the answers to more general philosophical questions. He begins by analyzing the criteria for one event being the same as another, one substance being the same as another, and a state of affairs being metaphysically possible; and then goes on to analyze the criteria for a belief about these issues being justified. Pure mental events (including conscious events) are distinct from physical events and interact with them. Swinburne claims that no result from neuroscience or any other science could show that interaction does not take place; and illustrates this claim by showing that recent scientific work (such as Libet's experiments) has no tendency whatever to show that our intentions do not cause brain events. He goes on to argue for agent causation, and claims that--to speak precisely--it is we, and not our intentions, that cause our brain events. It is metaphysically possible that each of us could acquire a new brain or continue to exist without a brain; and so we are essentially souls. Brain events and conscious events are so different from each other that it would not be possible to establish a scientific theory which would predict what each of us would do in situations of moral conflict. Hence given a crucial epistemological principle (the Principle of Credulity) we should believe that things are as they seem to be: that we make choices independently of the causes which influence us. According to Swinburne's lucid and ambitious account, it follows that we are morally responsible for our actions.","torrent":{"xt":"urn:btih:4b2a2a9a0cd1c4e002ba65c8e24d009870f22bd6","amp;dn":"Richard+Swinburne+-+Mind%2C+Brain%2C+and+Free+Will","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b2a2a9a0cd1c4e002ba65c8e24d009870f22bd6","infoHashBuffer":{"type":"Buffer","data":[75,42,42,154,12,209,196,224,2,186,101,200,226,77,0,152,112,242,43,214]},"announce":[],"urlList":[]}}