{"title":"13 Hours by Mitchell Zuckoff","uid":11059194,"size":1839161,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4dbf813e0120c789563b55482e5f00bd1c5e5f15&amp;dn=13+Hours+by+Mitchell+Zuckoff&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"WinterGale","files":2,"time":1411153020,"description":"13 Hours: The Inside Account of What Really Happened In Benghazi\nby Mitchell Zuckoff and the Annex Security Team\n\nThe harrowing, true account from the brave men on the ground who fought back during the Battle of Benghazi.\n\n13 HOURS presents, for the first time ever, the true account of the events of September 11, 2012, when terrorists attacked the US State Department Special Mission Compound and a nearby CIA station called the Annex in Benghazi, Libya. A team of six American security operators fought to repel the attackers and protect the Americans stationed there. Those men went beyond the call of duty, performing extraordinary acts of courage and heroism, to avert tragedy on a much larger scale. This is their personal account, never before told, of what happened during the thirteen hours of that now-infamous attack.\n\n13 HOURS sets the record straight on what happened during a night that has been shrouded in mystery and controversy. Written by New York Times bestselling author Mitchell Zuckoff, this riveting book takes readers into the action-packed story of heroes who laid their lives on the line for one another, for their countrymen, and for their country.\n\n13 HOURS is a stunning, eye-opening, and intense book--but most importantly, it is the truth. The story of what happened to these men--and what they accomplished--is unforgettable.\n\n-----------------------------------------------------------------------------------\n\nFile format is in epub","torrent":{"xt":"urn:btih:4dbf813e0120c789563b55482e5f00bd1c5e5f15","amp;dn":"13+Hours+by+Mitchell+Zuckoff","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4dbf813e0120c789563b55482e5f00bd1c5e5f15","infoHashBuffer":{"type":"Buffer","data":[77,191,129,62,1,32,199,137,86,59,85,72,46,95,0,189,28,94,95,21]},"announce":[],"urlList":[]}}