{"title":"Mama Rose's Turn- The True Story of America's Most Notorious Sta","uid":11043668,"size":17127871,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5b0a723f3544005196072ab997a9a2513231dae2&amp;dn=Mama+Rose%27s+Turn-+The+True+Story+of+America%27s+Most+Notorious+Sta&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"gratefuldawg77","files":6,"time":1410918305,"description":"Hers is the show business saga you think you already know--but you ain't seen nothin' yet. Rose Thompson Hovick, mother of June Havoc and Gypsy Rose Lee, went down in theatrical history as &quot;The Stage Mother from Hell&quot; after her immortalization on Broadway in &quot;Gypsy: A Musical Fable.&quot; Yet the musical was 75 percent fictionalized by playwright Arthur Laurents and condensed for the stage. Rose's full story is even more striking.\n\nBorn fearless on the North Dakota prairie in 1891, Rose Thompson had a kind father and a gallivanting mother who sold lacy finery to prostitutes. She became an unhappy teenage bride whose marriage yielded two entrancing daughters, Louise and June. When June was discovered to be a child prodigy in ballet, capable of dancing en pointe by the age of three, Rose, without benefit of any theatrical training, set out to create onstage opportunities for her magical baby girl--and succeeded.\n\nRose followed her own star and created two more in dramatic and colorful style: &quot;Baby June&quot; became a child headliner in vaudeville, and Louise grew up to be the well-known burlesque star Gypsy Rose Lee. The rest of Mama Rose's remarkable story included love affairs with both men and women, the operation of a &quot;lesbian pick-up joint&quot; where she sold homemade bathtub gin, wild attempts to extort money from Gypsy and June, two stints as a chicken farmer, and three allegations of cold-blooded murder--all of which was deemed unfit for the script of &quot;Gypsy.&quot; Here, at last, is the rollicking, wild saga that never made it to the stage.","torrent":{"xt":"urn:btih:5b0a723f3544005196072ab997a9a2513231dae2","amp;dn":"Mama+Rose%27s+Turn-+The+True+Story+of+America%27s+Most+Notorious+Sta","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b0a723f3544005196072ab997a9a2513231dae2","infoHashBuffer":{"type":"Buffer","data":[91,10,114,63,53,68,0,81,150,7,42,185,151,169,162,81,50,49,218,226]},"announce":[],"urlList":[]}}