{"title":"EXPLOITED COLLEGE GIRLS - Lexi - Her First Hard Fuck  **NEW**","uid":11019947,"size":431753013,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:5b145c36733967d58980e2e502511935c66ba3a6&amp;dn=EXPLOITED+COLLEGE+GIRLS+-+Lexi+-+Her+First+Hard+Fuck++%2A%2ANEW%2A%2A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"beta2008x","files":1,"time":1410550790,"description":"   &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=irmd6_lxi.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=irmd6_lxi.jpg&lt;/a&gt;\n   &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=motqo_ecg_lexi_s.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=motqo_ecg_lexi_s.jpg&lt;/a&gt;\n\n\nTall, slim Lexi is a little more elegant than our typical girl. Even when she's getting drilled in doggy by Jay or touching up her lipstick after a blowjob she's looking pretty hot and put together. From the way her long legs come together to form a perfect inner thigh gap, to her bouncy bubble butt, to her perky A cup tits, this girl is amazing from top to bottom.\n\nWhen we meet Lexi she looks like she might be a little too prim and proper to be a pornstar, but that facade doesn't last long as she changes outfits and lets us see that her perky little nips are already hard and her bare pussy is already a little wet. There is really no substitute for a girl who is happy to preheat her own oven, and Jay takes full advantage by feeling her up as she gets ready.\n\nEventually Lexi gets her make up just perfect and moves to the bed to get things started. Jay has her strip and pose, as usual, and then gets her to the edge of the bed for a dip into the Ex Co Gi toybox. This time he comes up with a vibrator and with it, a little lube and his fingers he's able to bring Lexi to a quick, intense orgasm. She tries to return the favor by dropping to the floor to suck Jay's cock, but our camera stud isn't so easily finished. She does get him hard, though and this means it's go time. Lexi gets pounded on her back, then on her front with her face pressed into the bed, then she hops up into cowgirl and spins into reverse cowgirl for Jay's Energizer Bunny impression.\n\nAfter stuffing Lexi's box from every angle, Jay has her get back on the floor to suck and tug him to the big finish which lands on her tits, and to her obvious chagrin, her pretty, made up face.\t","torrent":{"xt":"urn:btih:5b145c36733967d58980e2e502511935c66ba3a6","amp;dn":"EXPLOITED+COLLEGE+GIRLS+-+Lexi+-+Her+First+Hard+Fuck++%2A%2ANEW%2A%2A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b145c36733967d58980e2e502511935c66ba3a6","infoHashBuffer":{"type":"Buffer","data":[91,20,92,54,115,57,103,213,137,128,226,229,2,81,25,53,198,107,163,166]},"announce":[],"urlList":[]}}