{"title":"Comparison Iran versus Israel","uid":11737470,"size":136318828,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:5c7512296f81567255a2abe3818e5e9c30a41c1b&amp;dn=Comparison+Iran+versus+Israel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"H2oDragon","files":3,"time":1425614544,"description":"Hi, all. I just got this from\nAnd thanks to the redditor cwm9, who posted \nIranian hospitality.\nIsraeli hospitality.   ...two video articles, \nI immediately saved them for you, the computer user.\n\nI'm not christian. I was, then I grew up and stopped believing in fantasies.\nAs it turns out, all religions keep people separated, contributing to wars! (&quot;God is on our side,&quot; and similar bullshit!) \n\nGod is eternal! It's like the universe! (Another name, perhaps.)\nAnd there's no Big Bang! It's a theory, and not a very good one.\nIf one compares the special relativity of Einstein with the quantum-cat theory of Schrodinger, theres a way that they can both be true. \nSomeone, in a scientific magazine, in the early 70's called it the Relative State Theory. \n\nIt involves the constant splitting of a multi-dimensional universe. \nE.G., When I drop a ball on the table, there seem to be two possibilities: \n1. ball stays on table  2. ball rolls off, and onto floor. \n\nBoth things &quot;happen,&quot; or are happening, will happen, etc., permanently. \nI, the scientist, splits into two, around that phenomenon. \nTony (1) writes in notebook: ball stays on table.\nTony (2) writes: ball falls off, into floor.\nBut the first Tony doesn't see the second, etc, as the &quot;universe&quot; has split. \nIn X dimensions, one Tony lives his life, but in X+1 dimensions, there is room for infinitely many Tonys. \n\nAnother way of saying it is: everything that &quot;can happen&quot; is happening, constantly, forever, being young, middle, old, unborn, and long-ago perished. But the 3-dimensional self, that takes &quot;Time&quot; as the fourth dimension, &quot;experiences&quot; only the present, now, with projections called &quot;the past' and &quot;the future.&quot; But he (I mean I, Tony) can't touch the past or future. \n\nA good book to help learn this is Edwin Abbott's   FLATLAND, A Romance in Many Dimensions","torrent":{"xt":"urn:btih:5c7512296f81567255a2abe3818e5e9c30a41c1b","amp;dn":"Comparison+Iran+versus+Israel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c7512296f81567255a2abe3818e5e9c30a41c1b","infoHashBuffer":{"type":"Buffer","data":[92,117,18,41,111,129,86,114,85,162,171,227,129,142,94,156,48,164,28,27]},"announce":[],"urlList":[]}}