{"title":"Lisa Napoli - Radio Shangri-La: What I Learned in Bhutan, the Ha","uid":11053341,"size":221458476,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5eb34592f11f71822e48597f01d0af85a4d58771&amp;dn=Lisa+Napoli+-+Radio+Shangri-La%3A+What+I+Learned+in+Bhutan%2C+the+Ha&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SectorVector","files":-1,"time":1411054844,"description":"\nRadio Shangri-La: What I Learned in Bhutan, the Happiest Kingdom on Earth\n\nby Lisa Napoli, read by the author\n\n\n# Unabridged edition 2011 \n# Duration: 7 hours and 40 minutes \n# MP3 64 kbps\n#\n# EPUB + MOBI included.\n\n\nLisa Napoli  was in the grip  of a crisis, dissatisfied  with her life\nand her  work as a  radio journalist. When  a chance encounter  with a\nhandsome stranger  presented her with  an opportunity to  move halfway\naround the world, Lisa left behind  cosmopolitan Los Angeles for a new\nadventure in the ancient Himalayan kingdom  of Bhutan - said to be one\nof the happiest places on earth.\n\n Long isolated from  industrialization and just beginning  to open its\ndoors to the modern world, Bhutan is a deeply spiritual place, devoted\nto environmental  conservation and committed  to the happiness  of its\npeople  - in  fact,  Bhutan  measures its  success  in Gross  National\nHappiness rather  than in GNP. In  a country without a  single traffic\nlight, its citizens  are believed to be among the  most content in the\nworld. To Lisa, it  seemed to be a place that  offered the opposite of\nher  fast-paced life  in the  United States,  where the  noisy din  of\nsound-bite  news and  cell phones  dominate our  days, and  meaningful\nconversation  is  a  rare  commodity; where  everyone  is  plugged  in\ndigitally, yet rarely connects with the people around them.\n\n Thousands of miles away from  everything and everyone she knows, Lisa\ncreates a  new community for herself.  As she helps to  start Bhutan's\nfirst youth-oriented radio  station, Kuzoo FM, she must  come to terms\nwith her  conflicting feelings  about the  impact of  the medium  on a\ncountry that had been shielded  from its effects. Immersing herself in\nBhutan'ss  rapidly  changing  culture,  Lisa  realizes  that  her  own\nperspective on life is changing as  well - and that she is discovering\nthe sense of purpose and joy that she has been yearning for.\n\n In  this smart,  heartfelt,  and beautifully  written  book, sure  to\nplease  fans of  transporting travel  narratives and  personal memoirs\nalike,  Lisa  Napoli discovers  that  the  world  is a  beautiful  and\ncomplicated place-and comes  to appreciate her life  for the adventure\nit is.\n\n\n\n-_-","torrent":{"xt":"urn:btih:5eb34592f11f71822e48597f01d0af85a4d58771","amp;dn":"Lisa+Napoli+-+Radio+Shangri-La%3A+What+I+Learned+in+Bhutan%2C+the+Ha","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5eb34592f11f71822e48597f01d0af85a4d58771","infoHashBuffer":{"type":"Buffer","data":[94,179,69,146,241,31,113,130,46,72,89,127,1,208,175,133,164,213,135,113]},"announce":[],"urlList":[]}}