{"title":"The Anthony Cumia Show 2015-04-01 MP4 MP3 combo","uid":11792111,"size":371853277,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:60b1abe3bc43003c969b482db61cf262f3020c29&amp;dn=The+Anthony+Cumia+Show+2015-04-01+MP4+MP3+combo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mothergoose58","files":2,"time":1427992685,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\n\nEpisode 138 &quot;RIP Bill de Blasio&quot; TACS has a somber start today as we pay our respect to Mayor Bill de Blasio (RIP), Ant then talks about attention seeking protesters, expresses his views on the government voicing their opinion when it comes to tolerance, shows his response to a tweet Cher sent, and the callers give their thoughts on the topic. We find out that Fez announced his retirement and will move to Florida, coincidently, the world's largest sperm bank has relocated to Florida, Ant plays the clip of this morning's Ron and Fez with the announcement being made, talks about Andrew Getty's death being caused by traumatic rectal injury, and we investigate what exactly a &quot;rectum prolapse&quot; is and holy shit, it's HORRIFIC! We read about an inmate attack, get into &quot;celebrity news&quot; with a new picture of Tara Reid, the transparency of the Bieber Roast, wax about how much better the roasts used to be, listen to Bieber's douchey speech at the end of his roast, hear Vince Neil's attempt at the nation anthem, Van Halen on Jimmy Kimmel, and see the video of David Lee Roth nailing his nose with a mic stand. Anthony talks about a feel good news story regarding a heart transplant that ends up not feeling so good, a few more callers chime in which leads into convos about drones and questioning who ends up paying for heart transplants, Ant reads a news story about an anti-gay pizza place, and ends the show by briefly talking about Trevor Noah, Patton Oswalt's Twitter joke, and Jim Norton's Time article.\n\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:60b1abe3bc43003c969b482db61cf262f3020c29","amp;dn":"The+Anthony+Cumia+Show+2015-04-01+MP4+MP3+combo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60b1abe3bc43003c969b482db61cf262f3020c29","infoHashBuffer":{"type":"Buffer","data":[96,177,171,227,188,67,0,60,150,155,72,45,182,28,242,98,243,2,12,41]},"announce":[],"urlList":[]}}