{"title":"The First Holocaust. Jewish Fund Raising Campaigns With Holocaus","uid":11720889,"size":3985591,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:64c09119cf19c596b646f325afba498fc8e21033&amp;dn=The+First+Holocaust.+Jewish+Fund+Raising+Campaigns+With+Holocaus&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"HowdyDooDoo","files":1,"time":1424809193,"description":"Most people believe that roughly six million Jews were killed by National Socialist Germany during World War II in an event generally referred to as the Holocaust or the Shoah. But how long have we known about this six million figure? The most frequent answer is that the six million figure was established after the Second World War. But the six million figure is actually remarkably older. Six million Jews in Poland and Russia threatened with imminent holocaust: this allegation was appearing in such sources as &quot;The New York Times&quot; -- but the year was 1919! Heddesheimer documents post-WWI propaganda that claimed East European Jewry was on the brink of annihilation, regularly invoking nowadays well-known buzzwords like &quot;extermination,&quot; &quot;holocaust,&quot; and the now famous and almost talismanic six million figure. It gives details how that propaganda was used prior to WWII in order to agitate for minority rights for Jews in Poland, and for Zionism and Bolshevism in Poland and Russia; and demonstrates how Jewish fundraising operations in America raised vast sums in the name of feeding Polish and Russian Jews. Although this exaggerated propaganda of Jewish suffering slowed down during the 1930s, it never completely ceased and received new momentum in the 1940s during the Second World War. This propaganda skyrocketed after Germany's total defeat, as the victorious nations took advantage of such propaganda. Heddesheimer's book clearly shows that the &quot;six million&quot; figure, together with &quot;extermination&quot; and &quot;holocaust&quot; claims, are Jewish-Zionist in nature and part of a propaganda pattern which started at the very dawn of the 20th century in order to promote Jewish political and financial goals","torrent":{"xt":"urn:btih:64c09119cf19c596b646f325afba498fc8e21033","amp;dn":"The+First+Holocaust.+Jewish+Fund+Raising+Campaigns+With+Holocaus","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64c09119cf19c596b646f325afba498fc8e21033","infoHashBuffer":{"type":"Buffer","data":[100,192,145,25,207,25,197,150,182,70,243,37,175,186,73,143,200,226,16,51]},"announce":[],"urlList":[]}}