{"title":"Power Rangers: Mighty Morphin' S02 (Legacy Collection) (fixed)","uid":11734023,"size":18862416385,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:65622af1ced12caae3eb6537998af89e27df7ff2&amp;dn=Power+Rangers%3A+Mighty+Morphin%27+S02+%28Legacy+Collection%29+%28fixed%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":6,"uploader":"CeraKesh","files":53,"time":1425489120,"description":"Rangers Forever! Earth's defenders never surrender!\n\nPrevious torrents have run into problems of my source files hashing differently and therefore can't be completed. I tried remaking it with some variations in piece size and now my local copy rechecks 100%. So please try this (it uses the same folder as the original but I'd HIGHLY recommend backing up your files from the original torrent just in case). If this works, I'll re-make torrents for the other files.\n\nThese are HQ rips from the Power Rangers Legacy Collection DVDs.\n\n \nSaban was originally to produce only 40 episodes in the series, ending with the two-parter Doomsday. Another character was to make an appearance, named Bubba. As the episode was originally written, he piloted Cyclopsis, and was based off of Kai in Zyuranger. After Cyclopsis' defeat at the hands of the Rangers, Bandora would be sealed away in an urn (mimicking the ending of Zyuranger), and the teenagers would give up their powers then go to senior prom, which indicated that the team would've all been 17-18, as opposed to 14-15.\n\nHowever, due to the unforeseen popularity of the series, Saban, the company that produced Power Rangers, was faced with the possibility of exhausting all of its Zyuranger footage with no more to fall back upon in order to continue producing the show. The company decided not to age the Rangers that much and contacted Toei (the company which produced/produces the Sentai series in Japan) as well as Rainbow Productions (the company that designed and produced the monster suits), requesting another half-season's worth of Zyuranger footage...specifically for Power Rangers. The two Japanese companies agreed, creating around 25 brand-new monsters and filming both human- and zord-sized battle footage for each, as well as incorporating elements from MMPR into the footage (a relationship between the Green and Pink Rangers, and the Blue Ranger as the brains of the group being the most obvious examples). This footage of monsters are collectively known in the Power Rangers fan community as &quot;Zyu2&quot;.\n\nAround this time, Saban was also negotiating a deal with Toei to acquire footage from Gosei Sentai Dairanger, the sentai series which followed Zyuranger. Saban used more than half of the Zyu2 footage in the remainder of Season One of Power Rangers, but when they decided to replace the Dinozords with the mecha from Dairanger in Season Two (termed Thunderzords in Power Rangers), the Zord footage of the remaining Zyu2 monsters became obsolete. To compensate for this, Saban attempted to splice the Zyu2 and Dairanger footage to ensure that the Zyu2 monsters were fighting the Thunder Megazord instead of the Dino Megazord. The new scenes would show only the monster attacking, followed by a shot of just the Thunderzords taking the damage. It did not always work, for occasionally the monster could actually be seen making physical contact with the old Megazord","torrent":{"xt":"urn:btih:65622af1ced12caae3eb6537998af89e27df7ff2","amp;dn":"Power+Rangers%3A+Mighty+Morphin%27+S02+%28Legacy+Collection%29+%28fixed%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65622af1ced12caae3eb6537998af89e27df7ff2","infoHashBuffer":{"type":"Buffer","data":[101,98,42,241,206,209,44,170,227,235,101,55,153,138,248,158,39,223,127,242]},"announce":[],"urlList":[]}}