{"title":"Here Comes the Navy (1934) DVD5 Uncomp [DDR]","uid":11675446,"size":4565291008,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:67adab69f63bc0b0ca99ca7298f045f96630d86f&amp;dn=Here+Comes+the+Navy+%281934%29+DVD5+Uncomp+%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"SaM","files":18,"time":1422836872,"description":"Here Comes the Navy (1934) DVD5 Uncompressed - James Cagney, Pat O'Brien [DDR]\n\nHere Comes the Navy is a 1934 American romantic comedy film starring James Cagney, Pat O'Brien, Gloria Stuart and Frank McHugh.\nThe movie was written by Earl Baldwin and Ben Markson, and directed by Lloyd Bacon.\n\nCAST:- James Cagney, Pat O'Brien, Gloria Stuart, Frank McHugh, Dorothy Tree, Robert Barrat, Willard Robertson, Guinn 'Big Boy' Williams, Howard C. Hickman \n\nDirected by Lloyd Bacon\nWritten by Earl Baldwin, Ben Markson\nMusic by Charles A. Zimmerman\nRunning time 87 minutes\n\nMOVIE PLOT:- Here Comes the Navy (1934)\nO'Conner (Cagney) joins the US Navy to annoy Chief Petty Officer Biff Martin (O'Brien). Comic relief is played by O'Conner best friend &quot;Droopy&quot; (McHugh). O'Conner gets himself court-martialed for being AWOL while visiting Martin's sister Dorothy Martin (Stuart). During gunnery practice O'Conner helps put out a fire in a gun room and receives the Navy Cross medal. Later O'Conner transfers to the US Naval service and is assigned to Macon. When the Macon tries to dock, Martin is accidentally caught on a guide rope and is hoisted into the air; despite orders, Cagney climbs down the rope and saves Martin's life by parachuting both of them to the ground. Later at the wedding of O'Conner to Dorothy, Martin finds that O'Conner is promoted to Boatswain and outranks him.\n\nTo continue a grudge with naval officer Biff Martin, feisty construction worker Chesty O'Connor joins the navy and manages to get stationed on the same ship as Martin. Further complications arise when O'Connor starts dating Martin's sister, whom he meets while on shore leave.\n\nThe film was nominated for the Academy Award for Best Picture. Of historical interest is that a portion of the filming took place aboard the battleship Arizona, which was sunk by the Japanese on December 7, 1941, at Pearl Harbor. Further, portions of the film also include shots of the dirigible Macon, a year before the accident that destroyed the dirigible with the loss of two crew.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 5831 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 29.970\nAudio Codec:  AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: English\nRunTime 87 mins\nSubtitles: None\nRipped by: Trinidad [DDR]","torrent":{"xt":"urn:btih:67adab69f63bc0b0ca99ca7298f045f96630d86f","amp;dn":"Here+Comes+the+Navy+%281934%29+DVD5+Uncomp+%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67adab69f63bc0b0ca99ca7298f045f96630d86f","infoHashBuffer":{"type":"Buffer","data":[103,173,171,105,246,59,192,176,202,153,202,114,152,240,69,249,102,48,216,111]},"announce":[],"urlList":[]}}