{"title":"Battlestar Galactica Complete","uid":11689863,"size":54096654602,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:68e10dd92475a3eeefe8ede47176f8eb78692093&amp;dn=Battlestar+Galactica+Complete&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"PowerOfThePoor1992","files":133,"time":1423480730,"description":"Battlestar Galactica Viewing Order List is Made by John Walker\nTorrent uploaded by POTP\n\nI have already set all the orders, so everything should be as this list below,\nthou I just would like to say this Torrent is really big and i understand,\nbut know this when i watched the show the viewing order was just stupied.\n\nIt just didn't make sense alot of the times and torrents was dead so i couldn't download\nsometimes at all, but i when i finally got my hands on the vieworder list\ni started seeing the hole picture and what Battlestar is all about and what i really missed out on when i didn't understand at times which was really frustrating and annoying that\nbattlestar didn't take their time to actually fill those gaps that didn't make sense \nby letting us viewers know what to watch next.\n\nAnyway now this torrent is 50 GB which is big,and that is because many of the files are from various uploaders with different quality but the Main series it self is all top quality the WEBSODES are verry shit and i tried really hard to find good ones but i just simply couldn't so don't nag about that please. All the other stuff like the razor tv movies they are good quality too as well as the Caprica series\n-----------------------------------------------\nCaprica - Verry Good Quality\n\nAn entire TV series set 58 years before the events of Battlestar Galactica, and revealing the events surrounding the creation of the Cylons. (Although it's worth noting that you don't have to have seen BSG to watch Caprica... and some people have decided to watch this series first, even though it was produced after BSG had finished.)\n\n1.01 Pilot\n1.02 Rebirth\n1.03 Reins of a Waterfall\n1.04 Gravedancing\n1.05 There Is Another Sky\n1.06 Know Thy Enemy\n1.07 The Imperfections of Memory\n1.08 Ghosts in the Machine\n1.09 End of the Line\n1.10 Unvanquished\n1.11 Retribution\n1.12 Things We Lock Away\n1.13 False Labor\n1.14 Blowback\n1.15 The Dirteaters\n1.16 The Heavens Will Rise\n1.17 Here Be Dragons\n1.18 Apotheosis\n---------------------------------------------\nBlood and Chrome - Shit Quality \n\nThis was potentially a whole new show at one stage, but it appears to be now just a stand-alone TV/web movie. The story follows the exploits of a young William Adama during the First Cylon War, and is considered a sequel to Caprica and a prequel to Battlestar Galactica.\n\nAfter disappearing off the radar for a long time (possibly indicating that it wasn't up to the standards set by BSG), the story has finally been release for viewing on Machninima.com. It has been broken into 10 episodes and was released for free in November 2012. \n-----------------------------------------------\nThe Miniseries - Good Quality\n\nNight 1\nNight 2\n-----------------------------------------------\nSeason 1 - Verry Good Quality\n\n1.01 33\n1.02 Water\n1.03 Bastille Day\n1.04 Act of Contrition\n1.05 You Can't Go Home Again\n1.06 Litmus\n1.07 Six Degrees of Separation\n1.08 Flesh and Bone\n1.09 Tigh Me Up, Tigh Me Down\n1.10 The Hand of God\n1.11 Colonial Day\n1.12 Kobol's Last Gleaming, Part I\n1.13 Kobol's Last Gleaming, Part II\n-----------------------------------------------\nSeason 2 - Verry Good Quality\n\n2.01 Scattered\n2.02 Valley of Darkness\n2.03 Fragged\n2.04 Resistance\n2.05 The Farm\n2.06 Home, Part I\n2.07 Home, Part II\n2.08 Final Cut\n2.09 Flight of the Phoenix\n2.10 Pegasus (56 minute extended version)\n2.11 Resurrection Ship, Part I\n2.12 Resurrection Ship, Part II\n2.13 Epiphanies\n2.14 Black Market\n2.15 Scar\n2.16 Sacrifice\n2.17 The Captain's Hand\n\nRazor  - Good Quality\n(101 minute extended version - not the 81 minute broadcast version) TV movie. If you have this on DVD or Bluray, you have the extended version.\n\nImportant note: This was originally broadcast just before Season 4, but chronologically it fits here, telling more of the Pegasus's story. Some people argue it's better to watch after Season 3, as originally broadcast, but it makes most sense to watch it here. Read here for instructions on how to avoid the unintentional spoilers in Razor..\n\nOptional: Razor Flashbacks - Shit Quality\n\nNote: This was billed as a &quot;seven episode web series&quot;, but really they are just deleted scenes from the shorter broadcast version of Razor. In fact, most of these scenes are now reintegrated into the extended version of Razor (the one on DVD and Bluray), making what's left even more unessential. (Read more about these deleted scenes here.)\n\n2.18 Downloaded\n2.19 Lay Down Your Burdens, Part I\n2.20 Lay Down Your Burdens, Part II\n\nThe Resistance  - Good and Bad Quality\nA 10 episode web-based series bridging seasons 2 and 3. (25 mins.) This should be included on your DVDs/Blurays, but if it's not, and you're in the US, you can watch it here.\n-----------------------------------------------\nSeason 3 - Verry Good Quality\n\n3.01 Occupation\n3.02 Precipice\n3.03 Exodus, Part I\n3.04 Exodus, Part II\n3.05 Collaborators\n3.06 Torn\n3.07 A Measure of Salvation\n3.08 Hero\n3.09 Unfinished Business (70 minute extended version - Note: Not included on Region 2 DVDs, but is included on ALL Bluray releases.)\n3.10 The Passage\n3.11 The Eye of Jupiter\n3.12 Rapture\n3.13 Taking a Break From All Your Worries\n3.14 The Woman King\n3.15 A Day in the Life\n3.16 Dirty Hands\n3.17 Maelstrom\n3.18 The Son Also Rises\n3.19 Crossroads, Part I\n3.20 Crossroads, Part II\n\nRazor:  - Good Quality\nYes, this again. (Well this is where Razor was originally broadcast, after all.) Watch the last 10 minutes of Razor here. (Read here more information on what moments I'm talking about.)\n-----------------------------------------------\nSeason 4 - Verry Good Quality\n\n4.01 He That Believeth In Me\n4.02 Six of One\n4.03 The Ties That Bind\n4.04 Escape Velocity\n4.05 The Road Less Traveled\n4.06 Faith\n4.07 Guess What's Coming to Dinner?\n4.08 Sine Qua Non\n4.09 The Hub\n4.10 Revelations\nSeason 4 Continued (aka &quot;Season 4.5&quot; or &quot;The Final Season&quot;)\n\n4.11 Sometimes a Great Notion\nThe Face of the Enemy A 10 episode web-based series (although it plays together like an intense mini-episode). (36 mins.) These episodes have not been included on any DVD or Bluray releases, but if you live in the US you can view them for free on Hulu.com.\n\n4.12 A Disquiet Follows My Soul (53 minute extended version - only on Bluray releases)\n4.13 The Oath\n4.14 Blood on the Scales\n4.15 No Exit\n\nThe Plan  - Good Quality\n(DVD/Bluray movie) A stand-alone movie that shows (approximately) the first two seasons from the Cylons' perspective. (You finally get to see &quot;The Plan&quot;, mentioned all those times in the opening sequence!) Although The Plan was originally released after the show had finished, it is generally agreed that it should be watched here, so that everything is all tied up when you do reach the end.\n\n4.16 Deadlock\n4.17 Someone to Watch Over Me\n4.18 Islanded In a Stream of Stars (62 minute extended version - only on BluRay releases)\n4.19 Daybreak (150 minute extended version - only on BluRay releases)\nThe Plan : This is where this DVD/Bluray movie was originally released (after the show had finished). It seems universally agreed that it's preferable to watch this after No Exit, instead of after you've finished the entire series, but there's no harm in waiting until now.\n-----------------------------------------------\n\nFor more info on the Viewing order list go Here\n\n\n-----------------------------------------------\n\nThis torrent is brought to you by POTP\nPlease Seed this torrent for other to get it!\n\nAnd don't forget to leave a comment... :)\n\nGreets\nPOTP\n\nIf you like the show MUCH buy the Series","torrent":{"xt":"urn:btih:68e10dd92475a3eeefe8ede47176f8eb78692093","amp;dn":"Battlestar+Galactica+Complete","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68e10dd92475a3eeefe8ede47176f8eb78692093","infoHashBuffer":{"type":"Buffer","data":[104,225,13,217,36,117,163,238,239,232,237,228,113,118,248,235,120,105,32,147]},"announce":[],"urlList":[]}}