{"title":"Touch Season 1 Retail DVD9 (3of3) NLSubs-TBS","uid":11661166,"size":7764570814,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:70da8ead9f1656abf4e26e2925b8e1a00c8ebad2&amp;dn=Touch+Season+1+Retail+DVD9+%283of3%29+NLSubs-TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Nobby010","files":-1,"time":1418000146,"description":"Touch\n\nDrama | Mystery | Sci-Fi\nMet o.a. Kiefer Sutherland, David Mazouz en Danny Glover\n\nTouch volgt mensen over de hele wereld die invloed hebben op het leven van elkaar, zichtbaar en onzichtbaar.\nAlleenstaande vader en weduwnaar Martin Bohm (Kiefer Sutherland) worstelt met het opvoeden van zijn elf jaar\noude autistische zoon Jake (David Mazouz). Jake spreekt nooit, toont weinig emotie, laat zich nooit aanraken\nen is enkel geobsedeerd door cijfers. Tot Martin ontdekt dat Jake een bijzondere gave bezit: het vermogen om\nde verborgen patronen van cijfers te zien die elk leven op deze planeet met elkaar verbindt. Met de hulp van\neen briljante professor (Danny Clover) leert Martin te communiceren met Jake en mensen over de hele wereld te\nhelpen. Ontdek nu de verborgen connecties die mensen samenbrengt en laat je raken door deze unieke dramaserie.\n\nEnglish:\nWidower Martin Bohm's wife, Sarah Bohm, died in the twin towers on September 11, 2001. Previously a newspaper journalist, Martin since has worked a series of odd jobs in trying to make sense of his life, which includes caring for his son Jake, who was born on October 26, 2000. Jake was diagnosed as autistic, primarily because he has never uttered a word, and has an aversion to being touched. But Martin begins to believe that there is more to Jake's life than meets the eye. Jake, using a series of numbers, leads Martin to discoveries about a certain equilibrium to the world. Martin may ultimately find out what Jake's grand purpose is, and why Jake was placed on the face of the Earth.\n\nTrailer:\n\n@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@\n\nInfo:\n\nBron: Original DVD9 Season 1\nFormat: DVD9\nBeeld:  (16:9) \nAudio: English, German, French AC-3 5.1\nSubtitles: English, German, French, Retail Dutch (nederlands)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1821681&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1821681&lt;/a&gt;\n\n@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@","torrent":{"xt":"urn:btih:70da8ead9f1656abf4e26e2925b8e1a00c8ebad2","amp;dn":"Touch+Season+1+Retail+DVD9+%283of3%29+NLSubs-TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70da8ead9f1656abf4e26e2925b8e1a00c8ebad2","infoHashBuffer":{"type":"Buffer","data":[112,218,142,173,159,22,86,171,244,226,110,41,37,184,225,160,12,142,186,210]},"announce":[],"urlList":[]}}