{"title":"[FakeAgentUK] Tina (1123 / 09.19.2014)","uid":11056231,"size":873321493,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:7287d07e4cdcb491a368baa563600c3ec8aa9dd5&amp;dn=%5BFakeAgentUK%5D+Tina+%281123+%2F+09.19.2014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"chkm8te","files":1,"time":1411115435,"description":"[FakeAgentUK] Tina (1123 / 09.19.2014)\n\nThis afternoon I had a little shock visit from a former interviewee, a chick called Tina. Now this chick was hot, really hot, tall, tits, peachy arse, you name it she had it. Fucking mint. So she's wondering why I ain't called her after 5 months? Well I know, you know, she don't know! So I tell her it's because she wasn't filthy enough and to get with my clients she needed to take my cock in her arse. To which she said, ok. Now she had my full undivided attention. So I get straight down to business, fingers wedged in both holes, stretching her pussy and arse to the limit, prepping them ready for my bulb like helmet. I'd forgotten what a demon cock sucker this girl was. I mean real good, deep throat, hungry deep sucks. Fucking amazing. I'd also forgotten she was a talented arse licker too. If I thought she wasn't filthy enough last time, she certainly was today! Then I got on with the acid test. Anal. After the hole stretching my cock glided home like an arrow to a bullseye. It felt fucking amazing and Tina didn't half love it too (deep down they all do, most just can't admit it). Now as you can expect all the mass amounts of foreplay and her outstanding cock handling skills had done me in some-what. Don't get me wrong, I fucked the shit out of her, but there always comes a point where a man's fucking a hot girl and the need to blow his wad becomes uncontrollable. Luckily I was in Tina's arse when this happened, and blew the first few pumps up her arse and the rest all over it. Job well done. Time to head down the pub for a well deserved pint. Enjoy.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=f59vlsaed9vpv9kutxsf.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=f59vlsaed9vpv9kutxsf.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=8pmrpv0rajt3h8s6g1fd.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=8pmrpv0rajt3h8s6g1fd.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:7287d07e4cdcb491a368baa563600c3ec8aa9dd5","amp;dn":"%5BFakeAgentUK%5D+Tina+%281123+%2F+09.19.2014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7287d07e4cdcb491a368baa563600c3ec8aa9dd5","infoHashBuffer":{"type":"Buffer","data":[114,135,208,126,76,220,180,145,163,104,186,165,99,96,12,62,200,170,157,213]},"announce":[],"urlList":[]}}