{"title":"Nadifa Mohamed - Black Mamba Boy","uid":11779172,"size":258017664,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:733c95ee4a62597a086d4994e2dfe191e754dce0&amp;dn=Nadifa+Mohamed+-+Black+Mamba+Boy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":8,"time":1427483034,"description":"Mohamed's beautifully rendered debut, inspired by her father's life, opens in 1935 Aden, Yemen, where 11-year-old Jama and his mother subsist in precarious destitution: Jama spending his days on the streets with other &quot;market boys&quot; while his mother works long hours for little pay at a coffee factory. When his mother dies, Jama briefly returns to his family's home in Hargeisa before running away to search for his long-absent father, who he believes is in Sudan. His quest leads Jama into Italian-controlled Eritrea, where he joins Mussolini's Fascists in exchange for food and shelter, and Mohamed delivers graphic descriptions of the horrifically savage treatment the African askaris received at the hands of the Italians. After the Italians are deposed, Jama settles for a few years into village life, before his wanderings take him to Egypt. Jama is a charming protagonist whose peregrinations--assisted by clansmen, kind strangers, and ghostly visitations--are directed more by historical and biographical significance than by the demands of plot. Mohamed vividly recreates the complex atmosphere of the era, and her personal investment in the story gives it a passionate edge","torrent":{"xt":"urn:btih:733c95ee4a62597a086d4994e2dfe191e754dce0","amp;dn":"Nadifa+Mohamed+-+Black+Mamba+Boy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"733c95ee4a62597a086d4994e2dfe191e754dce0","infoHashBuffer":{"type":"Buffer","data":[115,60,149,238,74,98,89,122,8,109,73,148,226,223,225,145,231,84,220,224]},"announce":[],"urlList":[]}}