{"title":"The Anthony Cumia Show 2014-09-15","uid":11044598,"size":66355195,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:74327a43c3a962f511fad22af580a3c9a619ce8d&amp;dn=The+Anthony+Cumia+Show+2014-09-15&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1410931754,"description":"\nMonday, September 15, 2014\n\nAnthony starts Monday's show by letting us know that Georges St-Pierre has been rescheduled but fan favorite Gavin McInnes will still in fact be on the show. He jumps right into the Adrian Peterson story that has taken over the news, talks about the way punishment has changed over the years, and we see a clip of Charles Barkley and one of Cris Carter discussing this very topic. We learn about a new Urban Outfitters sweatshirt that is less than thoughtful and the ever helpful Mr. Cumia suggests a few more items that they may want to sell. Gavin joins Ant in studio to talk about his latest &quot;troubles&quot; and shares his views regarding them. They debate the word &quot;tranny,&quot; talk about the good ol' first amendment, the double standard when it comes to race rules, and Gavin tells us a story about looking into a &quot;cock mirror.&quot; They take a few phone calls, talk about Scotland wanting to be independent from England, then about a lovely gal who was forced to change her t-shirt in school, and end the show talking about past sexual conquests and how they feel about love.\n","torrent":{"xt":"urn:btih:74327a43c3a962f511fad22af580a3c9a619ce8d","amp;dn":"The+Anthony+Cumia+Show+2014-09-15","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74327a43c3a962f511fad22af580a3c9a619ce8d","infoHashBuffer":{"type":"Buffer","data":[116,50,122,67,195,169,98,245,17,250,210,42,245,128,163,201,166,25,206,141]},"announce":[],"urlList":[]}}