{"title":"Reeva - A Mother's Story - June Steenkamp","uid":11740363,"size":1617703,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:78ef51af33cfb1c0a944aeb76b0f85ae9b67d854&amp;dn=Reeva+-+A+Mother%27s+Story+-+June+Steenkamp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mohammad_AT","files":3,"time":1425767727,"description":"The tragic story of the girl at the heart of the most dramatic trial of the 21st Century.\n\nIn the early hours of Valentine's Day 2013, Olympic athlete Oscar Pistorius killed his girlfriend Reeva Steenkamp, shooting her multiple times while she cowered behind the locked door of their bathroom. His trial attracted more international media attention and public scrutiny than any since that of OJ Simpson.\n\nWhat went on behind the scenes though? And what was the real Reeva like, away from the photo shoots and the attention of the media? A beautiful 29 year old from Port Elizabeth, Reeva graduated as a lawyer and campaigned passionately for human rights causes before deciding to try the world of modelling and the party scene in South Africa's most vibrant city. Her relationship with international hero Oscar Pistorius seemed like a fairy tale of triumph over adversity - double amputee turned champion athlete meets small town girl with beauty and brains wanting to make her mark on the world. No one could have predicted the tragic and horrifying conclusion.\n\nReeva's mother, June Steenkamp, has kept a dignified silence in the face of public scrutiny, media intrusion, and of course, the bereavement she has endured. Until now, no one has truly known what she is feeling, or how she has coped since her youngest child, her &quot;darling daughter&quot; and &quot;late lamb&quot;, was shot dead. Powerful and unflinching, and revealing all the details of the sensational trial and its verdict, REEVA offers the only true insider's account of this heartbreaking tale","torrent":{"xt":"urn:btih:78ef51af33cfb1c0a944aeb76b0f85ae9b67d854","amp;dn":"Reeva+-+A+Mother%27s+Story+-+June+Steenkamp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78ef51af33cfb1c0a944aeb76b0f85ae9b67d854","infoHashBuffer":{"type":"Buffer","data":[120,239,81,175,51,207,177,192,169,68,174,183,107,15,133,174,155,103,216,84]},"announce":[],"urlList":[]}}