{"title":"The Anthony Cumia Show 2015-02-09 MP4 MP3 combo","uid":11692055,"size":260789836,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:7a7bbf9ada0c38c1394feb26f6318b791abea9be&amp;dn=The+Anthony+Cumia+Show+2015-02-09+MP4+MP3+combo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mothergoose58","files":2,"time":1423584100,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nGuest(s): Tom Green\n\nEpisode 107: We start a new TACS week with a recap of the Grammy's getting Ant's thoughts on the show, the artists, Obama's PSA, and Pharrell's need to do a &quot;hands up don't shoot&quot; during his performance. Ant then gets into what an unfunny cuntbag Andy Kindler is, we see Kindler's awful appearance on Letterman, chat about the &quot;Twitter war&quot; that's going on between them, and what a lapdog Joe DeRosa has become for Andy. We hear a clip that Jim Breuer sneak recorded and brought to Opie and Jimmy this morning, Tom Green calls to talk about his studio, getting back into stand-up, his AXS TV show, his plans for a web talk show, and the old MTV days. The guys also discuss how the internet has changed the way people prank, &quot;off-limit topics&quot; when it comes to comedy, how comedy translates in different countries, and we find out about Tom's upcoming shows. After a brief weather report for Boston, we go through Monday's mail, hear about Anthony's Blaze interview that will air February 18th at 10pm, Ant admits he's pretty into H1Z1, and the callers chime in to commiserate about the game. We watch a video of an elephant sitting wherever the fuck he wants, talk about Brian Williams temporarily stepping down, how Fifty Shades of Grey doesn't properly depict sadomasochism, and are treated to a few &quot;trampling&quot; videos.\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\n\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:7a7bbf9ada0c38c1394feb26f6318b791abea9be","amp;dn":"The+Anthony+Cumia+Show+2015-02-09+MP4+MP3+combo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a7bbf9ada0c38c1394feb26f6318b791abea9be","infoHashBuffer":{"type":"Buffer","data":[122,123,191,154,218,12,56,193,57,79,235,38,246,49,139,121,26,190,169,190]},"announce":[],"urlList":[]}}