{"title":"Alien DDK Cuts","uid":11021568,"size":50649319508,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:88d969d9273c253a026f17bc947396bed147f3a8&amp;dn=Alien+DDK+Cuts&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":6,"uploader":"bbqwoa","files":4,"time":1410591944,"description":"The DDK Fan edits of the Alien series are a labour of love.\n\nCreated primarily for personal enjoyment, they are the versions of these great movies I always wanted.\n\nA mixture of Theatrical, Special Edition/Assembly, and Unused material, the DDK cuts represent the versions of these wonderful films that I feel represent the best possible representations of each film.\n\nEach have have numerous additions, removals, tweaks, colour corrections, musical changes, editing re-arrangements and minor special effects changes.\n\nAlien is mostly made up of the Theatrical cut of the film, with some scenes from the Director's Cut/re-release swapped in.\n\nAliens has some significant changes. \nMostly comprised of the Extended cut, the film is presented in a 2.35:1 aspect ratio to match the other three films. \nAliens has been heavily colour corrected to provide a deeper, inkier image, deeper blacks, stronger colour saturation, while retaining the original, grainy master.\nAliens has some re-arrangements in terms of editing during the fight with the Queen to fix continuity errors with the placement of the Power-loader hands, and the original, unused climax music has been used instead of the re-used action queue from just a scene earlier in the film.\n\nAlien3 is essentially a 50/50 mix of Theatrical and Assembly cut. \nSignificant colour-correction, music/sound mixing and post-processing has been done to clean up (as best as possible) the puppet shots in the film.\nThe only CGI shot in the film (the Dragon's head cracking) has been removed.\nPulse rifles have been tweaked to sound as they should.\nThe Dog is the host for the dragon.\nThe Queen emerges from Ripley during her suicide.\n\nAlien Resurrection is mostly comprised of the Extended cut, but retains the beautiful, Theatrical opening credits, and end scene.\n\nThese cuts are in Stereo, and I recommend watching them using Dolby Digital if you have a surround sound system.\n\nIt goes without saying but make sure you have full 0-255 RGB on your display.\n\nYou must own legal copies of the Alien Bluray series to enjoy these fan edits.\nThese fan edits are produced and distributed under the Creative Commons License and are not for profit in any way.","torrent":{"xt":"urn:btih:88d969d9273c253a026f17bc947396bed147f3a8","amp;dn":"Alien+DDK+Cuts","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88d969d9273c253a026f17bc947396bed147f3a8","infoHashBuffer":{"type":"Buffer","data":[136,217,105,217,39,60,37,58,2,111,23,188,148,115,150,190,209,71,243,168]},"announce":[],"urlList":[]}}