{"title":"#rekt alpha build 496","uid":11055412,"size":202738763,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:91cd3cce7b260fededa4ccee6aae7eb616f16045&amp;dn=%23rekt+alpha+build+496&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"HLG-Doc","files":1,"time":1411098426,"description":"The time has come! Hella Legit Games has unleashed the second alpha release of #rekt! We hope you guys enjoy it as much as we do.\n\nFor instructions about how to download the game and get started go to http://hellalegitgames.com/rekt-how-to-get-started/.\n\nBe sure to check out the screenshot gallery at hellalegitgames.com and give us your feedback on the official reddit page /r/rektgame!\n\nMajor Changes in This Version:    \n*Engine version updated from Unreal Engine 4.2 to 4.4\n\n*Rail Gun now uses Energy (same source as Gravity Belt) instead of ammo. Up to half of full energy is used per shot. Less energy available means less damage per shot\n\n*Ammo recharge system has been replaced with magazine reload system Weapon switch times are now equal across all weapons Ammo counts and damage values for each gun have been adjusted \n\n*Wall-Jump now properly adds to player speed\n\n*Wall-Jumps can now be chained together by holding the jump key. You must press the jump key for the first wall-jump in a sequence\n\n*Increased the amount of air control\n\n*Bunny Hopping (Holding the move forward key along with jump simultaneously) causes the player to accelerate up to twice the base run speed. Quake-like strafe jumping system untouched\n        \n*New Map! In-Game working title is Past \nMuch improved lighting (all graphics still a work in progress)\n\n*Graphics options menu - Full array of video options. Some options require a game restart to take effect\n   \n*Audio menu - Audio volume slider allows adjustment of master volume without tweaking configuration files\n\n*Gameplay menu - Adjust mouse sensitivity, invert mouse, adjust FOV and set player name\n*\nFully rebind-able controls!\n\n*Fully re-worked Menus and HUD using UE4s new UMG system. Some HUD elements and menu buttons are better than others. Work in Progress\n    \n*New sounds for health pickup and weapon projectiles hitting the environment and picking up ammo. Temporary work in progress assets to replace stock UE4 sound assets.\n\nKnown Issues:\n\n*The mouse may lose focus during play. To fix this, open the in game menu (default ESC) and then click the Back to Game button.\n \n*Resolution incorrectly displays as 640x480\n\n*After entering an IP address into the Join By IP text box you have to press the Enter key for the IP address to be entered\n\n\n*Spectator Mode - Cannot leave first person spectator camera until spectated player dies. No name tags","torrent":{"xt":"urn:btih:91cd3cce7b260fededa4ccee6aae7eb616f16045","amp;dn":"%23rekt+alpha+build+496","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91cd3cce7b260fededa4ccee6aae7eb616f16045","infoHashBuffer":{"type":"Buffer","data":[145,205,60,206,123,38,15,237,237,164,204,238,106,174,126,182,22,241,96,69]},"announce":[],"urlList":[]}}