{"title":"Random DNA Ass Fucking In Thailand Heaven","uid":11654912,"size":805256846,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:94d295a2dc598475c1d55127e192e654dffad477&amp;dn=Random+DNA+Ass+Fucking+In+Thailand+Heaven&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sarah.jensen","files":-1,"time":1417921355,"description":"Super fit small tittied Jem knocked on my door, begged me to fuck her, specifically in her ass, and asked me to ejaculate in her mouth, all while chained up on the coffee table. Then she left, wearing the same skin tight leggings, no doubt ready to knock on some other door. That is what she does, she drifts through apartment blocks and hotels, from door to door plying her orifices and receiving sperm. She never sees daylight. Just bedrooms, corridors and elevators. Never sleeps. Merely lives in a haze of sexual stimulation, oral and anal. She has to receive sperm in all three holes if she is likely to return to the same room. Jem sees life in terms of rooms, and cannot remember the face of even a single guy who has fucked her. She does not care about the face, she is interested in the penis and its effect upon her. She probably holds the world record for random DNA ingested and implanted. Her rectum, bowels and small intestine contain gallons of sperm, constantly refreshed with new genetic code. Refreshed, that is how Jem feels from anal sex. Ass fucking in hotel rooms. Life, heaven and sperm. If you have not fucked Jem, you are one of the few. Slide your cock up any one of her holes, and you will know she is just for you. For you and no one else. At least till she leaves. Jem's small, firm, hairless and light skinned buttocks open and close as often as apartment doors. Lick the video","torrent":{"xt":"urn:btih:94d295a2dc598475c1d55127e192e654dffad477","amp;dn":"Random+DNA+Ass+Fucking+In+Thailand+Heaven","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94d295a2dc598475c1d55127e192e654dffad477","infoHashBuffer":{"type":"Buffer","data":[148,210,149,162,220,89,132,117,193,213,81,39,225,146,230,84,223,250,212,119]},"announce":[],"urlList":[]}}