{"title":"Antinatalism: Rejectionist Philosophy From Buddhism To Benatar (","uid":11027621,"size":1735905,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:98f5c0f033cab485a459e001f7a06cac4cca2089&amp;dn=Antinatalism%3A+Rejectionist+Philosophy+From+Buddhism+To+Benatar+%28&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"AreciboMessage","files":3,"time":1410674400,"description":"The last few decades seem to have begun what has been called 'the childless revolution'. In developed countries, increasingly people are choosing not to have children. The causes of this 'revolution' are many including the belief that to create a new life is to subject someone unnecessarily, and without their consent, to life's many sufferings including death. This belief and its underlying philosophy is known as anti-natalism. There has been a recent resurgence of this philosophy, with David Benatar's book Better Never To Have Been (2006) as a major catalyst. Anti-natalism can be seen as part of a broader philosophy, described here as Rejectionism, which finds existence -directly or indirectly, i.e. as procreation - as deeply problematic and unacceptable.\n\nThe book traces the development of this philosophy from its ancient religious roots in Hinduism (Moksha) and Buddhism (Nirvana) to its most modern articulation by the South African philosopher David Benatar. It examines the contribution to rejectionist thought by Schopenhauer and von Hartmann in the 19th century and Zapffe, a little known Norwegian thinker, in the 20th century, and most recently by Benatar. Benatar and Zapffe represent this approach most clearly as anti-natalism. The book also devotes a chapter to the literary expression of rejectionist philosophy in the works of Samuel Beckett and J.P.Sartre. In sum, far from being an esoteric doctrine rejectionism has been a major presence in human history straddling all three major cultural forms - religious, philosophical and literary.\n\nThe book argues that anti-natal philosophy and its practice owe a great deal to three major developments: secularization, liberalization of social attitudes, and technological advances (contraception). Anti-natal attitudes and practice should therefore be seen as a part of 'progress' in that these developments are widening our choice of lifestyles and attitudes to existence. In sum, The book argues that anti-natalism needs to be taken seriously and considered as a legitimate view of a modern, secular civilization. Secondly, the book seeks to situate current anti-natalist thought in its historical and philosophical perspective. Finally, it argues that in order to develop anti-natalism further it needs to be institutionalized as a form rational 'philosophy of life', and more attention needs to be paid to the problems and prospect of putting this philosophy into practice.\n\nAuthor Bio: The author is a social scientist. After receiving a Ph.D degree from the University of London he has been a university professor. This book is a result of his long-standing interest in issues of existence and existential philosophy.\n","torrent":{"xt":"urn:btih:98f5c0f033cab485a459e001f7a06cac4cca2089","amp;dn":"Antinatalism%3A+Rejectionist+Philosophy+From+Buddhism+To+Benatar+%28","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98f5c0f033cab485a459e001f7a06cac4cca2089","infoHashBuffer":{"type":"Buffer","data":[152,245,192,240,51,202,180,133,164,89,224,1,247,160,108,172,76,202,32,137]},"announce":[],"urlList":[]}}