{"title":"Exhumed - Gore Metal - A Necrospective (2015)","uid":11685198,"size":114616367,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9bae2fdb6cd4d54fc1b460fc77d448a90bf3975b&amp;dn=Exhumed+-+Gore+Metal+-+A+Necrospective+%282015%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"analogkid6103","files":12,"time":1423288697,"description":"\nINFO:\n\nExhumed is an American death metal band from San Jose, California, most recently signed to Relapse Records. They were formed in 1990, when sole remaining founding member Matt Harvey was at the age of 15. Exhumed spent much of the ensuing decade hacking its way through numerous demos, split CDs, and EPs. The band finally recorded their debut album, the genre-(re)defining and critic-repulsing &quot;Gore Metal&quot; in 1998. The album crystallized the old-school Death Metal meets full-on Grindcore sound forged during the recordings of their last demo and first split CD (&quot;Horrific Expulsion of Gore&quot; and &quot;In the Name of Gore&quot; .\n\nThis led to the band's first US tour and festival appearances (their only previous out of California shows had been 9 dates in central Europe in 1997 supporting &quot;In the Name of Gore&quot; . The band continued to morph line-ups with the release of the back-to-basics second record &quot;Slaughtercult&quot; in 2001. The album blatantly blended the band's brutal cult-thrash influences into its sonic meat-grinder. This album allowed the band to do three US tours, and their first proper European tour, including co-headlining festivals like Fuck the Commerce and Obscene Extreme. The band also appeared at the Wacken Open Air festival.\n\nThe band evolved further with their third album, 2003's &quot;Anatomy is Destiny&quot; which added more sophisticated arrangements, production and instrumentation into the Gore Metal formula. Bassist Leon del Muerte replaced Bud Burke soon after the album was recorded.\n\nAfter the departure of the band's co-founder, drummer Col Jones, the band issued a massive 2CD compilation of their early recordings, appropriately dubbed &quot;Platters of Splatter&quot;.\n\nAfter touring all over America, Canada, Europe, Japan, Australia and even Iceland, the band realigned its personnel yet again, resulting in the departure of long-time guitarist Mike Beams and the recruitment of new six-stringer Wes Caley and drummer Matt Connell. The &quot;new and improved&quot; Exhumed has completed recording an album of cover songs entitled &quot;Garbage Daze Re-Regurgitated&quot;.\n\nThe band filmed a DVDs worth of material and then afterwards went on indefinite hiatus in 2005.\n\nIn 2010 the band reunited to start work on a new album. The line up is Matt Harvey on guitars and vocals, Leon DelMuerte on bass and vocals, Wes Caley on guitar and Danny Walker on drums.\n\nBANDMEMBERS:\n\nBud Burke - lead guitar, vocals\nMatt &quot;Slime&quot; Ferri - bass, vocals\nMatt Harvey - vocals, guitar\nMike Hamilton - drums\n\nTRACKLIST:\n\n01. Necromaniac\n02. Open The Abscess\n03. Postmortem Procedures\n04. Limb From Limb\n05. Enucleation\n06. Casketkrusher\n07. Deathmask\n08. In My Human Slaughterhouse\n09. Sepulchral Slaughter\n10. Vagitarian 2\n11. Blazing Corpse\n12. Deadest Of The Dead\n\n\nGenre:\tDeath\nSubgenre:\tBrutal Death Metal / Goregrind / Grindcore\nBitrate:\t320 k\nSize:\t109.31 MB\nShow/Hide Files: \t\n12 files","torrent":{"xt":"urn:btih:9bae2fdb6cd4d54fc1b460fc77d448a90bf3975b","amp;dn":"Exhumed+-+Gore+Metal+-+A+Necrospective+%282015%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9bae2fdb6cd4d54fc1b460fc77d448a90bf3975b","infoHashBuffer":{"type":"Buffer","data":[155,174,47,219,108,212,213,79,193,180,96,252,119,212,72,169,11,243,151,91]},"announce":[],"urlList":[]}}