{"title":"Blake_Mills-Heigh_Ho-CD-FLAC-2014-FORSAKEN","uid":11056058,"size":278087163,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9c1a32dcd30146fd1075c745ec6bff23b13801d9&amp;dn=Blake_Mills-Heigh_Ho-CD-FLAC-2014-FORSAKEN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SaRGN","files":16,"time":1411111705,"description":"FORSAKEN Proudly Presents\nArtist : Blake Mills\nAlbum : Heigh Ho\nLabel : Verve\nGenre : Rock\nSource : CD\nStreet Date : 2014-00-00\nQuality : 720 kbps / 44.1kHz / 2 channels\nEncoder : FLAC 1.2.1\nSize : 277.37 MB\n\n\nRecorded in Los Angeles at the legendary Ocean Way studios in a\nroom built for Frank Sinatra &amp; used by everyone from Bob Dylan to\nRay Charles, Mills created an album that references a range of\ngenres without really belonging to any To that end, Mills asked several of his musical heroes including Jim Keltner, Don Was, Jon Brion, Benmont Tench, Mike\nElizondo, and Fiona Apple who duets on the slow-burning &quot;Seven\nand timeless sounding &quot;Don t Tell Our Friends About Me&quot;) to\ncollaborate on what would become Heigh Ho. &quot;Blake arranged the\nmusic the way that Czanne would've filled a canvas,&quot; Don Was\nnotes of his experience playing in Blake s band. &quot;He s a\nmind-blowingly great artist with the type of deep vision that is\nthe hallmark of true genius. It's so inspiring for musicians to\nplay with a cat like that! If he asked us to play in orange, we\nwanted to give him a shade that burned so brightly as to blind\nthe unsuspecting\n\nDifferent songs feature slightly different bands, said Mills\nThese guys are world class musicians, and also some world class\nrecord producers. That combination produced something rare; a\nwide open way of playing that consistently delivers the spirit of\na song. It reflects the spontaneity, maturity, and tastefulness\nof my all-time favorite records\nSince quietly making his debut album, Break Mirrors, which\ncritics hailed as one of the best albums of 2010, Mills has been\nconsistently busy. He s producing the highly anticipated\nsophomore album for The Alabama Shakes, and has worked as a\nproducer with a wide variety of artists, including ZZ Top's Billy\nGibbons, Sara Watkins, Conor Oberst, Sky Ferreira, and Fiona\nApple, with whom he toured extensively in 2013 and 2014. As a\nsession player and sideman he has worked with Beck, Cass McCombs\nJackson Brown, Lucinda Williams, Moses Sumney and Neil Diamond\namong others. Rick Rubin and T Bone Burnett frequently call upon\nhis services as a guitarist, and equally enamored is Eric Clapton\nwho recently told Rolling Stone magazine &quot;Blake Mills is the last\nguitarist I heard that I thought was phenomenal\n\n\nPlease Keep it For Continue Seeding and Help Others To Get Download","torrent":{"xt":"urn:btih:9c1a32dcd30146fd1075c745ec6bff23b13801d9","amp;dn":"Blake_Mills-Heigh_Ho-CD-FLAC-2014-FORSAKEN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c1a32dcd30146fd1075c745ec6bff23b13801d9","infoHashBuffer":{"type":"Buffer","data":[156,26,50,220,211,1,70,253,16,117,199,69,236,107,255,35,177,56,1,217]},"announce":[],"urlList":[]}}