{"title":"[PC]Aion Online.iso","uid":10923034,"size":1203982336,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:9e41ea35e01049b4dfc22f1f973d32a8cda1b728&amp;dn=%5BPC%5DAion+Online.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"nnenne1u","files":-1,"time":1409347645,"description":"Aion is an MMO that tries to offer something for everyone and succeeds at it, albeit in varying degrees and at different stages. On the surface, you'll find a visually stunning world to adventure in and explore, and this will initially draw the casual PvE gamer. Underneath the pretty wrapping is a familiar layer of elements that MMO gamers have come to expect - questing, skills, crafting, economy, socialization tools - in a highly polished state. At its core both literally and figuratively, is a faction PvP battleground called the Abyss, where gameplay involves Aion's most distinctive feature, the players' ability to fight while flying around on wings. Yet players can only enter the Abyss after they reach level 25 and prior to that, there is hardly any PvP except for suicidal forays into enemy territory. Endgame on the other hand, is focused on PvP, which could be a disappointment for those who don't enjoy it unless more content is introduced by the time they get there. As it is, even before they reach level 20, players may encounter gaps that need to be breached by doing repeatable quests, which indicates a lack of appropriate level content.","torrent":{"xt":"urn:btih:9e41ea35e01049b4dfc22f1f973d32a8cda1b728","amp;dn":"%5BPC%5DAion+Online.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e41ea35e01049b4dfc22f1f973d32a8cda1b728","infoHashBuffer":{"type":"Buffer","data":[158,65,234,53,224,16,73,180,223,194,47,31,151,61,50,168,205,161,183,40]},"announce":[],"urlList":[]}}