{"title":"The White Cliffs of Dover (1944) Untouched DVD5 - Irene Dunne, A","uid":11055480,"size":4425204342,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:9e6ca3977a6e28affab6749c395e2404ce702cf7&amp;dn=The+White+Cliffs+of+Dover+%281944%29+Untouched+DVD5+-+Irene+Dunne%2C+A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SaM","files":-1,"time":1411100444,"description":"The White Cliffs of Dover (1944) Untouched DVD5 - Irene Dunne, Alan Marshall [DDR]\n\nThe White Cliffs of Dover is a 1944 film made by Loew's and MGM. It was directed by Clarence Brown and produced by Clarence Brown and Sidney Franklin. The screenplay was by Claudine West, Jan Lustig and George Froeschel, based on the Alice Duer Miller poem titled The White Cliffs with the credit of additional poetry by Robert Nathan. Nathan stated in an interview that he wrote the screenplay in his first work as a contract writer for MGM but the studio credited Claudine West who died in 1943 as a tribute to her.[3]The role of Betsy was shared. Betsy as a little girl at age 10 was played by Elizabeth Taylor and Betsy as a young woman was played by June Lockhart.\n\n\n    CAST:-\n    Irene Dunne as Susan Ashwood\n    Alan Marshal as Sir John Ashwood\n    Roddy McDowall as John Ashwood II as a Boy\n    Frank Morgan as Hiram Porter Dunn\n    Van Johnson as Sam Bennett\n    C. Aubrey Smith as Colonel Walter Forsythe\n    Dame May Whitty as Nanny\n    Gladys Cooper as Lady Jean Ashwood\n    Peter Lawford as John Ashwood II as a Young Man\n    John Warburton as Reggie Ashwood\n    Jill Esmond as Rosamund\n    Brenda Forbes as Gwennie\n    Norma Varden as Mrs. Bland\n    Elizabeth Taylor as Betsy Kenney at Age 10\n    Ian Wolfe as Skipper of Honeymoon Boat\n\nDirected by Clarence Brown\nProduced by Clarence Brown, Sidney Franklin\nMusic by Herbert Stothart\nRunning time 126 min.\n\nMOVIE PLOT:- The White Cliffs of Dover (1944)\nAmerican newspaper publisher Hiram P. Dunn and his daughter Susan visit Britain, intending to stay a week. She meets and falls in love with an army officer, Sir John Ashwood. The honeymoon is cut short as the First World War breaks out. John goes to war in France, sees his bride only once more, and is then killed in action near the end of the war. In the meantime, Lady Susan gives birth to a son, also named John (although the eldest son has always traditionally been named Percy), who never knew his father.\n\nSusan and John continue to live in the family manor house with Lady Jean, Sir John's Mother. After she dies, they decide to sell the manor and return to America, but young John is in love with Betsy Kenney (Elizabeth Taylor), the daughter of tenant farmers on the estate. They decide to stay after all.\n\nAs the Second World War begins, John, after Eton and Sandhurst, joins his father's regiment. Betsy becomes a WREN and Susan becomes a nurse. John is badly wounded on the Dieppe Raid and is brought to the hospital where Susan is now a nursing sister. As American troops march through London, Susan gazes proudly at them and John slips quietly away.\n\nA scene in the film approximating the early '30s shows adolescent German boys, part of an exchange programme, visiting the British family's country estate. Insinuating they were part of early Nazi invasion plans, the film has the boys let it slip in conversation that they are contemplating how the estate's large lawns would be ideal for troop gliders to land on.\n\nAccording to MGM records the film was a big hit and earned $6,294,000 at the box office resulting in a profit of $1,784,000.\nThe film was nominated for an Academy Award for Best Cinematography in Black and White.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 4014 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 29.970\nAudio Codec:  AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: English\nRunTime 126 mins\nSubtitles: None\nRipped by: Trinidad [DDR]","torrent":{"xt":"urn:btih:9e6ca3977a6e28affab6749c395e2404ce702cf7","amp;dn":"The+White+Cliffs+of+Dover+%281944%29+Untouched+DVD5+-+Irene+Dunne%2C+A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e6ca3977a6e28affab6749c395e2404ce702cf7","infoHashBuffer":{"type":"Buffer","data":[158,108,163,151,122,110,40,175,250,182,116,156,57,94,36,4,206,112,44,247]},"announce":[],"urlList":[]}}