{"title":"Crochet for Bears to Wear - More than 20 Perfect Projects for Yo","uid":11049637,"size":25451602,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a2e5318a6c4905649a8867be11051216dc0b90bf&amp;dn=Crochet+for+Bears+to+Wear+-+More+than+20+Perfect+Projects+for+Yo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"KnitLady","files":-1,"time":1411002520,"description":"Whatï¿½s cuter than a teddy bear in a sweater?ï¿½ A teddy bear wearing a custom-crocheted sweater made just for him! With Amy Oï¿½Neill Houckï¿½s simple instructions and lovable, huggable patterns, crocheters of allskill levels can create fashions for their teddies and friends, including Build-A-BearWorkshop bears, Vermont Teddy Bear Company bears, and American Girl dolls. InCrochet for Bears to Wear, youï¿½ll find more than twenty quick-to-crochet garmentsand accessoriesï¿½from sweaters and swimsuits to pajamas, sundresses, and even abaseball uniform just perfect for spring training.The patterns provide a fun introduction to a range of techniques and garmentconstructions such as seamless top-down crochet, crocheted ribbing, unusual startsand finishes to garments, lace, colorwork, Aran crochet, and so much more. Withinstructions on how to customize each pattern to fi t your own collection of soft toys,Crochet for Bears to Wear provides everything a crocheter needs to know to keep herfavorite friends covered from tip-top to toe.","torrent":{"xt":"urn:btih:a2e5318a6c4905649a8867be11051216dc0b90bf","amp;dn":"Crochet+for+Bears+to+Wear+-+More+than+20+Perfect+Projects+for+Yo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2e5318a6c4905649a8867be11051216dc0b90bf","infoHashBuffer":{"type":"Buffer","data":[162,229,49,138,108,73,5,100,154,136,103,190,17,5,18,22,220,11,144,191]},"announce":[],"urlList":[]}}