{"title":"The Anthony Cumia Show 2015-02-04 MP4 MP3 combo","uid":11682465,"size":303315148,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:a53ed7e39456751d189c5105f82c2f42b0c07115&amp;dn=The+Anthony+Cumia+Show+2015-02-04+MP4+MP3+combo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mothergoose58","files":2,"time":1423162641,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nGuest(s): Joe List\n\nEpisode 105: We begin the show with a clip from the movie &quot;God Bless America&quot;, Anthony then discusses how technology will be our ultimate demise, expresses disgust with the picture of the Jordanian pilot being burned alive in newspapers, and talks about passing the point of no return with internet videos. Ant doesn't give a fuck that his Twitter was hacked, the hacker (who sounds a lot like Chip Chipperson) calls in to explain why he hacks, and after seeing a clip from Space Balls, Ant and Rat disagree over how great that movie was. We talk white privilege and the news story about Conrad Hilton's arrest, see (part of) Paris Hilton's new titties, take a look at that monster Jocelyn Wildenstein, Ant gets a partial explanation about last night's weird tweets from @Jritthouse, and covers how the excess of cameras have disproved and exposed a lot of things. We watch a dashcam video of a plane crash in Taiwan, one of a 747 cargo plane, see a couple of dashcam scams, and Ant tells us about an episode of Columbo that would never fly these days. Joe List joins the show to talk about his Letterman appearance, drinking and anxiety, movie theater stress, documentaries, and people's obsession with taking useless pictures and videos. The guys also chat about the executions in Jordan, a former high school coach getting twenty years for hidden camera videos, Bruce Jenner &quot;transitioning&quot;, being labeled politically, transgender news reporter Zoey Tur, how being trans effects families, forcing religion, and Joe impresses us with football stats. They get into the latest Suge Knight news, randomly talk about Vanilla Ice, agree that Valentine's Day is lame, and wrap up talking about the ease (or lack thereof) of relationships.\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\n\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:a53ed7e39456751d189c5105f82c2f42b0c07115","amp;dn":"The+Anthony+Cumia+Show+2015-02-04+MP4+MP3+combo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a53ed7e39456751d189c5105f82c2f42b0c07115","infoHashBuffer":{"type":"Buffer","data":[165,62,215,227,148,86,117,29,24,156,81,5,248,44,47,66,176,192,113,21]},"announce":[],"urlList":[]}}