{"title":"Now Is the Hour by Tom Spanbauer (retail) {dwg}","uid":11049301,"size":3673327,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ab0f10900f36d02a99c65c450b0b5d7e6d7b53d3&amp;dn=Now+Is+the+Hour+by+Tom+Spanbauer+%28retail%29+%7Bdwg%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"gratefuldawg77","files":6,"time":1410997292,"description":"The year is 1967, and Rigby John Klusener, seventeen years old and finally leaving his home and family in Pocatello, Idaho, is on the highway with his thumb out and a flower behind his ear, headed for San Francisco. Now Is the Hour is the wondrous story of how Rigby John got to this point. It traces his gradual emancipation from the repressions of a strictly religious farming family and from the small-minded, bigoted community in which he has grown up during a time of explosive cultural change. Transforming this familiar journey from American Graffiti to On the Road into something rich and strange and hilarious is the persona of Rigby John himself. Intimately in touch with his fears, hesitantly awakening to his own sexuality, and palpably open to life's mysteries, Rigby John is a protagonist whom readers will fall in love with, root for, and be moved by.\n\nNow Is the Hour is a powerful, vastly entertaining story of self-awakening, of the complex bonds of family, and ultimately of America during a period of tremendous upheaval.","torrent":{"xt":"urn:btih:ab0f10900f36d02a99c65c450b0b5d7e6d7b53d3","amp;dn":"Now+Is+the+Hour+by+Tom+Spanbauer+%28retail%29+%7Bdwg%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab0f10900f36d02a99c65c450b0b5d7e6d7b53d3","infoHashBuffer":{"type":"Buffer","data":[171,15,16,144,15,54,208,42,153,198,92,69,11,11,93,126,109,123,83,211]},"announce":[],"urlList":[]}}