{"title":"Hell Is For Real - Gray Frazier","uid":11773219,"size":32309941,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:adc536a7ee95712bf56cb42a28bced2ad1c97a86&amp;dn=Hell+Is+For+Real+-+Gray+Frazier&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"starxteel","files":1,"time":1427158380,"description":"\nAccording to the results of recent surveys, Americans overwhelmingly believe that HEAVEN exists, though a much smaller number believe that HELL exists, with only one-tenth of one percent believing they will go there when they die. Gary Frazier helps readers:\n\nDiscern what beliefs are based on fact or fiction\nDiscover the truth in the midst of so much deception\nUnderstand the depth of scripture that speaks of HELL more than HEAVEN.\n\nHell is for Real is a clear search for truth, and truth matters for the simple reason that we all have a divine appointment with death. What if those who do not believe in HELL die one day and find they made a tragic and eternal mistake? Where do we turn for real answers? Should we look to movies, television, and stories of personal experiences, psychics, or religion?\n\nCemeteries and mausoleums dot the landscape of America as evidence and reminders of the sad reality of death. The good news is there is a source of hope that provides answers for each and every one who cares to seek the truth. Join the search and choose wisely because, eternity is too long to be wrong and Hell is for Real.\n\n\nAbout the author:\nGary Frazier is the founder and President of Discovery Missions. He is a respected speaker and writer on the subject of Bible prophecy and current events, has appeared on numerous documentaries, the History Channel, and national radio programs. Authoring numerous books, he is a contributor to the Tim LaHaye Prophecy Study Bible, The Popular Encyclopedia of Bible Prophecy, and travels nationally speaking in many of America?s largest churches. He has degrees from Criswell College, Southwestern Seminary and Louisiana Baptist University, his Doctor of Humanities degree from Liberty University and Doctor of Divinity from International Seminary in Plymouth, FL","torrent":{"xt":"urn:btih:adc536a7ee95712bf56cb42a28bced2ad1c97a86","amp;dn":"Hell+Is+For+Real+-+Gray+Frazier","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"adc536a7ee95712bf56cb42a28bced2ad1c97a86","infoHashBuffer":{"type":"Buffer","data":[173,197,54,167,238,149,113,43,245,108,180,42,40,188,237,42,209,201,122,134]},"announce":[],"urlList":[]}}