{"title":"Smugglers Run 1 &amp; 2 [NTSC] PS2","uid":11051176,"size":2485939754,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:ae4efe0a432b3a701967ad521df4a68bcc1faa62&amp;dn=Smugglers+Run+1+%26amp%3B+2+%5BNTSC%5D+PS2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Big_dude","files":-1,"time":1411035522,"description":"Smugglers Run 1 &amp; 2 for the PS2                         Rel. 10/25/2000, 10/31/2001\n\n\nFormat:        CD-R/DVD5 NTSC-USA\nLang.:         English\nDiscs:         3\nImage:         CCD/SUB/IMG, ISO\nTheme:         Action Racing, Driving\nRating:        Teen\nRequirements:  Modded/Chipped Ps2 or Swap Magic Disc Method. \n\n\nCompressed with 7Zip, both games were tested and work.\n\n\nNote: No Ps2 backup disc/game or copy will work unless your Ps2 Console is Modded \n      (allows playing of backups), or if you use Swap Magic. You can also try\n      Soft Modding to load the game using fmcb with esr.  (Some ps2 games may\n      not work with fmcb/esr).\n\n\n\nRelease Notes: Contains both ps2 games smugglers run 1 and 2. Smugglers run 1 is in\n               original cd-r image, and also a rebuild dvd version so you can use\n               fmcb/esr if you need to run it. Smugglers run 2 is standard dvd.\n\n\n\n\nGame Description:\n\nSmugglers Run -\n\nJust as the title of the game suggests, you play a smuggler. A smuggler who is carrying either illegal weapons or contraband drugs or a few other kinds of material. Since you have these illegal things in your possession, you are a prime target. A target by law enforcement, a target by rival smugglers and gang, a target by more militaristic forces of the United States.\n\nIf you can survive the high speed chases, the off-road evasion, the gunfire and the dust... you stand to make quite a profit. Maybe enough to outfit your vehicle for your next smuggling endeavor. Something that will make the next run a little less hazardous.\n\nAltogether there are over 30 missions inside of 3 distinct and vast environments. Vast in the full sense of the word, in that you can drive literally anywhere with the game's areas... and get lost doing it too. This style of gameplay is a staple of the Smuggler's Run series and Grand Theft Auto 3 or Vice City.\n\n\nFeatures:\n\n* Drive, evade and explore anywhere across 3 vast levels - rocky mountain forest, \n  arid desert and icy tundra.\n\n* Rival gangs will attempt to steal your stash as you move high value contraband \n  across international borders.\n\n* Test you skill and nerve by driving several fast off-road vehicles. \n  Game Pics Included.\n\n-----------------------------------------------------------------------------------\n\nSmugglers Run 2 -\n\nThe highly anticipated sequel to Smuggler's Run, Smuggler's Run 2: Hostile Territory plunges even further into the illicit and treacherous world of smuggling. Already known for incredible landscapes and realistic physics, Smuggler's Run 2: Hostile Territory now sends you on a mission that is deeper, darker and much more dangerous.\n\n\nFeatures:\n\n* Huge environments - featuring 2 immense new international maps: Afghanistan \n  and Vietnam, complete with palatial temples, ancient ruins, prosperous fishing \n  towns and small bombed out villages. \n\n* Over 30 daring missions \n\n* Fully interactive environments full of hazards including minefields, crossfire, \n  and avalanches that raise the stakes, adding fuel to the fire. \n\n* New, additional vehicles including quad bikes and tank-line military vehicles.\n  All Vehicles take damage and parts fly off during collisions with interactive\n  obstacles. \n\n* Varying weather conditions (including rain, snow, fog and sandstorms) affect\n  missions and vehicle handling. \n\n* Fully immersive storyline with full motion video cut scenes, integrating  \n  gameplay goals with a detailed, cohesive plot.\n\n\n\n- How To Burn Games -\n\nBurn Smugglers Run 1 The CD-Rom version with Alcohol 120%\n\nSet datatype to playstation 2 and write method (Raw/Dao) \n\nBurn at 8x or 4x Speed.\n\n\nBurn Smugglers Run 2 with DVD Decrypter or Imgburn\n\nBurn at 8x or 4x Speed.\n\n\nUse Verbatim or Taiyo Yuden CD/DVD Media for best quality, or if other media isn't \nworking.\n\n\nIf Using DVD+R booktype to DVD-ROM.\n(If your Mod-Chip or Ps2 doesn't support DVD+R)\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Support This Torrent, Seed and Enjoy!","torrent":{"xt":"urn:btih:ae4efe0a432b3a701967ad521df4a68bcc1faa62","amp;dn":"Smugglers+Run+1+%26amp%3B+2+%5BNTSC%5D+PS2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae4efe0a432b3a701967ad521df4a68bcc1faa62","infoHashBuffer":{"type":"Buffer","data":[174,78,254,10,67,43,58,112,25,103,173,82,29,244,166,139,204,31,170,98]},"announce":[],"urlList":[]}}