{"title":"Cry Danger (1951) Xvid 1cd - Dick Powell, Rhonda Fleming [DDR]","uid":11011451,"size":733905189,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:aecef2aceea4fe5e8621e4af80be559d833b134c&amp;dn=Cry+Danger+%281951%29+Xvid+1cd+-+Dick+Powell%2C+Rhonda+Fleming+%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SaM","files":-1,"time":1410365590,"description":"Cry Danger (1951) Xvid 1cd - Dick Powell, Rhonda Fleming [DDR]\n\nCry Danger is a 1951 film noir thriller shot in twenty-two days in Los Angeles. The film was directed by Robert Parrish, a former child star and later editor in his debut as a director.\n\n    CAST:-\n    Dick Powell as Rocky Mulloy\n    Rhonda Fleming as Nancy Morgan\n    Richard Erdman as Delong\n    William Conrad as Louie Castro\n    Regis Toomey as Detective Lt. Gus Cobb\n    Jean Porter as Darlene LaVonne\n    Jay Adler as Williams, Trailer Park Manager\n    Joan Banks as Alice Fletcher\n    Hy Averback as Harry, Bookie\n\nDirected by Robert Parrish\nProduced by W.R. Frank\nMusic by Paul Dunlap\nRunning time 79 minutes\n\nMOVIE PLOT:- Cry Danger (1951)\nRocky Mulloy was sentenced to life in prison for a robbery and murder that he didn't commit. He's released five years later when a witness named Delong appears and provides an alibi. Rocky then sets out to find who framed him, hoping that by uncovering the actual criminals, he'll be able to free his friend Danny Morgan, also accused of the same crime.\n\nDelong is lying about the alibi. What he really wants is a share of the missing robbery loot. Rocky insists he wasn't involved. They go see Morgan's wife, Nancy, a former love of Rocky's, who now lives in a trailer park.\n\nPolice Lt. Gus Cobb keeps an eye on Rocky because he's still convinced of his guilt. Rocky believes that bookie Louis Castro is the mastermind. He demands $50,000 at gunpoint. Castro won't agree to that, but gives him $500 to bet on a fixed horse race.\n\nShots are fired at Delong and girlfriend Darlene near the trailer and she is killed. Nancy believes the intended victims were Rocky and herself. Rocky goes back to Castro and plays Russian roulette until Castro reveals where the robbery money can be found. It turns out Morgan was indeed involved and that Nancy now has his share.\n\nLt. Cobb gradually comes to believe Rocky's innocence. Nancy says she loves him and invites him to run off together with the loot, but Rocky leaves her for the law.\n\nPRODUCTION NOTES:-\nThe film was shot in the Bunker Hill section of the city (the &quot;Crosley&quot; Hotel, built as the Nugent, and stood at 3rd and Grand. Los Amigos bar was at 3rd and Olive. Clover Trailer Park, wasn't on Bunker Hill, but was at 650-700 N Hill Place in Chinatown.\n\nWhen the film was first released the staff at Variety magazine liked the film and said, &quot;All the ingredients for a suspenseful melodrama are contained in Cry Danger...Robert Parrish, erstwhile film editor, makes a strong directorial bow.\n\nMore contemporary, Time Out's on-line magazine review says: &quot;...it's the kind of movie in which, told to expect someone extra for dinner, delicious Fleming smiles 'OK, I'll put more water in the soup'. With excellent support players like a young, thin (for him) William Conrad and Jay Adler, this is a fast, crisp and laconic delight.&quot;\n\nTECHNICAL SPECIFICATIONS\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 592 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  1\nAudio Languages: English\nRunTime 79 mins\nSubtitles: None\nRipped by: Trinidad [DDR]","torrent":{"xt":"urn:btih:aecef2aceea4fe5e8621e4af80be559d833b134c","amp;dn":"Cry+Danger+%281951%29+Xvid+1cd+-+Dick+Powell%2C+Rhonda+Fleming+%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aecef2aceea4fe5e8621e4af80be559d833b134c","infoHashBuffer":{"type":"Buffer","data":[174,206,242,172,238,164,254,94,134,33,228,175,128,190,85,157,131,59,19,76]},"announce":[],"urlList":[]}}