{"title":"Diehard Dungeon v1.7.1","uid":11048683,"size":59741449,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b0e250a663b511d507c78a9e29b4b3f925bff6c1&amp;dn=Diehard+Dungeon+v1.7.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Lamasu","files":-1,"time":1410985840,"description":"&quot;Combining its own unique take on the real-time roguelike genre, with a nostalgic 16-bit look and feel, Diehard Dungeon is a game that feels both familiar and quite different at the same time. Followed by a trusty, treasure collecting companion chest, you must make your way through the dungeons many randomly-generated rooms and levels.&quot;\n\nChangelog:\n\nv1.7.1\n- The Sword Damage+ perk has been fixed and will now work correctly.\n- Sprites (the evil fairy things that attack with status effects) have had the Blind status effect added to their possible attacks.\n- A red badge with the letter &quot;A&quot; will appear on top of the next activatable ability (Voodoo or Reflex) on the HUD.\n- Diehard and Large Eye enemies have had their movement speed decreased slightly.\n\nv1.7.0\nPerks\n- After a successful run (escape from the dungeon), the player will be rewarded with a random perk for the next run. Perks bonuses will remain active for the entirety of the run.\n- Movement Speed +\n- Sword Damage +\n- Hand Cannon Damage +\n- Shield Health +\n- Hand Cannon Juggle + (can hit cannonballs with sword more times before they explode).\n- Chest (start with a treasure chest).\n- EXP + (the run will reward more exp).\n- Companion Upgraded (the Companion Chest will start at level 3).\n- Gold Rush (increases the chance of finding a gold dropping wisp).\n- Heart Slots (start with 10 available heart slots. Only 5 will contain hearts).\nOther\n- New status effect: Blind - the player's vision becomes severely limited to a small circle. Enemies are also susceptible to this effect.\n- New ability: Sense - highlights trap pressure pads, making them much easier to spot.\n- New ability: Vision - immune to Blind status effect.\n- New ability: Attract. The Companion Chest has a much larger treasure attraction range.\n- New ability: Reflex (single use) - slows time (for everything apart from the player), allowing the player to easily avoid enemy attacks and potentially deal massive damage.\n- New ability: Pierce. Hit cannonballs with the sword to unleash a piercing wave attack.\n- All routes in Champion Mode are now hard. The hard routes still respect the player's rank.\n- Diehard minions. Occasionaly the Dungeon Master will spawn a Diehard into the room instead of a spectre of himself. Diehards will be selected from the global leaderboard of players that have attained the rank of Diehard. The higher your rank, the more likely you are to encounter a Diehard. Diehards drop an EXP pickup when defeated.\n- Boss health bar. A boss heaslth bar is now visible above the north wall of the room.\n- Trap pressure pads will now glint briefly if the Companion Chest's light shines on them. This will help the player spot pressure pads covered in debris.\n- Token Wells now drop 2 tokens instead of 1.\n- The Dungeon Master will now only spawn to fight you in the final boss room if you have taken all hard routes.\n- New &quot;complete&quot; ending. Escape the dungeon at Diehard rank, in Champion Mode, and defeat the Dungeon Master to view the new ending.\n- The previous &quot;best&quot; ending has been modified to account for the &quot;complete&quot; ending.\n- Champion Mode trigger distance has been increased for the Champions that wander along the tops of the walls.\n- Blind status effect has been added to the possible Pyramid attacks.\n- 5 new achievements for the new abilities.\n- 1 new achievement for the &quot;complete&quot; ending.\n\nFor the full changelog, see changelog.txt.\n\nIf you like the game, support the developer, buy it! &lt;a href=&quot;\nhttp://store.steampowered.com/app/277870/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.steampowered.com/app/277870/&lt;/a&gt;","torrent":{"xt":"urn:btih:b0e250a663b511d507c78a9e29b4b3f925bff6c1","amp;dn":"Diehard+Dungeon+v1.7.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0e250a663b511d507c78a9e29b4b3f925bff6c1","infoHashBuffer":{"type":"Buffer","data":[176,226,80,166,99,181,17,213,7,199,138,158,41,180,179,249,37,191,246,193]},"announce":[],"urlList":[]}}