{"title":"The Anthony Cumia Show 2015-02-25 MP4 MP3 combo","uid":11723539,"size":272694083,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:b1b15c2c2a80f89888d8fce2446030e5cc1e8ae9&amp;dn=The+Anthony+Cumia+Show+2015-02-25+MP4+MP3+combo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mothergoose58","files":2,"time":1424962765,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\n\nEpisode 117: Anthony gets right into expressing his frustration with net neutrality because the government won't be clear on what it actually is, he mentions he'll be on air with Joe Walsh (no, not from the Eagles) to discuss the subject later, and talks about Keith Olbermann's bullshit apology as well as how that asshole hates and wants to fuck cancer kids. (Shame on you Olbermann!) We then hear Kristi Capel's apology for saying &quot;jigaboo&quot;, Giuliana Rancic's to Zendaya's hair (WTF?), find out that fat bitch Kelly Osbourne is butting in on the (non)issue, and the callers let their opinions fly. We watch a nudie hula-hoop video, listen to new entries for the &quot;Most Offensive Song&quot; contest, talk about the Eddie Ray Routh &quot;sniper trial&quot; verdict, a domestic violence case out of Memphis, and Ant goes through the age range of acceptable gals for him. We see part of a press conference on the hidden tunnel in Toronto, Ant talks about the ingenuity kids used to have building tree forts, the upcoming TACS app, removing race from crime alerts, and today's show ends with the audio of Howard Stern shitting on podcasts and breaking down his medieval theories.\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\n\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:b1b15c2c2a80f89888d8fce2446030e5cc1e8ae9","amp;dn":"The+Anthony+Cumia+Show+2015-02-25+MP4+MP3+combo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1b15c2c2a80f89888d8fce2446030e5cc1e8ae9","infoHashBuffer":{"type":"Buffer","data":[177,177,92,44,42,128,248,152,136,216,252,226,68,96,48,229,204,30,138,233]},"announce":[],"urlList":[]}}