{"title":"Icarus Witch - Rise (2012) [EAC-FLAC]","uid":11058147,"size":346089225,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b64af7dd375b809231b3cbf135704c5d6248f842&amp;dn=Icarus+Witch+-+Rise+%282012%29+%5BEAC-FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"qculfj","files":25,"time":1411139940,"description":"01. The End\n02. (We Are) The New Revolution\n03. Rise\n04. Asylum Harbour\n05. Coming Of The Storm\n06. Tragedy\n07. Say When\n08. Break The Cycle\n09. Nothing Is Forever\n10. Pray\n11. In The Dark\n12. Last Call For Living\n\n\nDespite the shakeups and separatism that recently plagued Pittsburgh power metallers ICARUS WITCH, the core principle of this band has remained pure of heart. 2005's &quot;Capture the Magic&quot; and 2007's &quot;Songs For the Lost&quot; were sharp, retro-spirited classic metal barrages that corralled everything the original core of headbangers cherished about the genre, i.e. JUDAS PRIEST, CIRITH UNGOL, PENTAGRAM and SAXON with subliminal plants of WITCHFINDER GENERAL and HAWKWIND. A failure to get on the same page within the band's ranks as of 2010's &quot;Bring Down the Moon&quot; nearly derailed the group altogether. Original vocalist Matthew Bizilia took off afterwards, leaving ICARUS WITCH in the hands of bassist and lone founding member Jason &quot;Sin&quot; Myers.\n\nHaving watched the original inception of ICARUS WITCH dissolve over the course of the past seven years, Myers has replaced components and rebooted the band through the capable pipes of Christopher Shaner. Automatically most listeners are going to think Jeff Scott Soto has joined ICARUS WITCH and the collective responds with a songwriting scheme that reflects Soto's doings as a powerhouse of Eighties-grounded melodic metal. Christopher Shaner is Soto incarnate and ICARUS WITCH accordingly shifts their sound to a punchy, harmonious brand of nod-along heavy metal akin to Y&amp;T, KEEL, LILLIAN AXE and of course, Soto's affiliations with PANTHER, TALISMAN, Michael Schenker and Axel Rudi Pell.\n\nWhile ICARUS WITCH has been both praised and criticized for an unbending propensity towards the early eighties through their latest offering, &quot;Rise&quot;, the focus now shifts forward ? by half a decade, anyway. &quot;Rise&quot; might've had a considerable shot at mid-tier success had it been released in 1986. There's a lot going for &quot;Rise&quot; which separates it from its predecessors. &quot;Capture the Magic&quot; and &quot;Songs For the Lost&quot; remain ICARUS WITCH's heaviest offerings, but &quot;Rise&quot; is perhaps the tightest this band had ever sounded.\n\nJason Myers has seen enough of the metal underground to know what floats and what doesn't. &quot;Bring Down the Moon&quot; may have been a dubious swan song to his past, but his lineup on &quot;Rise&quot; is well up to the task in recreating hummable and gluey power jams that would've spun nicely on an old turntable for Gen X'ers to whom ICARUS WITCH has unapologetically catered to. Take note of the transparent vinyl in pereptua depicted in the album's sleeve artwork. That is, if you can get your eyes away from the dazzling gams and gluteus of the smoking hot mascot who broom rides in the buff. Straight from the pages of &quot;Heavy Metal&quot; the magazine and your favorite Frazetta wall mount.\n\n&quot;(We Are) The New Revolution&quot; bears an incongruity in title since there is hardly anything new in sound about it. Still, it's a catchy number that declares ICARUS WITCH's mission statement with as much authority as you're going to find from a band leaving one foot grudgingly held in the past. It marches with pride, and that's what counts in its favor.\n\nThe addition of Christopher Shaner by all means changes the dynamic of ICARUS WITCH's tone, considering Matthew Bizilia was an unpredictable wailer lacking Shaner's harmonics and polish. Shaner exudes confidence and ICARUS WITCH gets behind him with some swift and loud kicks on &quot;Asylum Harbour&quot;, &quot;Say When&quot;, &quot;Coming of the Storm&quot; and &quot;Pray&quot;.\n\nAt times, the songs on &quot;Rise&quot; sound reminiscent of a heavier dose of what you'd find on an &quot;Iron Eagle&quot; soundtrack back in the day, but mostly the tradeoff Myers and company offers on this album comes in the way of refinement versus jagged reminiscence. The guitar solos from Quinn Lukas and Dave Watson are spangled and professional. Tom Wierzbicky brings compacted and rolling chops to the table while Jason Myers knows when to serve the tracks with deference and when to decorate with sprawling notes on the low end. All of it delivered with a live by the sword ethos, death being out of the equation.\n\n&quot;In the Dark&quot; might be the fiercest track on &quot;Rise&quot; with its towering proto pump and banging groove. It's the closest ICARUS WITCH sticks to the early roots of metal which first gave them life and it wisely comes towards the end of this record. It's a nifty payoff materializing after a succession of gliding heavy rockers legitimizing what ICARUS WITCH seeks out of themselves at this point in their career. Thus &quot;Last Call For the Living&quot; rounds &quot;Rise&quot; out on a thumping high note. If there's any sacrifice made in the transition to &quot;Rise&quot;'s determined euphony, there's not much of it. The band comes off as calibrated troopers; their only guilt is belonging to the wrong time period.\n\nNevertheless, the scene can do well to embrace retroactive holdouts such as ICARUS WITCH. &quot;Rise&quot; may not be as risqu? as its titillating artwork. The band projects a darker Goth-glam image reflective of their moniker, even if their redirected music brings to mind the days of spandex and Aqua Net. Still, &quot;Rise&quot; is a rock solid rebound from &quot;Bring Down the Moon&quot; featuring well-executed and superbly-mixed heavy metal from a unit saluting the old school like it's their ordainment.","torrent":{"xt":"urn:btih:b64af7dd375b809231b3cbf135704c5d6248f842","amp;dn":"Icarus+Witch+-+Rise+%282012%29+%5BEAC-FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b64af7dd375b809231b3cbf135704c5d6248f842","infoHashBuffer":{"type":"Buffer","data":[182,74,247,221,55,91,128,146,49,179,203,241,53,112,76,93,98,72,248,66]},"announce":[],"urlList":[]}}