{"title":"God and the Multiverse (2014) epub","uid":11042701,"size":3236579,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b9859b8f9e78a0d58e66c5261d94276f9bb7d090&amp;dn=God+and+the+Multiverse+%282014%29+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bookzilla","files":1,"time":1410893886,"description":"God and the Multiverse: Humanity's Expanding View of the Cosmos\n\n\nCosmologists have reasons to believe that the vast universe in which we live is just one of an endless number of other universes within a multiverse--a mind-boggling array that may extend indefinitely in space and endlessly in both the past and the future. Victor Stenger reviews the key developments in the history of science that led to the current consensus view of astrophysicists, taking pains to explain essential concepts and discoveries in accessible terminology. The author shows that science's emerging understanding of the multiverse--consisting of trillions upon trillions of galaxies--is fully explicable in naturalistic terms with no need for supernatural forces to explain its origin or ongoing existence.\n\n How can conceptions of God, traditional or otherwise, be squared with this new worldview? The author shows how long-held beliefs will need to undergo major revision or otherwise face eventual extinction.\n\n About the Author-\n Victor J. Stenger (1935 - 2014) was an adjunct professor of philosophy at the University of Colorado and emeritus professor of physics and astronomy at the University of Hawaii. He was the author of the New York Times bestseller God: The Failed Hypothesis, God and the Atom, God and the Folly of Faith, The Comprehensible Cosmos, and many other books.\n","torrent":{"xt":"urn:btih:b9859b8f9e78a0d58e66c5261d94276f9bb7d090","amp;dn":"God+and+the+Multiverse+%282014%29+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9859b8f9e78a0d58e66c5261d94276f9bb7d090","infoHashBuffer":{"type":"Buffer","data":[185,133,155,143,158,120,160,213,142,102,197,38,29,148,39,111,155,183,208,144]},"announce":[],"urlList":[]}}