{"title":"TheCasefortheUFO.mp3","uid":11786604,"size":324119378,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:bcee148ec79e0617df72ff323c63af0ecac6cc17&amp;dn=TheCasefortheUFO.mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":7,"uploader":null,"files":1,"time":1427773823,"description":"This is the first ever reprint of the book that brought the entire legend of the Philadelphia Experiment into the public sphere, and created controversy for decades: &quot;The Case For the UFO!&quot; Why has this book been suppressed for so many years? It is a well-reasoned review of the UFO record by an eminent astromomer, mathematician, and archaeologist: Dr. M.K. Jessup. His conclusions are breathtaking and incredible, but inescapable. \n\nDescription from the original dust jacket: \n\nFlying saucers are not new! For thousands of years, men have seen mysterious objects in the skies. Now, a prominent scientists proves that unidentified flying objects originate here, on Earth. \n\nIf you have ever wondered about the things today's scientists do not, will not, or cannot explain, this book is for you. Such questions might be: \n\nWhat is the hidden meaning of the comet's tail? \n\nWhat caused the &quot;Devil's Footprints&quot; of Devonshire? \n\nWhy are we wrong to think of space flight only in terms of rocket power? \n\nHow was a soldier &quot;teleported&quot; from the Phillippine Islands to Mexico City within one hour? \n\nWhat force lifted 1200-ton stones in ancient Peru? \n\nHow is acceleration achieved by UFOs? \n\nWhat caused the disappearance of the crews of the SS Sea Bird and the Marie Celeste? \n\nWas the &quot;secret&quot; of space flight known 50,000 years ago? \n\nWhat is the strange truth hidden in the ancient ruins of Baalbek? \n\nAnd finally, and most importantly: Are the UFOs friend, or foe?","torrent":{"xt":"urn:btih:bcee148ec79e0617df72ff323c63af0ecac6cc17","amp;dn":"TheCasefortheUFO.mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bcee148ec79e0617df72ff323c63af0ecac6cc17","infoHashBuffer":{"type":"Buffer","data":[188,238,20,142,199,158,6,23,223,114,255,50,60,99,175,14,202,198,204,23]},"announce":[],"urlList":[]}}