{"title":"Cab Calloway - 1942-1947","uid":11707965,"size":217475078,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:bfab0cca775cac99d4239b5909c9a42871f2c4fa&amp;dn=Cab+Calloway+-+1942-1947&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"johnny39","files":37,"time":1424215890,"description":"Cab Calloway And His Orchestra 1942 - 1947\nClassics 996\n\n\nCAB CALLOWAY AND HIS ORCHESTRA\nJonah Jones, Russell Smith, Shad Collins, Lammer Wright (tp), Tyree Glenn (tb, vb), Quentin Jackson, Keg Johnson (tb), Jerry Brake (as Jacinto Chabani) (cl, as), Hilton Jefferson (as), Andrew Brown (as, bar), Ted McRae, Walter Thomas (ts), Bennie Payne (p), Danny Baker (g), Milton Hinton (sb), Cozy Cole (dm), Cab Calloway, The Cabaliers (vo).\nChicago, February 2, 1942.\n01. C 4180-1\tWhat's Buzzin' Cousin ?\n\nCAB CALLOWAY AND HIS ORCHESTRA\nJonah Jones, Russell Smith, Shad Collins, Lammer Wright (tp), Tyree Glenn (tb, vb), Quentin Jackson, Keg Johnson (tb), Irving &quot;Skinny&quot; Brown (cl, as), Hilton Jefferson (as), Andrew Brown (as, bar), Al Gibson, Walter Thomas (ts), Bennie Payne (p), Danny Baker (g), Milton Hinton (sb), Cozy Cole (dm), Cab Calloway (vo).\nHollywood, July 27, 1942.\n02. HCO 887-1\tChant Of The Jungle\n\nCAB CALLOWAY AND HIS ORCHESTRA\nRussell Smith, Jonah Jones, Paul Webster, Shad Collins (tp), Tyree Glenn, Fred Robinson, Keg Johnson, Quentin Jackson (tb), Hilton Jefferson, Al Gibson (as), Irving &quot;Skinny&quot; Brown, Ike Quebec (ts), Greely Walton (bar), Dave Rivera (p), Danny Baker (g), Milton Hinton (sb), J. C. Heard (dm), Cab Calloway, Dotty Salters (vo).\nNew York City, September 18, 1944.\n03. VP947\tI'm Making Believe - voDS\n04. VP947\tFoo A Little Ballyhoo\n\nCAB CALLOWAY AND HIS ORCHESTRA\nRussell Smith, Jonah Jones, Paul Webster, Shad Collins, Roger Jones (tp), Tyree Glenn, Fred Robinson, Keg Johnson, Quentin Jackson (tb), Hilton Jefferson, Al Gibson (as), Irving &quot;Skinny&quot; Brown, Ike Quebec (ts), Greely Walton (bar), Dave Rivera (p), Danny Baker (g), Milton Hinton (sb), J. C. Heard (dm), Cab Calloway (vo).\nNew York City, January 24, 1945.\n05. CCO 4323-1\tLet's Take The Long Way Home (Vc.Calloway)\n06. CCO 4324-1\tFor A Little Bally-Hoo (Vc.Calloway)\n\nCAB CALLOWAY AND HIS ORCHESTRA\nRussell Smith, Jonah Jones, Paul Webster, Shad Collins, Roger Jones (tp), Tyree Glenn, Fred Robinson, Keg Johnson, Quentin Jackson (tb), Hilton Jefferson, Alfred Gibson (as), Bob Dorsey, Ike Quebec (ts), Rudy Powell (as, bar), Dave Rivera (p), Danny Baker (g), Milton Hinton (sb), J. C. Heard (dm), Cab Calloway (vo).\nNew York City, April 19, 1945.\n07. CO 34578-1\tAll At Once\n08. CO 34579-1\tDawn Time\n\nCAB CALLOWAY AND HIS ORCHESTRA\nRussell Smith, Jonah Jones, Paul Webster, Shad Collins, Roger Jones (tp), Tyree Glenn, Fred Robinson, John Haughton, Quentin Jackson (tb), Hilton Jefferson, Alfred Gibson (as), Bob Dorsey, Ike Quebec (ts), Rudy Powell (as, bar), Dave Rivera (p), Danny Baker (g), Milton Hinton (sb), J. C. Heard (dm), Cab Calloway, The Cabaliers (vo).\nNew York City, September 11, 1945.\n09. CO 35187-1\tIf This Isn't Love - voC\n10. CO 35188-1\tA Blue Serge Suit With A Belt In The Back\n11. CO 35189\tHere I Go Just Dreamin' Again\n\nCAB CALLOWAY AND HIS ORCHESTRA\nRussell Smith, Jonah Jones, Paul Webster, Shad Collins, Roger Jones (tp), Tyree Glenn, Fred Robinson, Keg Johnson, Quentin Jackson (tb), Hilton Jefferson, Alfred Gibson (as), Bob Dorsey, Ike Quebec (ts), Rudy Powell (as, bar), Dave Rivera (p), Danny Baker (g), Milton Hinton (sb), Buford Oliver (dm), Cab Calloway (vo).\nNew York City, November 13, 1945.\n12. CO 35420-1\tThe Honey Dripper\n13. CO 35421-1\tAfternoon Moon\n\nCAB CALLOWAY AND HIS ORCHESTRA\nRussell Smith, Jonah Jones, Shad Collins, Roger Jones (tp), Tyree Glenn, Earl Hardy, Keg Johnson, Quentin Jackson (tb), Hilton Jefferson, Alfred Gibson (as), Bob Dorsey, Ike Quebec (ts), Rudy Powell (as, bar), Bennie Payne (p), John Smith (g), Milton Hinton (sb), Cozy Cole (dm), Cab Calloway (vo).\nNew York City, May 13, 1946.\n14. CO 36272-1\tHey Now, Hey Now\n15. CO 36273-1\tI Got A Gal Named Nettie\n\nCAB CALLOWAY AND HIS ORCHESTRA\nLammer Wright, Jonah Jones, Johnny Letman, Paul Webster (tp), Keg Johnson, Quentin Jackson, James Buxton, Earl Hardy (tb), Hilton Jefferson, Rudy Powell, Charles Frazier (as, bar), Al Gibson, Sam Taylor (ts), Dave Rivera (p), John Smith (g), Milton Hinton (sb), Panama Francis (dm), Cab Calloway (vo).\nNew York City, February 3, 1947.\n16. CO 37340-1\tHi-De-Ho Man (That's Me)\n17. CO 37341-1\tNecessity\n18. CO 37342\tOh Grandpa\n19. CO 37343\tDon't Falter At The Alter\n\nCAB CALLOWAY AND HIS CAB-JIVERS\nJonah Jones (tp), Hilton Jefferson (as), Sam Taylor (ts), Dave Rivera (p), John Smith (g), Milton Hinton (sb), Panama Francis (dm), Cab Calloway (vo).\nNew York City, May 1, 1947.\n20. CO 37686\tGive Me Twenty Nickels For A Dollar\n21. CO 37687\tThe Jungle King\n\nCAB CALLOWAY AND HIS ORCHESTRA\nLammer Wright, Jonah Jones, Johnny Letman, Paul Webster (tp), Keg Johnson, Quentin Jackson, James Buxton, Earl Hardy (tb), Hilton Jefferson, Rudy Powell, Charles Frazier (as, bar), Al Gibson, Sam Taylor (ts), Dave Rivera (p), John Smith (g), Milton Hinton (sb), Panama Francis (dm), Cab Calloway (vo).\nNew York City, December 11, 1947.\n22. CO 38506-1\tTwo Blocks Down, Turn To The Left (On The Right-hand Side Of The Street)\n23. CO 38507\tSan Francisco Fan\n24. CO 38508-1\tThe Calloway Boogie\n25. CO 38509-1\tEverybody Eats When They Come To My House\n\nCAB CALLOWAY AND HIS CABALIERS\nJonah Jones (tp), Tyree Glenn (tb), Ike Quebec (ts), Dave Rivera (p), Milton Hinton (sb), Panama Francis (dm), Cab Calloway (vo).\nHis Highness Of Hi-De-Ho&quot;, Guest Star NO. 182, September 17, 1950.\n\tYou Got It\n\tEverybody Eats When They Come To My House\n\tThat Old Black Magic\n\tOo-Bli-Da\n\tDucktrot\n\n\tBirth Of The Blues\n\tWe The Cats Shall Help You\n\tFoo A Little Ballyhoo","torrent":{"xt":"urn:btih:bfab0cca775cac99d4239b5909c9a42871f2c4fa","amp;dn":"Cab+Calloway+-+1942-1947","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bfab0cca775cac99d4239b5909c9a42871f2c4fa","infoHashBuffer":{"type":"Buffer","data":[191,171,12,202,119,92,172,153,212,35,155,89,9,201,164,40,113,242,196,250]},"announce":[],"urlList":[]}}