{"title":"The Brendan Voyage by Tim Severin (retail) {dwg}","uid":11048764,"size":9921142,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c207f90c67f41444fd4f5661692e42766b0e2609&amp;dn=The+Brendan+Voyage+by+Tim+Severin+%28retail%29+%7Bdwg%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"gratefuldawg77","files":6,"time":1410987700,"description":"Could an Irish monk in the sixth century really have sailed all the way across the Atlantic in a small open boat, thus beating Columbus to the New World by almost a thousand years? Relying on the medieval text of St. Brendan, award-winning adventure writer Tim Severin painstakingly researched and built a boat identical to the leather curragh that carried Brendan on his epic voyage. He found a centuries-old, family-run tannery to prepare the ox hides in the medieval way; he undertook an exhaustive search for skilled harness makers (the only people who would know how to stitch the three-quarter-inch-thick hides together); he located one of the last pieces of Irish-grown timber tall enough to make the mainmast. But his courage and resourcefulness were truly tested on the open seas, including one heart-pounding episode when he and his crew repaired a dangerous tear in the leather hull by hanging over the side--their heads sometimes submerged under the freezing waves--to restitch the leather. A modern classic in the tradition of Kon-Tiki, The Brendan Voyage seamlessly blends high adventure and historical relevance. It has been translated into twenty-seven languages since its original publication in 1978.","torrent":{"xt":"urn:btih:c207f90c67f41444fd4f5661692e42766b0e2609","amp;dn":"The+Brendan+Voyage+by+Tim+Severin+%28retail%29+%7Bdwg%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c207f90c67f41444fd4f5661692e42766b0e2609","infoHashBuffer":{"type":"Buffer","data":[194,7,249,12,103,244,20,68,253,79,86,97,105,46,66,118,107,14,38,9]},"announce":[],"urlList":[]}}