{"title":"[PS3] The Last Guy","uid":10743985,"size":1775193910,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:c4363a86648d6a02f1a4de21bc7bfc01a65d95bb&amp;dn=%5BPS3%5D+The+Last+Guy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"fuckface69","files":-1,"time":1407794328,"description":"Do you have the courage to save mankind from a global crisis?\n\nSet in the aftermath of a strange event that has caused many people to turn into fierce monsters, The Last Guy is a fast-paced game which challenges players to save humanity by leading everybody else through the streets of the world's most famous cities to safety.\n\nThe Last Guy takes an aerial view of the action with High Definition graphics, showing faithful recreations of 14 world cities, including Asakusa, Los Angeles and London, created with aerial photography. As the mysterious mutant - the last guy - you must gather the survivors into lines and lead them through the streets. Each city has an escape zone which you must lead your people into while avoiding the enemy at all costs; one touch from a monster means instant death.\n\nAiding you in your quest are a number of power-ups which bestow special abilities, such as invisibility and extra energy - and bonus points can be gained by finding special VIP survivors and escorting them to the rendezvous point.  \n\nYou are the Last Guy who can salvage humanity from this apocalypse...\n\n* Survive 14 maps and additional bonus stages based on real life satellite pictures\n* Escape from ten different types of monster, each with their own attacks and behaviour patterns\n* Compare scores and rank with online leaderboards\n____________________________________________\n\nYOU HAVE TO USE WINRAR 5 TO EXTRACT ARCHIVE!","torrent":{"xt":"urn:btih:c4363a86648d6a02f1a4de21bc7bfc01a65d95bb","amp;dn":"%5BPS3%5D+The+Last+Guy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4363a86648d6a02f1a4de21bc7bfc01a65d95bb","infoHashBuffer":{"type":"Buffer","data":[196,54,58,134,100,141,106,2,241,164,222,33,188,123,252,1,166,93,149,187]},"announce":[],"urlList":[]}}