{"title":"The Anthony Cumia Show 2015-02-11 MP4 MP3 combo","uid":11697095,"size":347251851,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:c801a76d4447ddd5547d65851eaab2a38eb406a6&amp;dn=The+Anthony+Cumia+Show+2015-02-11+MP4+MP3+combo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mothergoose58","files":2,"time":1423760151,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nGuest(s): Rob Bartlett\n\nEpisode 109: Wednesday starts with a recap of yesterday's show, Ant discusses Stuttering John's appearance on Opie and Jimmy's show this morning, Opie's assessment on the &quot;break up&quot;, and he gives his two (or three) cents on the topic and on the future of his broadcasting. Ant then gets into a news story about a cunty principal at a special needs school, a few callers question Anthony about the Opie situation, and after a hilarious song parody video featuring Rob Bartlett, Ant relocates to the poker table to meet up with him. The guys talk about Rob's early career, go back and forth with impressions, chat about Brian Williams, Bruce Jenner, and the Fifty Shades of Grey movie being blamed for an increase in sexual injuries. They also talk about past acting roles, old TV shows and commercials, smoking and where you could do it back in &quot;the day&quot;, and Rob talks Broadway and performing at the Tony's. We hear about a gig Rob did at the MTV Awards, he shares a Vince McMahon story, Ant shares a few past WWF stories, and they talk about gay characters on old timey TV and in movies. Rob tells us about his show March 7th with Tony Powell at Tarrytown Music Hall, they discuss what a trailblazer Imus was and is, how shitty radio pay used to be, Ant introduces Rob to the Hydromax from Bathmate, and they end today talking movie lines and Mexican Coke.\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\n\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:c801a76d4447ddd5547d65851eaab2a38eb406a6","amp;dn":"The+Anthony+Cumia+Show+2015-02-11+MP4+MP3+combo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c801a76d4447ddd5547d65851eaab2a38eb406a6","infoHashBuffer":{"type":"Buffer","data":[200,1,167,109,68,71,221,213,84,125,101,133,30,170,178,163,142,180,6,166]},"announce":[],"urlList":[]}}