{"title":"Belzec in Propaganda, Testimonies, Archeological Research, and H","uid":11720884,"size":3133010,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c9f71190d2fe567857f6459deba636dcd7b7c91d&amp;dn=Belzec+in+Propaganda%2C+Testimonies%2C+Archeological+Research%2C+and+H&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"HowdyDooDoo","files":1,"time":1424808943,"description":"Witnesses report that at least 600,000, if not as many as three million people primarily of Jewish faith, were murdered in the Belzec camp, located in eastern Poland, between November 1941 and December 1942. Various murder weapons are claimed to have been used: diesel gas chambers; quicklime in trains; high voltage; vacuum chambers. According to witnesses, the corpses were finally incinerated on huge pyres without leaving any traces.\n\nFor those who know the stories about Treblinka, this all sounds too familiar. The author therefore restricted this study to the aspects, which are different and new compared to Treblinka, but otherwise refers the reader to his Treblinka book. The development of the official image portrait of Belzec is explained and subjected to a thorough critique. In contrast to Treblinka, forensic drillings and excavations were performed in the late 1990s in Belzec, the results of which are explained and critically reviewed. These findings, together with the absurd claims by 'witnesses,' refute the thesis of an extermination camp.\n\nThis study exposes the Belzec hoax by thoroughly examining all available evidence, including forensic drillings and excavations of the late 1990s","torrent":{"xt":"urn:btih:c9f71190d2fe567857f6459deba636dcd7b7c91d","amp;dn":"Belzec+in+Propaganda%2C+Testimonies%2C+Archeological+Research%2C+and+H","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9f71190d2fe567857f6459deba636dcd7b7c91d","infoHashBuffer":{"type":"Buffer","data":[201,247,17,144,210,254,86,120,87,246,69,157,235,166,54,220,215,183,201,29]},"announce":[],"urlList":[]}}