{"title":"Mother Wore Tights (1947) DVD5 Uncomp - [DDR]","uid":11675456,"size":4399865856,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:d0413c02efe9bc84693753541b8d8baad8ef881e&amp;dn=Mother+Wore+Tights+%281947%29+DVD5+Uncomp+-+%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SaM","files":18,"time":1422837273,"description":"Mother Wore Tights (1947) DVD5 Uncompressed - Betty Grable, Dan Dailey [DDR]\n\nMother Wore Tights is a 1947 Technicolor musical film starring Betty Grable and Dan Dailey as married vaudeville performers, directed by Walter Lang.\n\nThis was Grable and Dailey's first film together, based on a book of the same name by Miriam Young. It was the highest grossing film of Grable's career up to this time, earning more than $5 million at the box office. It was also 20th Century Fox's most successful film of 1947.\n\nAlfred Newman won the Academy Award for Original Music Score. Josef Myrow (music) and Mack Gordon (lyrics) were nominated for Original Song (&quot;You Do&quot;), while Harry Jackson was nominated for Color Cinematography.\n\n    CAST:-\n    Betty Grable as Myrtle McKinley Burt\n    Dan Dailey as Frank Burt\n    Mona Freeman as Iris Burt\n    Connie Marshall as Miriam Burt\n    Vanessa Brown as Bessie\n    Robert Arthur as Bob Clarkman\n    Sara Allgood as Grandmother McKinley\n    William Frawley as Mr. Schneider\n    Senor Wences as himself\n\nDirected by Walter Lang\nProduced by Lamar Trotti\nMusic by Frank Burt\nRunning time 107 minutes\n\nMOVIE PLOT:- Mother Wore Tights (1947)\nIn turn-of-the-century Oakland, California, the teenaged Myrtle McKinley (Betty Grable) is expected to follow high school by attending a San Francisco business college. Instead, she takes a job performing with a traveling vaudeville troupe, where she meets and falls in love with singer-dancer Frank Burt (Dan Dailey).\n\nFrank proposes they marry and also entertain on stage together as an act, which proves very popular. Myrtle retires from show business after giving birth to daughters Iris (Mona Freeman) and Mikie (Connie Marshall), while her husband goes on tour with another partner.\n\nA few years later, less successful now, Frank persuades his wife to return to the stage. The girls are cared for by their grandmother as their parents leave town for months at a time.\n\nIris and Mikie are school girls when they are given a trip to Boston to see their parents. Iris meets a well-to-do young man, Bob Clarkman (Robert Arthur), and is permitted to attend an exclusive boarding school there. She is embarrassed by her parents' profession, however, and mortified at what the reaction will be from Bob and all of her new school friends when they learn that her parents are performing nearby.\n\nMyrtle and Frank take matters into their own hands, arranging with the school to have all of the students attend a show. To her great relief, Iris is delighted when her classmates adore her parents' sophisticated act. By the time she's out of school and ready to marry, Iris wants to go into show business herself.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 4698 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 29.970\nAudio Codec:  AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: English\nRunTime 107 mins\nSubtitles: NONE\nRipped by: Trinidad [DDR]","torrent":{"xt":"urn:btih:d0413c02efe9bc84693753541b8d8baad8ef881e","amp;dn":"Mother+Wore+Tights+%281947%29+DVD5+Uncomp+-+%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0413c02efe9bc84693753541b8d8baad8ef881e","infoHashBuffer":{"type":"Buffer","data":[208,65,60,2,239,233,188,132,105,55,83,84,27,141,139,170,216,239,136,30]},"announce":[],"urlList":[]}}