{"title":"Interracial and Anal 2 (2015) - Interracial Porn XXX","uid":11784676,"size":3952216181,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:d1f8a7280f6c671421a5e2f0522aa25f8072eb18&amp;dn=Interracial+and+Anal+2+%282015%29+-+Interracial+Porn+XXX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"KidAtomic","files":1,"time":1427697863,"description":"Interracial and Anal 2 (2015) - Interracial Porn XXX\n\nBlacked.com (Blacked.com)\n\nCategory:  All Sex , Interracial\nDirected by:\nGreg Lansky\n\nStarring: \nPrince Yahshua\nAllie Haze\nFlash Brown\nAnikka Albrite\nZoey Monroe\nRob Piper\nMandy Muse\n\nWelcome to a new IR release from a studio that is quickly rising up to be among the best producers of this content for the porn market. This release will feature four girls and the best thing is each and every scene will see these girls doing anal with a big black cock. Time for a few highlights.\n\nAllie Haze with Rob Piper:\n\nThe first scene opens with Allie at her job and she's on the phone with her man and the conversation isn't going well. You know it's my job and all but she's off it by the time Rob comes in to check on her progress. He senses she's a little tight and what better way to unwind than a little office fucking! Allie is looking cuter than ever here wearing glasses too. Rob lets the hands dip inside to massage her titties then he pulls out and walks off. Moments later we cut to Allie now just wearing white lace and the two start making out as we get a great close shot of the two lip locking. Allie makes the short trip down onto her knees and eyes up the long cock before her and works him in. Watching this from the side angle was real good as she slowly works that cock even licking up the shaft plus the eye contact is there also. Fans of Allie Haze sucking cock should really enjoy what you see here. top notch work. The first shot in the sex is a winner too, cowgirl! Yeah it's vag to start but you get a birds eye view of that butthole which soon gets filled! The first anal occurs with Allie turned slightly on her side but the view is real clear of Rob sliding in and out of her ass. They shoot Rob taking her from behind too leading up to him dropping a load down onto her waiting tongue and there's clean up too from Allie. I could get used to watching her do anal!!!\n\nZoey Monroe with Flash Brown:\n\nNext up is a girl who has a well known love for anal sex and I've seen nothing but quality work so far from Zoey. In this scene we have Zoey getting off work and she wanted to hit a girlfriends house to take a shower to wash all that hard work off but she won't be there. Though we still have Zoey heading over because the boy friend will be there to let Zoey in and she seems to think this is good news. Zoey shows up and has a seat and chats a bit with Flash who doesn't seem to think anything is up but we sense Zoey has other ideas! Cut then to her in the shower and we get a little water play and I love girls in the shower with the water cascading down upon them and Zoey works it touching herself all over while rubbing in a little soapy water. Hello! We have Flash coming in wrapped just in a towel and he asks if it's alright to come in and she quips I left the door open for a reason! Finally the real reason she stopped by. Having met Flash recently at a party she came up with any excuse to get over and fuck him and he's down for this! Zoey starts stroking his cock before moving down to take him in. She's pretty aggressive here working his cock as we get a side view. They move out of the shower into the bedroom where Zoey continues to pleasure Flash. There is one position of pussy fucking before they make the change to anal with reverse looking real nice plus there is A2M. Some anal from behind leads to Flash dropping a load to her waiting mouth.\n\nAnikka Albrite with Prince Yahshua:\n\nMoving right along we come to the newest Female Performer of the Year and the scene begins with Anikka outside on a call and she's about to meet with her boss about a possible big promotion. Anikka looks great wearing a read jacket and black dress under. Cut to the meeting where Prince is intently listening as Anikka gives her pitch for this promotion but Prince isn't quite sure she's the right fit- but she's willing to show just how right a fit she is or at least how her ass is the right fit!!Prince spells it out directly asking if she'd stand up and pull up her skirt and show him and us that perfect ass!! Anikka is willing to do whatever it takes and thankfully for us that means a booty shot with only a black thong covering her forbidden zone. Prince of course is impressed and further spells it out. Fucking her in the ass will get Anikka the promotion! Prince comes over and gets a feel for that perfect bottom and Anikka starts to warm up to what's happening. Thankfully we get the thong off and Prince does what we all would want to do here and that's tongue fuck her butt. We miss a blowjob from Anikka after but we are compensated with Prince easing his cock into her ass doggiestyle. A wardrobe change with both getting fully nude and off to a different room where Prince offers up a little more oral pleasure for Miss Albrite but still no bj from here, what's up with that! They finally hit the premier position for Anikka and that's cowgirl anal and you see just how full of cock her ass is. Finally after some side saddle anal we get Anikka dropping down to take Prince into her mouth and she is a little sloppy here working his cock in and out. The scene ends with Anikka taking an open mouth pop and offering clean up after. A pretty good scene but they really should have captured some oral from her much earlier in the scene I think rather than making us wait until nearly the end.\n\nMandy Muse with Flash Brown:\n\nTime to wrap this one up and we check in with Mandy who just bumped into her neighbors car leaving a dent. She was on her cell and he saw that too and it's raining! So they head inside to discuss what's next and of course it was an argument with the boyfriend that led to this fender bender. Mandy doesn't have insurance and Flash balks at the idea of fixing his car and sending her the bill. He comes up with another way she can settle this matter and you can guess what it is! Mandy puts up token resistance but he's already feeling her up while she does it, lol. Flash pulls up her outfit allowing us to get a look at her ass and then it is onto the bedroom where unlike the previous scene we get the early cock sucking with Mandy offering good eye contact while sucking and stroking. The bj gets a little sloppy with spit falling off her chin onto her black top. Flash gives a little oral in return before sliding in her pussy for a little mish fun. Still in mish we get Flash making the small trip down to fill her ass hole. The shot was open but the next position with her riding in cowgirl was even better. Mandy gives A2M then lets Flash go behind to drill her ass some more. The scene ends with a good load dropped onto her waiting tongue and clean up from Mandy after","torrent":{"xt":"urn:btih:d1f8a7280f6c671421a5e2f0522aa25f8072eb18","amp;dn":"Interracial+and+Anal+2+%282015%29+-+Interracial+Porn+XXX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1f8a7280f6c671421a5e2f0522aa25f8072eb18","infoHashBuffer":{"type":"Buffer","data":[209,248,167,40,15,108,103,20,33,165,226,240,82,42,162,95,128,114,235,24]},"announce":[],"urlList":[]}}