{"title":"Space Ghost &amp; Dino Boy","uid":11774879,"size":10822953945,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d2f01e26114c29c27450d119a1dab5f39a4b03a5&amp;dn=Space+Ghost+%26amp%3B+Dino+Boy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"HowdyDooDoo","files":62,"time":1427235415,"description":"1 \tSeptember 10, 1966 \t\n\n    The Heat Thing: A lava monster attacks Jace on Jupiter. Space Ghost must save him from the monster.\n    The Worm People: A tribe of worm-like beings captures Dino Boy, and Ugh must save him.\n    Zorak: Zorak, one of Space Ghost's enemies, escapes from prison and kidnaps the twins in a revenge plot against Space Ghost.\n    Note: Jupiter is incorrectly depicted as a craterous, rocky planet in this episode.\n\n2 \tSeptember 17, 1966 \t\n\n    The Lizard Slavers: Lizard-like slavers capture Jan and Jace for stumbing across their base.\n    The Moss Men: While running from a T-Rex, Dino Boy and Ugh are captured by Moss Men who plan to use Dino Boy as a sacrifice. Ugh must stop them before it is too late.\n    The Web: Black Widow lures Space Ghost to her planet so she can kill him with her insect monsters.\n\n3 \tSeptember 24, 1966 \t\n\n    Creature King: After suffering a reactor burnout, Jan and Jace land on a planet where huge animals live and are controlled by Creature King.\n    The Treeman: Dino Boy is captured by some treemen to serve as a sacrifice, and Ugh must save him with the help of mammoths.\n    The Sandman: The Sandman has attacked military units to draw Space Ghost to him, in order to destroy his mind and conquer the world.\n\n4 \tOctober 1, 1966 \t\n\n    The Evil Collector: The Evil Collector shrinks people to use in a real-life cat-and-mouse game.\n    The Fire God: A Fire God captures Dino Boy. The Sabretooth People plan to sacrifice, but Ugh is determined to stop them.\n    The Drone: A mysterious figure uses a robot to steal the Phantom Cruiser. Space Ghost and the twins must retrieve it.\n\n5 \tOctober 8, 1966 \t\n\n    Homing Device: Metallus threatens to destroy Earth with a missile unless Space Ghost surrenders to him.\n    The Mighty Snow Creature: Dino Boy and Ugh venture into the snow-capped mountains to rescue a young tribal girl from a large Snow Monster.\n    The Robot Master: Metallus uses a robot fleet to take over Space Ghost's planet.\n\n6 \tOctober 15, 1966 \t\n\n    The Iceman: Zeron attacks Space Ghost by using a powerful ice ray.\n    The Wolf People: Ugh is captured by the Wold People, and Dino Boy and Bronty must save him.\n    Hi-Jackers: Jan and Jace are captured by Tansit after they witness his hi-jacking of a ship.\n\n7 \tOctober 22, 1966 \t\n\n    The Energy Monster: Space Ghost must fight a monster created by Dr. Soonev in a lab accident.\n    Valley of the Giants: During an earthquake, Bronty is captured by a giant, and Dino Boy and Ugh must save him.\n    The Lure: Brak kidnaps Jan so that Space Ghost won't interfere in his robbery plans.\n\n8 \tOctober 29, 1966 \t\n\n    The Cyclopeds: Space Ghost must rescue the twins from Cyclo and his robots.\n    The Ant Warriors: Ugh is captured by Ant Warriors. Dino Boy tries to rescue him but ends up having save the Ant Warriors from a Megatherium.\n    The Schemer: Space Ghost is ensnared in the Schemer's plan to kill him.\n\n9 \tNovember 5, 1966 \t\n\n    Lokar - King of the Killer Locusts: Lokar lures the twins to him to be captured by his killer locust robots.\n    The Bird Riders: Dino Boy and Ugh are forced to protect a Bird Rider from some Rock Pygmies.\n    Space Sargasso: The Lurker and his partner One Eye have been preying on ships that pass close by and now they have their sights set on the Phantom Cruiser.\n\n10 \tNovember 12, 1966 \t\n\n    Brago: Brago's bandits attack an outpost, and the twins must defend them until Space Ghost arrives.\n    Giant Ants: While running from a volcanic eruption, Dino Boy ends up in a valley of giants. He has to run from Giant Ants, and Ugh must save him.\n    Revenge of the Spider Woman: Staying true to her word, Black Widow/Spider Woman tries to kill Space Ghost again.\n\n11 \tNovember 19, 1966 \t\n\n    Attack of the Saucer Crab: Space Ghost must defeat a UFO from another galaxy that could act as a vanguard for an invasion.\n    The Rock Pygmies: Dino Boy and Bronty get in trouble with a Smilodon and are separated. Bronty is captured by Rock Pygmies and Dino Boy must save him.\n    Space Birds: An evil genius is using metal birds to attack satellites and destroying them.\n\n12 \tNovember 26, 1966 \t\n\n    The Time Machine: Jace's time machine invention accidentally sends Jan back in time where she is taken captive by a Viking named Tarko the Terrible. When Jace also gets captured trying to save her, it's up to Space Ghost to rescue them.\n    Danger River: After rescuing a kid from Birdmen, Dino Boy and Ugh row along the Danger River to bring him home.\n    Nightmare Planet: Dr. Nightmare is planning on taking Space Ghost's brain for his mechanical monsters.\n\n13 \tDecember 3, 1966 \t\n\n    Space Armada: Space Ghost and the twins must stop Metallus' new, powerful missiles.\n    The Vampire Men: While showing off his kite invention to Ugh, Dino Boy ends up crashing into the mountains and ends up captured by the Vampire Men.\n    The Challenge: Zorak resurfaces and has created a metal monster that he thinks will defeat Space Ghost. When Space Ghost's Power Bands somehow fail him, Jan and Jace get to the bottom of this.\n\n14 \tDecember 10, 1966 \t\n\n    Jungle Planet: The Mind Taker is abducting people to steal their knowledge.\n    The Terrible Chase: The Sun People are hunting and start chasing Ugh. Dino Boy must save him.\n    Ruler of the Rock Robots: The twins and Space Ghost are forced to battle Zorket and his rock robots.\n\n15 \tDecember 17, 1966 \t\n\n    Glasstor: Glasstor captures the twins in order to force them to work in his glass mines.\n    The Sacrifice: Ugh is captured by the Sun People to serve as a sacrifice, and Todd must stop them.\n    The Space Ark: Creature King is planning on using his monsters to conquer Jupiter. Space Ghost must stop him from reaching that goal.\n\n16 \tDecember 24, 1966 \t\n\n    The Sorcerer: The Sorcerer is using his powerful magic for evil and plans to challenge Space Ghost.\n    The Marksman: A Pteranodon kidnaps Dino Boy for food, and Ugh must save him.\n    The Space Piranhas: Piranor wants to use space piranhas to take revenge on Space Ghost.\n\n17 \tDecember 31, 1966 \t\n\n    The Ovens of Moltar: Moltar is planning on using molten men and ships to take over the universe.\n    The Spear Warriors: Dino Boy and Ugh are arrested for attacking a Spear Warrior and have to fight their way out.\n    Transor - The Matter Mover: Transor plans on using Jan and Jayce as specimen in his zoo.\n\n18 \tJanuary 7, 1967 \t\n\n    The Gargoyloids: Space Ghost must stop a rogue planet inhabited by Gargoyloids from causing problems in the galaxy.\n    Marooned: As Dino Boy teaches Ugh how to spell, they are attacked by poisoned wasps who sting Ugh. Dino Boy must get Choka leaves from Misty Island, or Ugh will die. At the same time, he must stop two Moss Men from sacrificing one of their own.\n    The Looters: Brak is using sleeping gas to rob gold shipments, and Space Ghost has to stop them.\n\n19 \tSeptember 9, 1967 \t\n\n    The Meeting: Space Ghost's most powerful enemies unite to form the Council of Doom. Metallus uses a fleet a robots to attack Space Ghost.\n    Clutches of Creature King: After defeating Metallus, Space Ghost is forced to land on Creature King's world.\n    The Deadly Trap: Zorak plans to destroy Space Ghost using monsters. He also jettisons the twins when they try to rescue him.\n\n20 \tSeptember 16, 1967 \t\n\n    The Molten Monsters of Moltar: After escaping Zorak, Space Ghost and the twins are captured by Moltar.\n    Two Faces of Doom: Brak and Spider Woman each take their turns to dispose of Space Ghost.\n    The Final Encounter: Space Ghost, Jan, Jace and Blip take their final fight to the Council of Doom","torrent":{"xt":"urn:btih:d2f01e26114c29c27450d119a1dab5f39a4b03a5","amp;dn":"Space+Ghost+%26amp%3B+Dino+Boy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2f01e26114c29c27450d119a1dab5f39a4b03a5","infoHashBuffer":{"type":"Buffer","data":[210,240,30,38,17,76,41,194,116,80,209,25,161,218,181,243,154,75,3,165]},"announce":[],"urlList":[]}}