{"title":"Lost &amp; Found - Consumed","uid":11667814,"size":193515589,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:db539a24e1c3bcc071d6f9f7562c9c299823b21f&amp;dn=Lost+%26amp%3B+Found+-+Consumed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"psymedia","files":10,"time":1418086492,"description":"Lost &amp; Found returns with his new full-length album 'Consumed'. Released for free in collaboration with the dynamic online publication Psymedia in order to break down the barriers for music to reach the listeners as efficiently as possible. Old music-delivery systems have become ineffective and obsolete, with negative consequences for both the artist and the listener. The way we consume music and information has changed forever. We are entering a new phase where chaos rules. There is no right or wrong. \n\nWhile his last album 'Decoder' seeked cold perfection, 'Consumed' aims to capture the vibe as it was when it was being made in the studio. By directly providing the same audio files he uses in his live sets directly into the hands of the audience, a sense of connection and relief is restored in this age of information overload. \n\nThis text is probably being read while you are immersed in social media, You are most likely doing many things at once. Maybe you are in the company of friends while you read this on your phone. It's possible that your attention span stopped you from reading this far. If you are still here, your neural pathways might still be intact. Is this text actually you addressing yourself in the second person? Press the download button. Reprogram yourself. 1010101. Revolution begins with changes in the individual. \n\nEnd of message. 20/11/2014","torrent":{"xt":"urn:btih:db539a24e1c3bcc071d6f9f7562c9c299823b21f","amp;dn":"Lost+%26amp%3B+Found+-+Consumed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db539a24e1c3bcc071d6f9f7562c9c299823b21f","infoHashBuffer":{"type":"Buffer","data":[219,83,154,36,225,195,188,192,113,214,249,247,86,44,156,41,152,35,178,31]},"announce":[],"urlList":[]}}