{"title":"NubileFilms - Abby Cross (Cumming For Dinner)","uid":11048875,"size":366759759,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:dfc72b87ab0054b04f517b341c4b087da3c9b392&amp;dn=NubileFilms+-+Abby+Cross+%28Cumming+For+Dinner%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"9jntm","files":1,"time":1410990000,"description":"NubileFilms - Abby Cross (Cumming For Dinner)\n &lt;a href=&quot;\nhttp://hotimages.eu/img-5419cc930dc7e.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://hotimages.eu/img-5419cc930dc7e.html&lt;/a&gt;\n &lt;a href=&quot;\nhttp://hotimages.eu/img-5419cc931dd0b.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://hotimages.eu/img-5419cc931dd0b.html&lt;/a&gt;\n\nLuscious Abby Cross has decided to prepare dinner and dessert for her man. Dressed in a tight red dress complete with a short miniskirt and high heels, Abby prepares her meal for her man Bruce Venture. The pair relaxes and enjoys a few glasses of wine before dinner, but time flies so fast that soon Abby's meal is burning!\nFortunately, Bruce has something different in mind for the main course, and soon his and Abby's lips are meshed in a passionate kiss that will lead to so much more. Clothes start flying as Abby undresses them both one piece at a time. After slipping out of her dress and bra, she relieves Bruce of his shirt and pants so that she can reach the true object of her desire. Bruce's cock is already rock hard when Abby pulls it from his pants, and the brunette takes advantage right away. Using her hand to pump her beau's dick, she gets her warm wet mouth in on the action for a blowjob that hits a breakneck pace. Even as Bruce enjoys Abby's oral pleasures, he can't keep his hands off her tight body. Leaning forward, he pulls her sheer thong away to open the way for her to mount his long fuck stick and slide down until she is completely impaled. Laying back on the couch, Bruce enjoys letting his woman take the lead for a few moment as she rides him, but he can't stay impassive for long. He rises to his feet, carrying Abby with him so that he can place her on her back and dive in to her dripping bald muff with his soft tongue. Moments later he slides back into her from behind and commences a proper pussy pounding that leaves Abby moaning. As their lovemaking grows more enthusiastic, Abby gradually makes her way back on top of her man so that Bruce can thrust up with hard fast strokes that make her entire horny body quiver. As their sexual romp continues, Bruce and Abby constantly change up who is on top as they each take their turn setting the pace of their lovemaking, to each of their mutual pleasure. When Abby has finally had her fill, she helps her man find his own ecstasy by kissing her way down his washboard abs and taking his cock back in her mouth. It only takes a few moments of that soft warm stimulation and then a few strokes in the tight glove of her velvety twat for Bruce to lose the last of his restraint. Pulling out at the last moment, Bruce jets his load all over Abby's lush ass and pussy, covering her in his sticky love.","torrent":{"xt":"urn:btih:dfc72b87ab0054b04f517b341c4b087da3c9b392","amp;dn":"NubileFilms+-+Abby+Cross+%28Cumming+For+Dinner%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfc72b87ab0054b04f517b341c4b087da3c9b392","infoHashBuffer":{"type":"Buffer","data":[223,199,43,135,171,0,84,176,79,81,123,52,28,75,8,125,163,201,179,146]},"announce":[],"urlList":[]}}