{"title":"Coming to Grips with Genesis - Terry Mortenson","uid":11773179,"size":699878,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e0c47d011afbfa1d75e2940fa38198551f51f7a1&amp;dn=Coming+to+Grips+with+Genesis+-+Terry+Mortenson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"starxteel","files":1,"time":1427157568,"description":"\nFourteen theological scholars address key topics related to the age of the earth, which is the crucial issue of debate in the church today regarding origins. Bringing to bear rigorous biblical, theological, and historical arguments in favor of a six-day creation, the global Flood, and a young earth, they also provide much-needed critiques of a number of contemporary old-earth interpretations of the book of Genesis.\n\nThis fresh defense of the literal history of Genesis 1-11 nicely complements other studies which focus more on the scientific evidence of young-earth creationism. As such, this book can serve as a versatile supplement to other works, but is also designed to be used as a standalone text for seminary and Bible college professors and students, pastors, missionaries, and others who want in-depth apologetic resources.\n\nComing to Grips with Genesis: Biblical Authority and the Age of the Earth includes:\n\n-Forewords by Dr. John MacArthur, President of the Master's Seminary and Senior Pastor of Grace Community Church, Sun Valley, CA; and the late Dr. Henry Morris, Founder and President Emeritus, Institute for Creation Research\n-Detailed analysis of the verbs of Genesis 1\n-A defense of the Genesis 5 &amp; 11 genealogies as strict chronologies\n-Reasons for rejecting millions of years of death and natural evil before Adam's sin\n-Careful reflection on Jesus' teachings regarding a young earth\n\n\nAbout the author:\nDr Terry Mortenson (M.Div., Trinity Evangelical Divinity School; Ph.D., history of geology, Coventry University; England) was a missionary with Campus Crusade for Christ for 26 years before joining Answers in Genesis USA in 2001 as a speaker, writer, and researcher. During the past 30 years he has lectured and debated on the subject of creation and evolution in 19 countries. He is author of numerous articles and book chapters on this issue and of The Great Turning Point: the Church's Catastrophic Mistake on Geology-Before Darwin (2004). Dr. Thane Hutcherson Ury (M.Div., Asbury Theology Seminary; Ph.D., Systematic Theology, Andrews University) taught in the Religion and Philosophy Department at Bethel College in Indiana for 15 years, before joining the faculty at the United Wesleyan Graduate Institute, Hong Kong, China, in 2006. He has taught theology, apologetics, and creation related subjects in America, Romania, Nigeria, Trinidad, Singapore, and China","torrent":{"xt":"urn:btih:e0c47d011afbfa1d75e2940fa38198551f51f7a1","amp;dn":"Coming+to+Grips+with+Genesis+-+Terry+Mortenson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0c47d011afbfa1d75e2940fa38198551f51f7a1","infoHashBuffer":{"type":"Buffer","data":[224,196,125,1,26,251,250,29,117,226,148,15,163,129,152,85,31,81,247,161]},"announce":[],"urlList":[]}}