{"title":"Our Car as Power Plant","uid":11054079,"size":6135116,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e682fb5422191ebfd508cf84adf80b11fafb32ae&amp;dn=Our+Car+as+Power+Plant&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Jallentino","files":2,"time":1411065234,"description":"Our Car as Power Plant by A.J.M. Van Wijk\nIOS Press | January 15, 2014 | English | ISBN: 1614993769 | 108 pages | PDF | 6 MB\n\n\nFuel cell cars can provide more efficient and cleaner transportation. However, we use our cars for transportation only 5% of the time. When parked, the fuel cell in the car can produce electricity from hydrogen, which is cleaner and more efficient than the current electricity system, generating useful waste products in the form of heat and fresh water. The produced electricity, heat and fresh water can be fed into the respective grids or be used directly in our house, office or the school of our kids. The required hydrogen can be produced from gas (natural gas, biogas) or electricity (hydro, wind, solar, etc.). In the end, these fuel cell cars can replace all power plants worldwide. As a result, the car as power plant can create an integrated, efficient, reliable, flexible, clean, smart and personalized transport, energy and water system: a real paradigm shift. The Car as Power Plant is developed at Delft Technical University, in The Green Village: a sustainable, lively and entrepreneurial environment where we discover, learn and show how to solve societys urgent challenges. The Green Village unifies clever, imaginative strengths of scientists and entrepreneurs and turns ideas and visions into experiences and commercially viable products and services. Innovative power that sets horizons for a new, sustainable, green and circular economy.\n &lt;a href=&quot;\nhttp://i.imgur.com/9vZAEqC.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/9vZAEqC.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:e682fb5422191ebfd508cf84adf80b11fafb32ae","amp;dn":"Our+Car+as+Power+Plant","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e682fb5422191ebfd508cf84adf80b11fafb32ae","infoHashBuffer":{"type":"Buffer","data":[230,130,251,84,34,25,30,191,213,8,207,132,173,248,11,17,250,251,50,174]},"announce":[],"urlList":[]}}