{"title":"Evander Holyfield vs Riddick Bowe II.mkv","uid":10933096,"size":909942323,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:e71fc92469da7a46d70deed01272cd83cfee3d99&amp;dn=Evander+Holyfield+vs+Riddick+Bowe+II.mkv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"parsoma2006","files":1,"time":1409415882,"description":"Riddick Bowe vs. Evander Holyfield II, billed as &quot;Repeat or Revenge&quot;, was a professional boxing match that took place on November 6, 1993 for the WBA, IBF and Lineal Heavyweight championships.\n\nThe two fighters had previously met a little less than a year before on November 13, 1992. In what would become one of the greatest heavyweight fights of all time, Bowe would defeat Holyfield by unanimous decision to become the Undisputed Heavyweight Champion. Bowe's reign as Undisputed Champion would not last long, as his victory over Holyfield now meant he would have to make the first defense of his newly won titles against Lennox Lewis, the man who had defeated him at the 1988 Olympics to capture the Gold Medal. After the two sides could not get a deal done, Bowe chose to forfeit his WBC title rather than face Lewis, throwing the belt in the trash at a press conference. Bowe would then go on to successfully, and easily, defend his remaining WBA and IBF titles twice, first knocking out 34-year old former WBA Heavyweight champion Michael Dokes in the first round, and then defeating journeyman Jesse Ferguson by way of second round knockout. Holyfield, meanwhile, would have only one fight between his two Bowe fights, a rematch with Alex Stewart. Though Holyfield looked sluggish throughout the fight, he nevertheless was able to earn the victory via unanimous decision. On August 12, 1993 the much anticipated rematch between Bowe and Holyfield was announced.\n\nFile from World Boxing Video Archive. Text from Wikipedia.","torrent":{"xt":"urn:btih:e71fc92469da7a46d70deed01272cd83cfee3d99","amp;dn":"Evander+Holyfield+vs+Riddick+Bowe+II.mkv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e71fc92469da7a46d70deed01272cd83cfee3d99","infoHashBuffer":{"type":"Buffer","data":[231,31,201,36,105,218,122,70,215,13,238,208,18,114,205,131,207,238,61,153]},"announce":[],"urlList":[]}}