{"title":"King of Thorn Movie (BDRip 1080p x264 AC3)","uid":11674049,"size":3234051230,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:e82d38b778ff492707b08aa094141fb6ee7f5dfb&amp;dn=King+of+Thorn+Movie+%28BDRip+1080p+x264+AC3%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"anime4life.","files":1,"time":1422783237,"description":"\nSummary\n- King of Thorn is a science fiction survivor drama. For its most part, the story is viewed through the eyes of the two protagonists, a Japanese girl named Kasumi and a British man named Marco Owen. Kasumi is introduced as one of only 160 people in the whole world who were chosen as candidates to experiment a cure against the deadly Medusa virus, a mortal disease which was running rampant in the world. Such an event is not met with joy by Kasumi, who is forced to enter treatment and cold sleep without her twin sister Shizuku, whom she cares much about.\n\n48 hours later, however, some of those put in hibernation abruptly woke up, only to find the facility where they were supposed to be treated in a total state of decay, invaded by a lush jungles of trees and especially strange vines covered in thorns, which appear to have something of a mind on their own. Not only that, but the survivors soon discover that the entire ruin is filled with strange, dinosaur-like creatures and other monstrous aberrations of nature. Thinking that a great amount of time passed since their arrival on the island, soon the survivors discover not only that their sleep was indeed too short to label such dramatic changes as natural occurrence, but also that the situation in and of itself is far greater than they could imagine.\n\nVideo\n- Video Source: Blu ray\n- Video Codec: H.264/AVC\n- Video Resolution: 1080p HD (16:9)\n\nAudio\n- Codec: AC3\n- Track 1: English 5.1 ch\n- Track 2: Japanese 5.1 ch\n\nSubtitles\n- English\n                 \n                 Please See!","torrent":{"xt":"urn:btih:e82d38b778ff492707b08aa094141fb6ee7f5dfb","amp;dn":"King+of+Thorn+Movie+%28BDRip+1080p+x264+AC3%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e82d38b778ff492707b08aa094141fb6ee7f5dfb","infoHashBuffer":{"type":"Buffer","data":[232,45,56,183,120,255,73,39,7,176,138,160,148,20,31,182,238,127,93,251]},"announce":[],"urlList":[]}}