{"title":"The Anthony Cumia Show 2015-02-12 MP4 MP3 combo","uid":11699404,"size":296140552,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:e97ad5965b47e9d4251257782bd9c48549ca9a25&amp;dn=The+Anthony+Cumia+Show+2015-02-12+MP4+MP3+combo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mothergoose58","files":2,"time":1423851283,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nEpisode 110: Wrapping up TACS week, pajama pants Ant admits he isn't the best with conflict but wants to end the &quot;back and forth&quot; with Opie and vows to hash things out with him, he talks about missing Patrice's benefit show last night, conveys his love for Bill Burr, and addresses Reddit and Facebook as well. After a few &quot;interesting&quot; calls, Anthony talks about Bob Simon's sudden death and we see a spooky old news clip of him in Tel Aviv, he discusses the difference in looks with our military and Israel's, tranny's in prison, a teenager who got penis reduction surgery, and we hear some new entries for the &quot;Most Offensive Song&quot; contest. We watch a few &quot;GTA-like&quot; police chases, see a sweet road rage video, a news story (that is pure propaganda) with &quot;Radical Brownies&quot; and find out that H1Z1 is apparently quite addictive. We hear about the first down syndrome model at NY Fashion Week, view the submissions for the &quot;Fifty Shades of Grey Vermont Teddy Bear&quot; contest, find out that Kanye has voices in his head, go through a bit of the &quot;Political Punks&quot; article by Gavin McInnes, learn that a sick ass Asian supermarket in America sells some sick ass &quot;meat&quot;, and end the show by watching a video of an out of control mall fight.\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\n\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:e97ad5965b47e9d4251257782bd9c48549ca9a25","amp;dn":"The+Anthony+Cumia+Show+2015-02-12+MP4+MP3+combo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e97ad5965b47e9d4251257782bd9c48549ca9a25","infoHashBuffer":{"type":"Buffer","data":[233,122,213,150,91,71,233,212,37,18,87,120,43,217,196,133,73,202,154,37]},"announce":[],"urlList":[]}}