{"title":"Parliament - First Thangs (1992) [FLAC]","uid":10744187,"size":527629611,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e9ab40e4ca739507621ed0b48715ae60135c58c1&amp;dn=Parliament+-+First+Thangs+%281992%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":null,"files":22,"time":1407798188,"description":" Review by Ned Raggett  [-]\n\nWhen Osmium finally got a proper CD rerelease in America in 1992, it was retitled and expanded with singles from the same period (a number of them being alternate takes), resulting in the near disc capacity joy that is First Thangs. With reasonable if not revelatory liner notes from Lee Hildebrand -- no discographical notes about the extra tracks are provided, annoyingly -- and fine enough remastering, it's not totally perfect but still a good thing to have around the house. Given how a number of tracks were later remade under both the Parliament and Funkadelic guises, being able to hear earlier incarnations of the songs makes for a treat. The Osmium cuts make up the last two-thirds of the disc, with the first six tracks given over to the bonus cuts. &quot;Red Hot Mama&quot; leads the way with an explosive Eddie Hazel solo, turning into a slow monster riff that rivals whatever Jimmy Page and Tony Iommi were coming up with in 1970. Everyone else comes in and brings the funk, Worrell contributing a stentorian keyboard pace to the proceedings. &quot;Fantasy Is Reality&quot; works the social conscience approach well, if indirectly, but the real reason to tune in is the uplifting, bright charge of the music, mixing both more crumbling Hazel fuzz and gospel vocal flight. &quot;Loose Booty,&quot; meanwhile, really is loose, taking over ten minutes time to deliver its slow, steady grooves. It's clearly more a jam than a song, with more than a few points where nearly everybody stops to take a breather or do some prog metal weirdness, while vocals only come in towards the end. It's still a pretty good jam nonetheless, with Worrell adding extra melody over the central riff and beat and the singers delivering some classic psych funk spaciness.\n","torrent":{"xt":"urn:btih:e9ab40e4ca739507621ed0b48715ae60135c58c1","amp;dn":"Parliament+-+First+Thangs+%281992%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9ab40e4ca739507621ed0b48715ae60135c58c1","infoHashBuffer":{"type":"Buffer","data":[233,171,64,228,202,115,149,7,98,30,208,180,135,21,174,96,19,92,88,193]},"announce":[],"urlList":[]}}