{"title":"Tax Assistant for Excel 5.31 2010","uid":11714403,"size":6892123,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ea002d0bd00678560ed0a74ce64d7d948e8da7be&amp;dn=Tax+Assistant+for+Excel+5.31+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mdusanjay","files":1,"time":1424492932,"description":"Tax Assistant for Excel (2010) Professional 5.31 \n\nTax Assistant for Excel is a custom application written for Microsoft Excel and requires Microsoft Excel. It simplifies your Federal Income Tax preparation by providing Excel workbooks with IRS approved substitutes of Form 1040 and Form 1040A with Schedules A, B, C, C-EZ, D, E, SE, Forms 6251 (AMT), 4952, 6781, 8829 and 8949. There are also a number of worksheets related to deductions and Schedule D including the Social Security Benefits, Qualified Dividends and Capital Gain Tax, and Child Tax Credit worksheets.\n\nYour sources of income, deductions, capital gain transactions as well as partnership and S corporation income are entered on separate worksheets. The data from these worksheets is then automatically entered into the correct forms. Tax Assistant for Excel helps you determine whether to itemize deductions, automatically calculates your tax and provides a computerized record of your tax filing. The program also provides an automated Schedule D and Form 8949 preparation that is especially helpful for active traders and other taxpayers with a large number of trades to report. The program allows you to easily enter or copy and paste your trades into the Capital Gains sheet and print out a Schedule D attachment as a substitute for preparing multiple Form 8949's, although the program will prepare up to 100 Form 8949's","torrent":{"xt":"urn:btih:ea002d0bd00678560ed0a74ce64d7d948e8da7be","amp;dn":"Tax+Assistant+for+Excel+5.31+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea002d0bd00678560ed0a74ce64d7d948e8da7be","infoHashBuffer":{"type":"Buffer","data":[234,0,45,11,208,6,120,86,14,208,167,76,230,77,125,148,142,141,167,190]},"announce":[],"urlList":[]}}