{"title":"The Anthony Cumia Show 2015-04-02 Filter, Dennis Hof MP4 MP3","uid":11794704,"size":352405864,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:ebab73a6e064eea4f1c9b05f3e984462056a205b&amp;dn=The+Anthony+Cumia+Show+2015-04-02+Filter%2C+Dennis+Hof+MP4+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"mothergoose58","files":2,"time":1428086221,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nGuest(s): Filter, Dennis Hof, Krissy Summers\n\nEpisode 139 - The show opens with Filter Live from the Compound performing Welcome to the Fold! Anthony talks about the awesome performance and Rat panicking to set up for it. He discusses the &quot;Memories Pizza&quot; news story and the 225K raised, the Iran nuclear deal and find out when Ant's pool will open. Filter then plays Take a Picture, we watch a video of a shooting victim bleeding and angry at the cop who shot him, and Robert and Oumi from the band sit down and talk at the &quot;table of the stars&quot;. They discuss vocal technique, vaporizers, managing anxiety on-stage, touring, electric cars, Trent's academy award, movie soundtracks, pop music, and how downloading something is the same as depriving a shop-keep of their physical property (protip: it's not). Next up on this super-show Dennis Hof from the Bunny Ranch sits down at the TOTS along with the lovely Krissy Summers. Krissy talks about Big A sneaking a look at pictures, Dennis introduces her and his book The Art of the Pimp. They talk prostitution, what customers experience at the Ranch, Krissy's sex life, how Dennis does not like the word Pimp, his visit to a Pimp convention, turning potential girls away, odd sex partner pairings, Mike Bocchetti auditioning for employment, publicity stunts gone wrong, the Scott Thorson story, people banned for life from the Ranch, and we close the show the massive book release party.   \n\n\nNote: Went max rate on the HE-AAC encode for this episode due to the musical performance. You're welcome!\n\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:ebab73a6e064eea4f1c9b05f3e984462056a205b","amp;dn":"The+Anthony+Cumia+Show+2015-04-02+Filter%2C+Dennis+Hof+MP4+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebab73a6e064eea4f1c9b05f3e984462056a205b","infoHashBuffer":{"type":"Buffer","data":[235,171,115,166,224,100,238,164,241,201,176,95,62,152,68,98,5,106,32,91]},"announce":[],"urlList":[]}}