{"title":"[XLGirls] Kelli Maxx (Kelli's First XXX Scene / 09.16.2014)","uid":11057280,"size":586663893,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:eda05f2cfd8e948b559291876808fd73e3fa7d34&amp;dn=%5BXLGirls%5D+Kelli+Maxx+%28Kelli%27s+First+XXX+Scene+%2F+09.16.2014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"chkm8te","files":1,"time":1411085954,"description":"[XLGirls] Kelli Maxx (Kelli's First XXX Scene / 09.16.2014)\n\nAfter my first time posing at XLGirls, I now feel more confident and less afraid to be naked in front of strangers,&quot; says pretty brunette Kelli Maxx, now back and taking her first step into hot sex. &quot;I'm able to perform with less direction.&quot; Kelli's a web-cam girl who was a newcomer to pro-modeling until she was courted by XL Girls. Doing hardcore with a pro-cock is a first for sexy Kelli, a quick learner who takes things in her own hands and fucks beautifully in her first, very bone-raising XXX scene. &quot;So, I'm going to have sex on-camera for the very first time,&quot; says Kelli, wearing a sheer negligee. &quot;And his dick is really big and I think he might cum on my face. He might fuck my huge tits. Real excited. Kinda nervous.&quot; Largo greets Kelli. She's been waiting, sitting on the bed. He makes a beeline for Kelli's big boobs. Naturally. A guy would need the hands of a giant to completely hold her boobs. They talk about Kelli's first time, her on-camera cherry pop. &quot;Gonna be nice?&quot; Kelly asks. Juan assures Kelli he will. Kelli gets on her hands and knees and takes his massive member in her mouth, licking and sucking it. Largo takes Kelli's tits out of her negligee to suck them and play with them. She squeezes her boobs together and massages his cock between them. Kelli removes her nightie completely and gets on her back for an epic tit-fuck. The brunette hottie's got major talents she's kept secret! The next major event is on. Kelli gets on her hands and knees for her first fuck. Largo peels off her little panties, rubs Kelli's pretty pussy and slides his beef in all the way and begins pumping. Kelli matches his thrusts with her hips. &quot;So tight,&quot; Largo says. The camera moves to Kelli's face, lost in sex. Kelli climbs on top to ride the buckin' bronco. They switch speeds, from slow to fast and then slow again. Kelli gets on her back for a face-to-face. More hot positions await after this. Seeing Kelli get fucked every which way, her big heavy HH-cup boobs jiggling and shaking with every thrust, is an amazing sight. Thank you, Kelli Maxx, for taking XL Girls where no man has gone before.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=eqc3sxo2vkijqg6qwsi0.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=eqc3sxo2vkijqg6qwsi0.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=8jt2x1jjqptt1z8992ed.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=8jt2x1jjqptt1z8992ed.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:eda05f2cfd8e948b559291876808fd73e3fa7d34","amp;dn":"%5BXLGirls%5D+Kelli+Maxx+%28Kelli%27s+First+XXX+Scene+%2F+09.16.2014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eda05f2cfd8e948b559291876808fd73e3fa7d34","infoHashBuffer":{"type":"Buffer","data":[237,160,95,44,253,142,148,139,85,146,145,135,104,8,253,115,227,250,125,52]},"announce":[],"urlList":[]}}