{"title":"DNSK-The_Ghettoblaster-Rock_Steady-720p-AVC-AAC-2015","uid":11776874,"size":4857213855,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:ef73243615e56641de71d71caf0714f0bddd3a44&amp;dn=DNSK-The_Ghettoblaster-Rock_Steady-720p-AVC-AAC-2015&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dnsk","files":3,"time":1427341754,"description":"WARNING: THIS VIDEO CONTAINS FLASHING GRAPHICS. DO NOT WATCH IF YOU ARE SENSITIVE!\n\n-\n\nSUPPORT THE ARTISTS! LISTEN TO THEIR STUFF! BUY IT IF IT'S ON SALE! USE IT - BREAK IT - FIX IT - AND BUY MORE IF YOU TRASH IT AND UPGRADE YOUR MUSIC COLLECTION BECAUSE THEIR WORK IS SUPPOSED TO BE SUPPORTED IN ALL WAYS POSSIBLE! \n\nThis audiovisual DJ mix video is made with full respect for respective artist and all kudos goes to them for inserting their awesome tunes into our ears. \n\n-\n\nDESCRIPTION:\n\nI made this audiovisual DJ mix late in the night after reviewing &quot;Ghetto Funk Mix June 2014&quot; from last summer that has poor audio quality on some of the tracks used. This one has good sound though on all of its 24 carefully selected and uttermost delicious ghetto funk tunes that are derived from the Interwebz.\n\nNow, for those who don't know what a ghettoblaster is (that also can be written in two words as 'ghetto blaster') or for that matter wonder what heck ghetto funk is anyway, let me quote Urban Dictionary:\n\nGhetto Funk: &quot;A mid-tempo electronic music genre that blends breakbeat, funk, hip-hop, and bass music. Could perhaps be seen as a modified form of &quot;nu-funk&quot; or &quot;breakbeat&quot; in itself. The underground movement is best represented by the eponymous blog www.ghettofunk.co.uk, which also releases exclusive promotions for artists of the scene.&quot; - http://www.urbandictionary.com/define.php?term=Ghetto+Funk\n\nGhetto Blaster: &quot;A large, portable, radio cassette player, measuring about 1.5 m wide and 1.0 m high. It is played especially outdoors, in public places at loud volume; and carried on one shoulder with loudspeakers facing the head. It is assumed that bypassers share the same musical taste.&quot; - http://www.urbandictionary.com/define.php?term=ghetto+blaster\n\nSo, are you ready to jam? I am!\n\nFeel free to share this video around.\n\nEnjoy!\n\n-\n\nPROCEDURE:\n\nThe audio tracks used are mixed by me with MixMeister Studio v7.4.4.0 and the visuals in the video was made by me using a combination of the MilkDrop visualization plug-in v2.25c, Winamp v5.666, FRAPS v3.5.99, Sony Vegas Pro v13.0 and some feel for the beat in synergy with my trusted midi-tower Blitz - the Intel Core 2 Quad and 2 x ATi HD5770 powered wingman of choice. \n\n-\n\nINFO:\n\nTitle: DNSK - The Ghettoblaster: Rock Steady\nContent: Audiovisual art\nType: Music video\nYear: 2015\nFormat: MP4\nVideo: MilkDrop v2.25c / 29,970 fps; 1280x720 Progressive; YUV; VBR 8 Mbps; AVC\nAudio: DNSK - The Ghettoblaster: Rock Steady / 320 Kbps; 44Â 100 Hz; 16 Bit; Stereo; AAC\nDuration: 01:17:51\n\n-\n\nTRACKLIST:\n\n01. The Captain - H2H (DNSK Re-Cut)\n02. Jackson 5 - ABC (A.Skillz Remix)\n03. Stickybuds - Been Real, Murderer, Don't Deny It, Out Of Debt\n04. Parker - Hear Ya Say\n05. Beatles - Come Together (A.Skillz Remix, FK5 Video Edit)\n06. Aretha Franklin - Rock Steady (Parker Remix)\n07. Kidda - Wanna Be Loved (Dancefloor Outlaws Remix, DNSK Re-Cut)\n08. J-Roc (Sould Out DJs) - Nickelodeon (DNSK Re-Cut)\n09. Ray Charles - Good Thymes (Opiuo Remix)\n10. The Asteroids Galaxy Tour - Golden Age (Pimpsoul's Refunk)\n11. Pimpsoul - On Point\n12. Eric Clapton - Cocaine (Dancefloor Outlaws Remix, DNSK Intro Re-Cut)\n13. The Sly Players - On The Hook (The Captain Remix)\n14. Mooqee &amp; Pimpsoul - Keep Pounding (Original Mix)\n15. Fdel - Rocksteady (DNSK Remix)\n16. Mooqee &amp; Pimpsoul - Do It\n17. Toastbusters - Dope 'n' Spicey\n18. Chase &amp; Status feat. Kano - Against All Odds\n19. The Dancefloor Outlaws - Betty Beat\n20. Fort Knox Five - Papa was Stoned\n21. The Breakbeat Junkie vs. DJP - Drop Down (DNSK Re-Cut)\n22. Bob Marley - Jammin' (CMC &amp; Silenta Remix)\n23. DJ Deekline &amp; Ed Solo feat. Booty Pit - Wu Tang Sausage\n24. Defunk - Banjo Blues (Original Mix)\n\n-\n\nBIO:\n\nDNSK was set to walk Earth 33 years ago and resides in the land of Swedes where the sun in the northern parts never rises during the winter. He has been a DJ since 1994 and produces DJ mixes as well as audiovisual art in the form of music videos along with them.\n\nHis interests in life includes music from various styles and genres along with sound- and visual art in all forms and shapes, though mainly - besides abstract compositions and pop art/lowbrow - surrealism, which he finds pleasing to the mind on many levels. \n\nNothing less, but maybe more - a question of interest.\n\n-\n\nLINKS:\n\nYouTube: /channel/UCPmXy2zg1H5AS0__UkNMjlw\n\nFacebook: /dnsksweden\n\nTwitter: /dnsksweden\n\nMixcloud: /dnsksweden\n\nSoundCloud: /dnsksweden\n\nImgur: /user/dnsksweden\n\njuxtajive\n\n-\n\nCONTACT:\n\ndnsksweden at gmail / #DNSK at EFNet - chat.efnet.org:9090\n\n-\n\nThank you for watching!\n\nDNSK","torrent":{"xt":"urn:btih:ef73243615e56641de71d71caf0714f0bddd3a44","amp;dn":"DNSK-The_Ghettoblaster-Rock_Steady-720p-AVC-AAC-2015","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef73243615e56641de71d71caf0714f0bddd3a44","infoHashBuffer":{"type":"Buffer","data":[239,115,36,54,21,229,102,65,222,113,215,28,175,7,20,240,189,221,58,68]},"announce":[],"urlList":[]}}