{"title":"Mega Man X Collection (USA) PS2","uid":11780797,"size":2241419711,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:f1d5eb303190ce789d18cbba27dada62e478e0b2&amp;dn=Mega+Man+X+Collection+%28USA%29+PS2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":null,"files":1,"time":1427565325,"description":"Mega Man X Collection is a compilation of video games developed by Capcom. Released\n\n on January 10, 2006 exclusively in North America for the Nintendo GameCube and Sony \n\nPlayStation 2 platforms, Mega Man X Collection contains the first six games in the \n\nMega Man X series, which originated on the Super Nintendo Entertainment System and \n\nmade its way onto various 32-bit consoles and PC. The plot follows the protagonist \n\nMega Man X and his partner Zero as they battle Sigma and his army of &quot;Maverick&quot; \n\nrobots. All six games are action platformers in which the player traverses a series \n\nof stages and gains the special weapons of defeated bosses.\n\nIn addition to these games, Mega Man X Collection includes unlockable artwork and music relating to the series, as well as Mega Man Battle &amp; Chase, a racing game based on the original Mega Man series that was previously unreleased in North America. The compilation is a follow-up to Mega Man Anniversary Collection, another compilation of ten games in the original Mega Man series previously released on both platforms and the Microsoft Xbox. Critical reception for Mega Man X Collection has been average to fairly positive. Reviews have noted it as a competent portfolio of games of varying quality, but have expressed negative comments regarding its lack of additional content","torrent":{"xt":"urn:btih:f1d5eb303190ce789d18cbba27dada62e478e0b2","amp;dn":"Mega+Man+X+Collection+%28USA%29+PS2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1d5eb303190ce789d18cbba27dada62e478e0b2","infoHashBuffer":{"type":"Buffer","data":[241,213,235,48,49,144,206,120,157,24,203,186,39,218,218,98,228,120,224,178]},"announce":[],"urlList":[]}}