{"title":"Immortal Beloved - Original Motion Picture Soundtrack 320cbr (Bi","uid":11055023,"size":174626674,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f51e5fe91c836c07ad84c24e8080f89a9b020db0&amp;dn=Immortal+Beloved+-+Original+Motion+Picture+Soundtrack+320cbr+%28Bi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Big-Papi","files":17,"time":1411084937,"description":"Source: 1994 CD\n \n[i]Note: This is a highly regarded soundtrack packed full of classical Beethoven music. If you like classical you will love this. - Big Papi[/i]\n \n \n \n \n \nBy Carlos Avila\n\n[quote]As Amadeus praised and popularized the music of Mozart, which triggered a cd chalk-full of his greatest moments, Immortal Beloved has created a cd which captures the very spirit of Beethoven. He is long dead, but we hear his soul speak again to us through his music. The film, starring Oldman and Rossalini, centered on the mysterious love letter Beethoven wrote at the end of his life, to an &quot;Immortal Beloved&quot;, whose love he carried with him throughout his life. This woman is either one of three women Beethoven was involved with, a widowed Countess of great fortune, a pupil of his and his brother's own wife, the blonde beauty he had loved in his youth. Only if you saw the movie do you know who this Immortal Beloved was, but the music set to the film, all works by Beethoven, capture not only the romance, but the genius, intensity, even pain that Beethoven experienced throughout his life. As a result of his deafness, he was only able to hear music in his head, music which we have come to know and love, works like his Ninth Symphony, a powerful, dynamic choral symphony that evokes liberty and universal love, the Eroica Symphony which he had written in honor for Napoleon until he discovered &quot;he made himself an enemy to all &quot; by crowning himself Emperor, the Moonlgiht Sonata which rumor has it he meant to musically describe what the moon looked like to an old blind woman, the Allegretto of his Seventh Symphony has an airy, somber and majestic beauty that fills us. The Kyrie of his Requiem is masterfully performed here by choral singers, including opera star Renee Fleming. The piano and violin pieces, Ghost Trio and Kreutzer Sonata, are all brilliantly performed by violinist extraordinare Yo-Yo Ma and pianist Emmanuel Ax. The music is a must have for all Beethoven fans, and I mean all. If you are a true Beethoven afficionado, this cd will become your trophy. Enjoy and listen to the music of a man whose genius touches us to this day[/quote]","torrent":{"xt":"urn:btih:f51e5fe91c836c07ad84c24e8080f89a9b020db0","amp;dn":"Immortal+Beloved+-+Original+Motion+Picture+Soundtrack+320cbr+%28Bi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f51e5fe91c836c07ad84c24e8080f89a9b020db0","infoHashBuffer":{"type":"Buffer","data":[245,30,95,233,28,131,108,7,173,132,194,78,128,128,248,154,155,2,13,176]},"announce":[],"urlList":[]}}