{"title":"Akai Ito","uid":11760315,"size":4805602776,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:fb3cf60ae8a593059590cedf21b7d3ad571b5c9d&amp;dn=Akai+Ito&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sithitac","files":22,"time":1426564446,"description":"Plot\n\nMei has been in love with Yuya all her life. They've grown up together. But when they reach their second year of middle school, Yuya suddenly professes his love for her older sister, Haruna.\nStruggling to rebound from her decade-long crush, Mei finds comfort in the close camaraderie of her school friends, Taka, Mia, Yuri, Natsu, Mitsu and Sara and then meets a reticent and gentle-natured boy named Atsushi. The two begin to realize that they share many things in common that seem to transcend mere coincidence: the same birthday (February 29th, 1992) and a previous encounter when they were both 8. Feeling a bond of fate, they grow closer.\nBut destiny can have a dark side to it, too, and a shocking revelation from both of their pasts compels Atsushi to pull away from Mei. The devastating separation then unleashes a wave of misfortune upon Mei: the death of a loved one, drug addiction and domestic violence. As circumstances seek to take control of her life, Mei struggles to maintain her faith in the tenuous thread of destiny that will reunite her with her true love","torrent":{"xt":"urn:btih:fb3cf60ae8a593059590cedf21b7d3ad571b5c9d","amp;dn":"Akai+Ito","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb3cf60ae8a593059590cedf21b7d3ad571b5c9d","infoHashBuffer":{"type":"Buffer","data":[251,60,246,10,232,165,147,5,149,144,206,223,33,183,211,173,87,27,92,157]},"announce":[],"urlList":[]}}