{"title":"Naked in the Promised Land- A Memoir by Lillian Faderman (retail","uid":11012767,"size":8759980,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fdc99d4492453efff04aa928fca21682a5467f45&amp;dn=Naked+in+the+Promised+Land-+A+Memoir+by+Lillian+Faderman+%28retail&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gratefuldawg77","files":6,"time":1410396475,"description":"Born in 1940, Lillian Faderman was the only child of an uneducated and unmarried immigrant Jewish woman. Her mother, whose family perished in the Holocaust, was racked by guilt at having come to America and left them behind; she suffered recurrent psychotic episodes. Her only escape from the brutal labor of her sweatshop job was her fiercely loved daughter, Lilly, whose poignant dream throughout an impoverished childhood was to become a movie star and &quot;rescue&quot; her mother. Lilly grew up to become Lil, outwardly tough, inwardly innocent, hungry for love and success. A beautiful young woman who was learning that her deepest erotic and emotional connections were to women, she found herself in a dangerous but seductive lesbian underworld of addicts, pimps, and prostitutes. Desperately seeking to make her life meaningful and to redeem her mother's suffering, she entered the University of California at Berkeley and worked her way through college as a burlesque stripper. A brilliant student, she ultimately achieved a Ph.D. At last she became Lillian, the woman who in time became a loving partner, a devoted mother, an acclaimed writer, and a charismatic, groundbreaking scholar of gay and lesbian studies. Told with wrenching immediacy and great power, this is an extraordinary memoir: the nakedly honest -- and very American -- story of an exceptional woman and her remarkable, unorthodox life.","torrent":{"xt":"urn:btih:fdc99d4492453efff04aa928fca21682a5467f45","amp;dn":"Naked+in+the+Promised+Land-+A+Memoir+by+Lillian+Faderman+%28retail","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fdc99d4492453efff04aa928fca21682a5467f45","infoHashBuffer":{"type":"Buffer","data":[253,201,157,68,146,69,62,255,240,74,169,40,252,162,22,130,165,70,127,69]},"announce":[],"urlList":[]}}