{"title":"BAM Blonde Anal MILFs (NEW FEB 2015 Evil Angel) [Split Scenes]","uid":11718173,"size":2036409462,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:fe193902f98271fb471864597349f5156fdf2f15&amp;dn=BAM+Blonde+Anal+MILFs+%28NEW+FEB+2015+Evil+Angel%29+%5BSplit+Scenes%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":5,"uploader":"H4ckuos","files":4,"time":1424691870,"description":"Directed By\nLe Wood\n\nStarring\nBridgette B., Chris Strokes, Christie Stevens, Mark Wood, Natasha Starr, Sarah Vandella\n\nCategories\nAnal, Ass, Ass to mouth, Behind The Scene, Big Dick, Big Tits, Blonde, Blowjob, Cumshot, Cumshot Compilation\n\nIn 'BAM Blonde Anal MILFs,' LeWood Productions delivers signature sodomy to porn vixens with the experience and lust to handle it. Busty Christie Stevens' big, dark eyes and toothy smile light up as she inserts a fox tail butt plug and then tastes it. The slut masturbates and squeezes her melons as LeWood director/stud Mark Wood reams her asshole; he slaps her boobs, cranks her legs way back and chokes her out. Adorable Sarah Vandella looks into the camera, her tongue extending lewdly under Mark's meat to tickle his nut sac. Her expression is precious as he crams cock up her ass. Butt fucking in multiple positions makes her bunghole gape widely. Bodacious Latina Bridgette B. is endowed with huge knockers, a fleshy ass, thick lips and big eyes, like a curvy porn cartoon. Chris Strokes' giant erection fits her tits and fills her ass, making her big cheeks quake. She swallows the sperm splashed on her face and jugs. Leggy Natasha Starr masturbates fiercely as Mark porks her up the ass. With his prick slathered in her anal flavor, he grips her blonde hair for an ass-to-mouth face fuck. LeWood co-director Francesca Le encourages the filth from behind the camera.\n &lt;a href=&quot;\nhttp://xxxhost.info/img-54eb0483139ea.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.info/img-54eb0483139ea.html&lt;/a&gt;","torrent":{"xt":"urn:btih:fe193902f98271fb471864597349f5156fdf2f15","amp;dn":"BAM+Blonde+Anal+MILFs+%28NEW+FEB+2015+Evil+Angel%29+%5BSplit+Scenes%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe193902f98271fb471864597349f5156fdf2f15","infoHashBuffer":{"type":"Buffer","data":[254,25,57,2,249,130,113,251,71,24,100,89,115,73,245,21,111,223,47,21]},"announce":[],"urlList":[]}}