{"title":"M&amp;M's The Lost Formulas [2000][PC]","uid":11714998,"size":643238666,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ffe47f237a31d40379780af7283ec604267bddaf&amp;dn=M%26amp%3BM%27s+The+Lost+Formulas+%5B2000%5D%5BPC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Swampfox56","files":2,"time":1424527700,"description":"This torrent is a reupload of my original torrent. This one includes way more trackers, and the new DHT protocol.                           \n\n\n\n                          |||M&amp;M's: The Lost Formulas||| \nPlatform: PC\nYear: 2000\nDeveloper: Boston Animation\nPublisher: Simon &amp; Schuster\n\nMy rating - 9/10\n\n\nM&amp;M's: The Lost Formulas is the first M&amp;M's video game and was released on September 28, 2000 for computers such as Windows 95, Windows 98, and Macintosh by Simon &amp; Schuster Interactive. It is a Crash Bandicoot style game, and also is optionally a game which teaches maths.\n\nDon't let that fool you though, this is an excellent game, and one that I happened across when I was a young kid. The game is decently hard, but fair. It gives you the exact amount of Continues and Lives you need without getting game over. The math option is a choice. You can select an option in the menu to turn the math levels off. However, the math levels aren't bad to be honest and it does add to the game. \n\nThe game is from a 3D perspective and the graphics are excellent for the time. Even though the game was relatively low budget, it has some excellent voice acting by Billy West and all the other well known voices of the M&amp;M's commercials. \n\nThe music a little repetitive, but surprisingly addicting. I've had them stuck in my head for years and enjoyed every second of it.\n\n------------------------------------------\n\nWhile I think the game is good (and maybe this only because I played it for hours as a little kid) it is quite cheezy. So keep that in mind if you decide to download and play the game. The game is relatively unknown from what I've seen on the internet, which is too bad because this game is actually a great game. \n\nKeep in mind the game is meant for 3-10 year olds. However, if you don't focus on the cheesy cut scenes and only focus on the actual gameplay, you're in for a fun experience. The game is a little hard, so don't be surprised if you become a little frustrated. However, it's not too hard and (like I mentioned above) they give you the perfect amount of lives.\n\nAnyways, here's another rare, not very well-known PC gem of the 90's...err... 2000's. \n\nP.S (READ ME!!!)\n\nI am planning on seeding this for a couple weeks before I stop. This may not get any downloads since it's not a very sought after game since it's not very well-known. However, if it just so happens that you're viewing this weeks, months, or years after seeding and you want the game - I would be happy to start seeding it at anytime for you. \n\nTo contact me, email me atand I'd be glad to start seeding it again for you!\n\nAnyways, Enjoy the game! God knows I have","torrent":{"xt":"urn:btih:ffe47f237a31d40379780af7283ec604267bddaf","amp;dn":"M%26amp%3BM%27s+The+Lost+Formulas+%5B2000%5D%5BPC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffe47f237a31d40379780af7283ec604267bddaf","infoHashBuffer":{"type":"Buffer","data":[255,228,127,35,122,49,212,3,121,120,10,247,40,62,198,4,38,123,221,175]},"announce":[],"urlList":[]}}